{
    "1ST": {
        "full_name": "FirstBlood",
        "mentioned_ids": [
            "dmbgv2z",
            "dmawdmj",
            "dmbf4wq",
            "dmbg14v"
        ],
        "mentioned_times": [
            1504103123.0,
            1504073989.0,
            1504099518.0,
            1504101321.0
        ],
        "text": [
            "Kind of crazy that Vietnam is the world leader in fully accepting Cryptocurrency as an economic system, free from taxation and oversight.\n\nI really hope the 1st world nations goes that path. Even if it doesn't seem likely right now",
            "Best scenario is that btc will become the birkshire Hathaway of crypto. Completely useless as a currency but a great investment for investment sake.\n\nI hope that's the outcome.\n\nIt's a 1st gen currency that is old and clearly busted.",
            "Populous. Huge announcement coming Sept 1st on their Twitter",
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything."
        ],
        "upvotes": [
            3,
            2,
            1,
            1
        ]
    },
    "2GIVE": {
        "full_name": "2GIVE",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ABY": {
        "full_name": "ArtByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADT": {
        "full_name": "adToken",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADX": {
        "full_name": "AdEx",
        "mentioned_ids": [
            "dmbfx4y",
            "dma314p",
            "dma5107"
        ],
        "mentioned_times": [
            1504101088.0,
            1504042088.0,
            1504044583.0
        ],
        "text": [
            "ADX... relatively small market cap, i.e. room to grow, partnered with Bitmain, advertising is always profitable, rumors of new partnerships being announced soon.",
            "Looks good. probably put your ripple into ETH.   \nThe rest is solid. Adex still speculative, pretty high risk.",
            "I'd definitely buy more Eth, and drop AdEx to add BAT. Better developers, more proof of work, better future, same purpose. Don't listen to the VTC naysayers, it has potential. "
        ],
        "upvotes": [
            2,
            1,
            1
        ]
    },
    "AEON": {
        "full_name": "Aeon",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AGRS": {
        "full_name": "IDNI Agoras",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AMP": {
        "full_name": "AMP",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ANT": {
        "full_name": "Aragon",
        "mentioned_ids": [
            "dmatzer",
            "dmalp5s"
        ],
        "mentioned_times": [
            1504071206.0,
            1504062347.0
        ],
        "text": [
            "NEO is crap in my opinion, only argument people claim in its favor is that it is a Chinese ETH. The whole point of crypto is borderless finance, global currency, etc, why the hell is a centralized chinese coin a good thing? Also where is the development on NEO, who is working to make the platform better, what advantages does it have over ETH, what uses does it have? ICOs? Bah, ETH is already ICO king platform, I laugh at people claiming that NEO will overtake ETH as the leading smart contract platform when they have no development, no testing, no product while ETH probably has one of the smartest group of people in the planet working to make the platform better and suitable for mass adoption. Only thing NEO has done is change its name from Ant to NEO, big fucking deal, but hey, at least its the Chinese Ethereum copy.\n\nDon't fall for pumping idiots",
            "This is *exactly* like mine, even the percentages are the same holy crap (of my initial investments at least). Differences are: I don't have aragon (have tenx instead) and have myst instead of singular dtv. Oh and btc classic instead of cash."
        ],
        "upvotes": [
            -1,
            1
        ]
    },
    "APX": {
        "full_name": "Apx",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ARDR": {
        "full_name": "Ardor",
        "mentioned_ids": [
            "dmad0q1",
            "dmae7az"
        ],
        "mentioned_times": [
            1504053364.0,
            1504054584.0
        ],
        "text": [
            "Look into Stratis. Despite a significant price decrease from their ATH, Stratis hasn't experienced any technical problems. Their program is only looking better than it did then. They've partnered with Earth Twine, a company that will be adding compliance to regulation of seafood onto the blockchain, such as verification of the origin and date the seafood was caught. I expect this to be the first Stratis sidechains, in addition to Blitzcash which was announced some time ago. Stratis is in a race to implement sidechains with Ark, and Ardor/NXT. \n\nStratis also has their Breeze wallet, which has TumbleBit integration. An alpha of Breeze should be released within the next two months; but they've verified and stress-tested Tumblebit within the wallet. Plus, they have one of the most professional crypto teams that I've come across. \n\nThe June price spike for Stratis wasn't a pump and dump, but was an early indication of their future success.\n\nDisclosure: I am/we are long STRAT.",
            "Ardor look i to it "
        ],
        "upvotes": [
            3,
            -1
        ]
    },
    "ARK": {
        "full_name": "Ark",
        "mentioned_ids": [
            "dmaw5dx",
            "6wq9l4",
            "dma4llx",
            "dmahzuf",
            "dmbemhg",
            "dmbemw0",
            "dmbenmb",
            "dmbcmq4",
            "dmbh858",
            "dma83of",
            "dmaifln",
            "dmabxhf",
            "dmah06b",
            "dmbd46z",
            "dma8olh",
            "dmaecec",
            "dmad0q1",
            "dmaog9e",
            "dma527j",
            "dma5hnc",
            "dmagrj1"
        ],
        "mentioned_times": [
            1504073719.0,
            1504030063.0,
            1504044055.0,
            1504058488.0,
            1504098536.0,
            1504098558.0,
            1504098597.0,
            1504095115.0,
            1504103947.0,
            1504048110.0,
            1504058949.0,
            1504052218.0,
            1504057466.0,
            1504095908.0,
            1504048751.0,
            1504054727.0,
            1504053364.0,
            1504065237.0,
            1504044624.0,
            1504045138.0,
            1504057220.0
        ],
        "text": [
            "I remember ark being shat on here during its last pump to 2.30 I believe.\n\nNow above that.\n\nDon't believe all the mud.",
            "YINX.IO - payment made easy - ARK Payment Gateway",
            "just sold my remaining NEO for ARK",
            "Not buying till it's below $30.\n\nBefore the run up I was gonna buy....instead I doubled on Ark....it's working out so far...",
            "ARK, DNT",
            "ARK. It's going to hibernate again...",
            "Ark!",
            "Not sure if Ark is still a sleeper but maybe the dip gives a good buy opportunity after last rally. \n\nOxycoin is brand new but already got a mainnet.",
            "Cant believe no ones spoken of Ubiq. Its been blowing up this week and still has a long ways to go. The typical bot response (great team, great idea yadd yadda) but its true. Its a better ETC and I would place the value around ETC. Also, if I'm not mistaken Bittrex has a hand in Ubiq and their killing it with their exchange. My other two are ARK and CIVIC ",
            "I'd hold a little ARK 100% ",
            "Overall I like it!\n\nPersonally, I'd dump BCH and 2-3 tokens. Reinvest in your current portfolio.\n\nI'd get more ETH. Even if you mining...\n\nSNGLS will pick up soon with some announcements. Lots of upside there.\n\nConsider picking up one or two of these: BAT, ARK, TAAS or PART.\n\nCheers.  ",
            "Not personally a fan of IOTA or BCH, or any gaming/gambling coins, but you should look into ARK, QTUM, PAY, BAT, CVC",
            "You are missing ARK and DNT and I think you are gambling with Monero and BCH. ",
            "Ark!  Invest. Thank me later. ",
            "Right now Ark, maybe soon I think Ubiq both are great IMO",
            "ARK",
            "Look into Stratis. Despite a significant price decrease from their ATH, Stratis hasn't experienced any technical problems. Their program is only looking better than it did then. They've partnered with Earth Twine, a company that will be adding compliance to regulation of seafood onto the blockchain, such as verification of the origin and date the seafood was caught. I expect this to be the first Stratis sidechains, in addition to Blitzcash which was announced some time ago. Stratis is in a race to implement sidechains with Ark, and Ardor/NXT. \n\nStratis also has their Breeze wallet, which has TumbleBit integration. An alpha of Breeze should be released within the next two months; but they've verified and stress-tested Tumblebit within the wallet. Plus, they have one of the most professional crypto teams that I've come across. \n\nThe June price spike for Stratis wasn't a pump and dump, but was an early indication of their future success.\n\nDisclosure: I am/we are long STRAT.",
            "Research the coins you believe in and those that you think will rise in value soon, I like Sia so I have some for the long term although I don't expect it to rise anytime soon, I also have some Lisk, Ark, Pivx & OMG I also want to keep these for the long term but those four are hopefully all going to have a good Q4 with various releases & a rebranding so I think there's short term profit as well if that's what you want to do. Good luck. ",
            "Looks Nice And solid. Also add ARK and/or NEO",
            "Wait with Neo. Just came out China news about ico regulations. Research Ark ",
            "I'd like to echo the recommendations of everyone; NEO and ARK.\n\nNeo is correcting right now. I'd give it a couple days of breathing room before jumping in. The coin has a lot of promising things going for it, so I would highly recommend considering it.\n\nArk is also trending down, so I'd be cautious/patient before jumping in.\n\nI'd also recommend giving OMG and LSK a look. They're pretty promising."
        ],
        "upvotes": [
            1,
            63,
            5,
            2,
            13,
            7,
            2,
            2,
            1,
            14,
            1,
            0,
            -2,
            3,
            13,
            5,
            3,
            4,
            4,
            4,
            2
        ]
    },
    "AUR": {
        "full_name": "AuroraCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BAT": {
        "full_name": "Basic Attention Token",
        "mentioned_ids": [
            "dmbcyrz",
            "dma8i02",
            "dmaifln",
            "dmabxhf",
            "dmb17av",
            "dmb3ksn",
            "dmba1ss",
            "dma5fc8",
            "dma5107"
        ],
        "mentioned_times": [
            1504095662.0,
            1504048552.0,
            1504058949.0,
            1504052218.0,
            1504080012.0,
            1504083002.0,
            1504091337.0,
            1504045061.0,
            1504044583.0
        ],
        "text": [
            "DNT, ZRX and BAT are my big 3",
            "I actually like your portfolio quite a bit, but i would reconsider NEO and BCH amd instead go for ETH and BAT.",
            "Overall I like it!\n\nPersonally, I'd dump BCH and 2-3 tokens. Reinvest in your current portfolio.\n\nI'd get more ETH. Even if you mining...\n\nSNGLS will pick up soon with some announcements. Lots of upside there.\n\nConsider picking up one or two of these: BAT, ARK, TAAS or PART.\n\nCheers.  ",
            "Not personally a fan of IOTA or BCH, or any gaming/gambling coins, but you should look into ARK, QTUM, PAY, BAT, CVC",
            "Nav - super active dev and community. The more I learn the more I really like this coin.  \n61,698,298 NAV\n\nLomo - 2.0 and new exchange are announced for Mid September making a platform for US/Japan/Korea\n\n214,037,194 LMC\n\nSngls - Great team very innovative project. New nodes being released in the next month has a pretty high ceiling.\n\n600,000,000 SNGLS\n\nBAT - Coin that will probably moon just because the amount of depth on the team. Just a matter of when not if. \n\n1,000,000,000 BAT \n\n\n\n\nhttps://twitter.com/LoMoCoinTeam/status/902769626127499264",
            "sia bat. \n\nmessage me when rich",
            "BAT, DNT, ZRX",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC",
            "I'd definitely buy more Eth, and drop AdEx to add BAT. Better developers, more proof of work, better future, same purpose. Don't listen to the VTC naysayers, it has potential. "
        ],
        "upvotes": [
            15,
            2,
            1,
            0,
            9,
            6,
            3,
            3,
            1
        ]
    },
    "BAY": {
        "full_name": "BitBay",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BCC": {
        "full_name": "Bitcoin Cash",
        "mentioned_ids": [
            "dmae5qm",
            "dmaxonx",
            "dm9x2cm",
            "dma09u1",
            "dmb65l1",
            "dma6obf",
            "dmadnos",
            "dmac7e5"
        ],
        "mentioned_times": [
            1504054542.0,
            1504075544.0,
            1504031175.0,
            1504037984.0,
            1504086234.0,
            1504046505.0,
            1504054029.0,
            1504052506.0
        ],
        "text": [
            "sorry there's something wrong with the chart, that bitcoin cash should be litecoin ;)",
            "Bitcoin cash and and ethereum prices should be switched. ",
            "I want to believe that BTC will be able to hold itself against the newcomers, but I believe the hard forks of BTC/BCC and the huge infighting over Segwit are going to further divide the Bitcoin community. Over time, the transaction fees and non-innovation will turn public opinion against BTC as they see it as dated and fractured. It reminds me of Kodak.",
            "Every 2weeks the algorithms of BTC and bcc  lower or increase its difficulty to attract miners. \nWith bcc a lot of miners left btc to make easy money . As for now the difficulty is increasing in bcc, that's why miners are coming back to btc, they will have lower difficulty, mine more, decrease the price of transaction of BTC.\nAnd when it will increase they will turn once again to bcc, until the BTC price is much more higher than bcc and it will only be profitable to mine BTC over bcc ",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "What's your reason for investing in BCC?",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "RemindMe! 1 month. I bet you suffer 50% losses at least in the next 2 weeks with that portfolio. \n\nIMO, Alt boom is over. Pull back to BTC and ETH, (Maybe BCC not sure). Alts going to get fked!"
        ],
        "upvotes": [
            6,
            1,
            13,
            2,
            23,
            2,
            0,
            -2
        ]
    },
    "BCY": {
        "full_name": "BitCrystals",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BITB": {
        "full_name": "BitBean",
        "mentioned_ids": [
            "dmaeszb",
            "dmbh4pl"
        ],
        "mentioned_times": [
            1504055195.0,
            1504103724.0
        ],
        "text": [
            "Nah the true nightmare would be BitBean rank 1 and Dogecoin rank 2.",
            "Im probably going to get laughed at here but my sleeper coin is Bitbean, only because it is a working product, having a rebrand real soon which may help to get the price up, and its marketcap is only $5mn so it has potential for profit without risking all that much capital, or so im thinking."
        ],
        "upvotes": [
            1,
            0
        ]
    },
    "BLITZ": {
        "full_name": "Blitzcash",
        "mentioned_ids": [
            "dmad0q1",
            "6wxckt"
        ],
        "mentioned_times": [
            1504053364.0,
            1504103435.0
        ],
        "text": [
            "Look into Stratis. Despite a significant price decrease from their ATH, Stratis hasn't experienced any technical problems. Their program is only looking better than it did then. They've partnered with Earth Twine, a company that will be adding compliance to regulation of seafood onto the blockchain, such as verification of the origin and date the seafood was caught. I expect this to be the first Stratis sidechains, in addition to Blitzcash which was announced some time ago. Stratis is in a race to implement sidechains with Ark, and Ardor/NXT. \n\nStratis also has their Breeze wallet, which has TumbleBit integration. An alpha of Breeze should be released within the next two months; but they've verified and stress-tested Tumblebit within the wallet. Plus, they have one of the most professional crypto teams that I've come across. \n\nThe June price spike for Stratis wasn't a pump and dump, but was an early indication of their future success.\n\nDisclosure: I am/we are long STRAT.",
            "Hi is this from a credible source? - BlitzCash Set To Soar After Leak Of Massive Snapchat Investment"
        ],
        "upvotes": [
            3,
            4
        ]
    },
    "BLK": {
        "full_name": "BlackCoin",
        "mentioned_ids": [
            "dmb4jbq"
        ],
        "mentioned_times": [
            1504084200.0
        ],
        "text": [
            "Blackcoin."
        ],
        "upvotes": [
            1
        ]
    },
    "BLOCK": {
        "full_name": "BlockNet",
        "mentioned_ids": [
            "dmanzu9",
            "dm9zcw9",
            "dmb0k9s",
            "dmb008w",
            "dmbg14v",
            "dmbgjpy",
            "dmbhiig",
            "6wspxb",
            "dmafvfm",
            "dmanb7c"
        ],
        "mentioned_times": [
            1504064765.0,
            1504036304.0,
            1504079188.0,
            1504078475.0,
            1504101321.0,
            1504102424.0,
            1504104622.0,
            1504056070.0,
            1504056305.0,
            1504064047.0
        ],
        "text": [
            "I look for value in crypto when there is real need for it. There is a market for decentralized file hosting. It may be an illicit market, but hey that's how BTC got started. Eventually someone is going to make a block chain file storage platform that goes mainstream. \n\nMy question would be about the value in investing in Sia. Is it worth it? Does an endless supply of coin make it a bad investment? There doesn't seem to be a true competitor. I want to get involved. Assuage my doubts someone. ",
            "What $8 fees? https://bitcoinfees.21.co/ I see $4 to get into next block for average tx. Larger tx like sending to 1000 accounts takes more fee, but similar per tx.\n\nThen you say confirmations take forever too. And $8 fees. That's VERY misleading as they are inversely correlated. If you analyze only tx that included a fee, median time is ~12 minutes https://blockchain.info/charts/median-confirmation-time which is most places require.\n\nWhat you are reading is typical rhetoric used by other coins to promote themselves, often because they are unused and do not mention downsides of their design\n\nYou're saying load without understanding that's an attack vector. \n\nAnyone can create a backlog, trillions per second. Should the network process all those and keep them on chain forever, raising bandwidth requirements (and storage) that high for everyone, and thus compromising security? \n\nNo. Limit has to be placed somewhere on spectrum of security vs speed. BTC chooses security, and use layer 2+ for speed. But they did introduce 1mb to 2-4mb max block weight increase with segwit. Most blocks now are over 1mb. So already they traded off some security for speed increase but also enabled layer 2 solutions required.\n\nSo when someone says they can go faster by changing a few parameters, ask them what they GIVE UP for it: [1](https://twitter.com/SDWouters/status/862426991370358784),[2](https://twitter.com/TuurDemeester/status/881851053913899009),[3](https://twitter.com/TuurDemeester/status/881852318517473280)\n\nIt is a real solution: https://hackernoon.com/simulating-a-decentralized-lightning-network-with-10-million-users-9a8b5930fa7a\n\nIt's not a simple answer, most people start off as completely for speed until they realize the trade offs. \n\nIf I want super fast but very limited in # validators (elected 25-100 witnesses), I'd use bts or steem (free tx) to go faster than VISA for small tx - both process 2x+ more tx than btc and eth combined. When I want security for large amounts, I use BTC. (Hard not to mention them since they are clear leaders in tx today and speed)\n\nIn the end it's possible you can spend entire life only on layer 2 LN network, have option to settle on layer 1, but most will never need it and it will be mostly used by large players like vendors and amazons of the world settling between each other taking on the costs.\n\nAdditionally, pegged side chains are good scaling opportunity as well without losing value - http://i.imgur.com/ENpXtTt.png - this is happening very soon too - https://stats.rsk.co/ - segwit allowed it to use drivechains instead of federated bridges which is huge win. RSK and also MAST for smart contracts are showing BTC ability to adapt good ideas from others. They do this without compromising the security of the foundation, building on the most secure and well understood platform possible.\n\nThere's 4+ lightning implementations including for mobile phones.\n\nNothing wrong with using altcoins for small amounts if you can't afford the fees or speed, until layer 2+ and sidechains are ready since you don't need high security for it. That is a speed solution. But lets not pretend they are equivalent, especially using a chain that shall not be named that can't manage to remain online for few months at a time without security breakdown of the entire chain. \n\ntldr: there's value in security, there's more than speed and fees that's important",
            "Bitcoin will collapse under the weight of its own block chain. When mining no longer becomes profitable there will be little if any miners to continue transactions. Transaction costs will cost more than the currency being traded and like that it is dead. ",
            "Because the network effect is more important than \"technological improvements\" when it comes to a currency. None of the purported innovations in blockchain (shorter block times, smart contracts, PoS) have been meaningful compared to the creation of blockchain. In short, Bitcoin added value to the world, while altcoins have not.",
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything.",
            "$XRB. Raiblocks tech is genius but simple. Similar to IOTA's tangle in terms of solving scalability issues, XRB uses a \"block lattice\" where each account has their own blockchain that completes xfers with send/receive block pairs. No transaction fees. Zero. None. Also very near INSTANT transactions. Devs are working hard to finish mobile wallet & get it listed on BitTrex (which will happen sooner rather than later). Also the lead dev is likely the hardest working developer in crypto (check the GitHub punch card). Don't sleep on $XRB below 4k sats. 50x potential.",
            "Signatum is gonna blow up when its no longer minable (block 100k)\n\nUbiq is for sure going to ~10$ this year",
            "Blocknet to integrate with Ethfinex – TheBlocknet – Medium",
            "I can't believe Blocknet still has a market cap <$100mil. \n\nEdit: Nevermind lol. It was under $100mil when I checked this morning, now it's at like $112mil. Still outside of the top 50 though. \n\n",
            "I was all pumped about Blocknet until I checked the GitHub listed on their website. Nothing"
        ],
        "upvotes": [
            3,
            28,
            1,
            2,
            1,
            1,
            1,
            6,
            2,
            1
        ]
    },
    "BNT": {
        "full_name": "Bancor",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BRK": {
        "full_name": "Breakout",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BRX": {
        "full_name": "Breakout Stake",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BSD": {
        "full_name": "BitSend",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTA": {
        "full_name": "Bata",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTCD": {
        "full_name": "BitcoinDark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTS": {
        "full_name": "BitShares",
        "mentioned_ids": [
            "dm9zcw9"
        ],
        "mentioned_times": [
            1504036304.0
        ],
        "text": [
            "What $8 fees? https://bitcoinfees.21.co/ I see $4 to get into next block for average tx. Larger tx like sending to 1000 accounts takes more fee, but similar per tx.\n\nThen you say confirmations take forever too. And $8 fees. That's VERY misleading as they are inversely correlated. If you analyze only tx that included a fee, median time is ~12 minutes https://blockchain.info/charts/median-confirmation-time which is most places require.\n\nWhat you are reading is typical rhetoric used by other coins to promote themselves, often because they are unused and do not mention downsides of their design\n\nYou're saying load without understanding that's an attack vector. \n\nAnyone can create a backlog, trillions per second. Should the network process all those and keep them on chain forever, raising bandwidth requirements (and storage) that high for everyone, and thus compromising security? \n\nNo. Limit has to be placed somewhere on spectrum of security vs speed. BTC chooses security, and use layer 2+ for speed. But they did introduce 1mb to 2-4mb max block weight increase with segwit. Most blocks now are over 1mb. So already they traded off some security for speed increase but also enabled layer 2 solutions required.\n\nSo when someone says they can go faster by changing a few parameters, ask them what they GIVE UP for it: [1](https://twitter.com/SDWouters/status/862426991370358784),[2](https://twitter.com/TuurDemeester/status/881851053913899009),[3](https://twitter.com/TuurDemeester/status/881852318517473280)\n\nIt is a real solution: https://hackernoon.com/simulating-a-decentralized-lightning-network-with-10-million-users-9a8b5930fa7a\n\nIt's not a simple answer, most people start off as completely for speed until they realize the trade offs. \n\nIf I want super fast but very limited in # validators (elected 25-100 witnesses), I'd use bts or steem (free tx) to go faster than VISA for small tx - both process 2x+ more tx than btc and eth combined. When I want security for large amounts, I use BTC. (Hard not to mention them since they are clear leaders in tx today and speed)\n\nIn the end it's possible you can spend entire life only on layer 2 LN network, have option to settle on layer 1, but most will never need it and it will be mostly used by large players like vendors and amazons of the world settling between each other taking on the costs.\n\nAdditionally, pegged side chains are good scaling opportunity as well without losing value - http://i.imgur.com/ENpXtTt.png - this is happening very soon too - https://stats.rsk.co/ - segwit allowed it to use drivechains instead of federated bridges which is huge win. RSK and also MAST for smart contracts are showing BTC ability to adapt good ideas from others. They do this without compromising the security of the foundation, building on the most secure and well understood platform possible.\n\nThere's 4+ lightning implementations including for mobile phones.\n\nNothing wrong with using altcoins for small amounts if you can't afford the fees or speed, until layer 2+ and sidechains are ready since you don't need high security for it. That is a speed solution. But lets not pretend they are equivalent, especially using a chain that shall not be named that can't manage to remain online for few months at a time without security breakdown of the entire chain. \n\ntldr: there's value in security, there's more than speed and fees that's important"
        ],
        "upvotes": [
            28
        ]
    },
    "BURST": {
        "full_name": "BURSTCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BYC": {
        "full_name": "Bytecent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CANN": {
        "full_name": "CannabisCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CFI": {
        "full_name": "Cofound.it",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLAM": {
        "full_name": "CLAMs",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLOAK": {
        "full_name": "CloakCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLUB": {
        "full_name": "ClubCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "COVAL": {
        "full_name": "Circuits of Value",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CPC": {
        "full_name": "CapriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRB": {
        "full_name": "CreditBit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRW": {
        "full_name": "Crown",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CURE": {
        "full_name": "CureCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CVC": {
        "full_name": "Civic",
        "mentioned_ids": [
            "dmbh858",
            "dmabxhf",
            "dma5fc8",
            "dmamu75",
            "6wq19g"
        ],
        "mentioned_times": [
            1504103947.0,
            1504052218.0,
            1504045061.0,
            1504063551.0,
            1504026490.0
        ],
        "text": [
            "Cant believe no ones spoken of Ubiq. Its been blowing up this week and still has a long ways to go. The typical bot response (great team, great idea yadd yadda) but its true. Its a better ETC and I would place the value around ETC. Also, if I'm not mistaken Bittrex has a hand in Ubiq and their killing it with their exchange. My other two are ARK and CIVIC ",
            "Not personally a fan of IOTA or BCH, or any gaming/gambling coins, but you should look into ARK, QTUM, PAY, BAT, CVC",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC",
            "I would recommend getting paper wallets, also portfolio looks solid. \n\nI will recommend looking at CVC too.",
            "Beyond PII and Civic's CVC - dynamic identity data - the missing link"
        ],
        "upvotes": [
            1,
            0,
            3,
            2,
            5
        ]
    },
    "DAR": {
        "full_name": "Darcrus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DASH": {
        "full_name": "Dash",
        "mentioned_ids": [
            "dmaia6z",
            "dmbfqig",
            "dmb65l1",
            "dmb7ryu",
            "dmbanq9",
            "6wsogc",
            "dmafgmc",
            "dmah8h8",
            "dmb57za",
            "6wvrjq",
            "dmbfzsd"
        ],
        "mentioned_times": [
            1504058791.0,
            1504100705.0,
            1504086234.0,
            1504088279.0,
            1504092174.0,
            1504055693.0,
            1504055881.0,
            1504057704.0,
            1504085057.0,
            1504084212.0,
            1504101242.0
        ],
        "text": [
            "Yes Ripple doesnt fork cause it has a well manered central organization behind it, that is top-notch and works like a fortune 500 company.  \nMonero doesnt fork cause it has a hardfork every six months and they manage well.  \nDash doesnt fork cause they have a really good democratic way of making decisions.  \n\nAll the rest can go fork them self. ",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess. \n\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "Dash. My gut feeling. ",
            "Free Dash Conferences in Venezuela to Begin in September",
            "All us comfortable first-world traders just casually buy and sell coins for hobby and profit, while some people need them for survival. From speaking with activists in Ghana and Venezuela, my prediction is that Dash will catch on like wildfire in the third world. ",
            "It makes so much sense to trade their crap money for Dash that will hold value. ",
            "Selling poor desperate people a shitcoin so supernode owners can get richer is fucked up but DarkCoin/Xcoin/Dash never has had any shame. ",
            "Radio Host Raises $50k in Dash and Bitcoin to Help Hurricane Victims",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess.\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?"
        ],
        "upvotes": [
            3,
            1,
            23,
            16,
            3,
            8,
            4,
            4,
            0,
            9,
            1
        ]
    },
    "DCR": {
        "full_name": "Decred",
        "mentioned_ids": [
            "dmbfnnl"
        ],
        "mentioned_times": [
            1504100545.0
        ],
        "text": [
            "Decred (DCR). Open structure within the organization that will allow for a lot of innovation. Experienced team.\n\nAlso, not a sleeper, but XRP. Has the potential for speed that banks will adopt."
        ],
        "upvotes": [
            2
        ]
    },
    "DCT": {
        "full_name": "DECENT",
        "mentioned_ids": [
            "6wqjwy",
            "dma85du",
            "dma9z6j",
            "dmb9fub",
            "dmb16nj"
        ],
        "mentioned_times": [
            1504034266.0,
            1504048163.0,
            1504050142.0,
            1504090495.0,
            1504079989.0
        ],
        "text": [
            "NEO selling in a dip for those wanting to get in at decent price",
            "You should probably provide some reasoning why it's a \"discount\" or \"decent\" price. \n\nIt would appear to me, the increase in NEO that it got from ICO buzz, just lost some of that steam due to regulation. Maybe a discount or maybe it's priced more accurately.  ",
            "Looks like the r/cryptocurrency shills bag of dreams. Decent though",
            "Golem has exploded since the start of the year and I think the market might be waiting for the upcoming Brass release and it should receive a decent bump.\n\nVTC is a bit a of a sleeper agent imo. The developers and reasonably active community are very focused on the tech and while their marketing game has been lifted of late, this isn't where resources are primarily allocated. This is great for the long term prospects of the currency, especially as it's key focus (decentralised mining) is likely to become a hot topic in crypto in the future, as bigger coins struggle due to being beheld to interests of mining pools. But obviously not so great for short term gains. Atomic swapping later this year could also be a boon for the coin, as VTC is likely to be (one of the) first to gain the capability, in collaboration with LTC.",
            "Definitely. Cryptocurrency is currently my most profitable one (by far), but I have more eggs in the basket. Have a solid retirement plan, a decent holding in Vanguard S&P 500 ETF."
        ],
        "upvotes": [
            53,
            5,
            8,
            2,
            3
        ]
    },
    "DGB": {
        "full_name": "Digibyte",
        "mentioned_ids": [
            "dmbg071",
            "dmb3thk"
        ],
        "mentioned_times": [
            1504101265.0,
            1504083306.0
        ],
        "text": [
            "Digibyte DGB\n\nGot in at 250 sats. Going up now. Happy camper.",
            "2 coins I was interested in at the beginning but it seems they are dead ( I wish I am wrong)\n*Digibyte\n*Siacoin"
        ],
        "upvotes": [
            0,
            2
        ]
    },
    "DGD": {
        "full_name": "DigixDAO",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DMD": {
        "full_name": "Diamond",
        "mentioned_ids": [
            "dmbddz8"
        ],
        "mentioned_times": [
            1504096358.0
        ],
        "text": [
            "DMD"
        ],
        "upvotes": [
            1
        ]
    },
    "DOGE": {
        "full_name": "Dogecoin",
        "mentioned_ids": [
            "dmac05o",
            "dmakyjn",
            "dmaf1ha",
            "dmafc4f",
            "dmaehrv",
            "dmaeszb",
            "dmb9ukr",
            "dma6wht",
            "6wrxrl",
            "dmao63j",
            "dmadtz4",
            "dmaexg4",
            "dmaxhce",
            "dmaduf7",
            "dmaf4qo",
            "dmb1fjw"
        ],
        "mentioned_times": [
            1504052294.0,
            1504061569.0,
            1504055439.0,
            1504055748.0,
            1504054880.0,
            1504055195.0,
            1504091058.0,
            1504046762.0,
            1504049137.0,
            1504064945.0,
            1504054207.0,
            1504055322.0,
            1504075300.0,
            1504054220.0,
            1504055533.0,
            1504080298.0
        ],
        "text": [
            "Dogecoin WOW 3.0 😂",
            "This is absolute bullshit. Everyone knows the market will be 100% Doge by 2025.",
            "Where can I load up on that Dogecoin WOW 3.0?",
            "I am looking forward to my Dogecoin Wow 3.0",
            "Should be \"Dogecoin Much Wow\".",
            "Nah the true nightmare would be BitBean rank 1 and Dogecoin rank 2.",
            "Doge... I've never wanted to slap someone though the internet so bad. u/Fragsworth slap your self right in the face.",
            "I almost think some folks are too personally attached to a virtual asset to discuss and improve on its shortcomings which will lead to its eventual downfall. That, and the fact that most people outside the community don't know how cryptocurrencies (technically not even correct anymore as they have evolved into much more than just currency) work and only associate it with Bitcoin because it's been around for the longest. As cryptos gain popularity, Bitcoin will continue to grow until upon reaching a critical mass it will come crashing down and be replaced by a new standard. Imagine how unlikely it would be for a first of its kind technology to prevail after thousands of attemps to create something that is better for a certain applications (e.g. Monero for anonymous transactions, Doge for micropayments) or just strictly better as a whole (literally anything else). I'm just riding the wave until it's calmed; it's going to take a while.",
            "Us simple doge folk are enjoying a 6% increase",
            "I first got in to crypto with Doge. Had just shy of 4 million in a Cryptsy account when it got shut down. Very theft. Much sad.",
            "Why invest in doge? Just for fun? ",
            "I mined ~22000 doge back in '14 but then I lost interest because the coin seemed to go nowhere. I stored my wallet with my backup and put my password somewhere. Now although I found my wallet I have no clue where my fucking password went. :''''(",
            " Dogecoin is a great way to step back from all the seriousness and embrace absurdity. ",
            "My first crypto love, looks like the [chinese are getting interested.](https://coinmarketcap.com/currencies/dogecoin/#markets) ",
            "I sold all my doge currently because exodus will stop supporting it :(",
            "I have no doge, I feel like I am missing out on an important part of crypto history. "
        ],
        "upvotes": [
            139,
            25,
            21,
            12,
            3,
            1,
            0,
            3,
            50,
            15,
            11,
            7,
            6,
            3,
            3,
            2
        ]
    },
    "DOPE": {
        "full_name": "DopeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DRACO": {
        "full_name": "DT Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DTB": {
        "full_name": "Databits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DYN": {
        "full_name": "Dynamic",
        "mentioned_ids": [
            "dmasefp",
            "6wq19g"
        ],
        "mentioned_times": [
            1504069437.0,
            1504026490.0
        ],
        "text": [
            "Yeah I get that too, it's annoying as hell especially having to type username, password and auth code twice and I'm pretty sure I don't have a dynamic IP.",
            "Beyond PII and Civic's CVC - dynamic identity data - the missing link"
        ],
        "upvotes": [
            7,
            5
        ]
    },
    "EBST": {
        "full_name": "eBoost",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EDG": {
        "full_name": "Edgeless",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EFL": {
        "full_name": "ElectronicGulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EGC": {
        "full_name": "EverGreenCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC": {
        "full_name": "EmerCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC2": {
        "full_name": "Einsteinium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ENRG": {
        "full_name": "EnergyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ERC": {
        "full_name": "EuropeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ETC": {
        "full_name": "Ethereum Classic",
        "mentioned_ids": [
            "dmad6co",
            "dmah4s5",
            "dmbh858",
            "dmb65l1",
            "dmb7ryu",
            "dmb4efj"
        ],
        "mentioned_times": [
            1504053529.0,
            1504057597.0,
            1504103947.0,
            1504086234.0,
            1504088279.0,
            1504084031.0
        ],
        "text": [
            "Ethereum classic classic 😂😂😂",
            "I want Ethereum Classic Classic. lol",
            "Cant believe no ones spoken of Ubiq. Its been blowing up this week and still has a long ways to go. The typical bot response (great team, great idea yadd yadda) but its true. Its a better ETC and I would place the value around ETC. Also, if I'm not mistaken Bittrex has a hand in Ubiq and their killing it with their exchange. My other two are ARK and CIVIC ",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "-ETC. IMO, there are better alternatives to Ethereum based solely on tech/dev team (I.e., not highly adopted by any means). ETC didn't gain the mass adoption in time for it to continue to compete.\n\n-95% of Dapps in general (your guess is as good as mine on that one). Blockchain is revolutionary, no doubt about it, but Walmart and McDonalds didn't start with a $10,000,000 valuation...\n\n-XRP. It's a great idea, but I think big banks will be the first to find a way to centralize a blockchain so that they do not have to work with any outside entities.\n\n-XMR. Great idea for crypto privacy, but given recent gov attention, restrictions will be put in place to squash the speculation on it far before it reaches BTC levels.\n\nThat's my two cents. Could be completely wrong, but I'll let you know that I have avoided putting any money in these because the market reacts pretty damn fast to bad news."
        ],
        "upvotes": [
            33,
            1,
            1,
            23,
            16,
            2
        ]
    },
    "ETH": {
        "full_name": "Ethereum",
        "mentioned_ids": [
            "dmad6co",
            "dmajh4s",
            "dmakt44",
            "dmbgpnn",
            "dmah4s5",
            "dmault9",
            "dmaxonx",
            "dmbecti",
            "dmat47z",
            "dm9zcw9",
            "dmaedml",
            "dmatzer",
            "dmb21mz",
            "dmata9o",
            "dmatyyj",
            "6wuc3m",
            "dmb0yo9",
            "dmbboeh",
            "dmbf9q1",
            "dmbg14v",
            "dm9zi26",
            "dma4d2x",
            "dmaf029",
            "dmaggyq",
            "dmb65l1",
            "dmb4efj",
            "dmb5q3r",
            "dma7q8x",
            "dma8i02",
            "dmaifln",
            "dmao5ub",
            "dmac7e5",
            "6wq9hj",
            "dmabmrj",
            "dmah9md",
            "6wrgb0",
            "6wvdiy",
            "dmb4cwz",
            "dmb8f5m",
            "dmamxte",
            "dmag6wt",
            "dma314p",
            "dma5107",
            "dmb7ud9",
            "6wrmwh",
            "dmb5pqg",
            "dmafdoy",
            "6ws3z7"
        ],
        "mentioned_times": [
            1504053529.0,
            1504060023.0,
            1504061413.0,
            1504102786.0,
            1504057597.0,
            1504071912.0,
            1504075544.0,
            1504098038.0,
            1504070234.0,
            1504036304.0,
            1504054762.0,
            1504071206.0,
            1504081072.0,
            1504070422.0,
            1504071192.0,
            1504070172.0,
            1504079705.0,
            1504093641.0,
            1504099783.0,
            1504101321.0,
            1504036576.0,
            1504043760.0,
            1504055398.0,
            1504056917.0,
            1504086234.0,
            1504084031.0,
            1504085693.0,
            1504047688.0,
            1504048552.0,
            1504058949.0,
            1504064938.0,
            1504052506.0,
            1504030028.0,
            1504051906.0,
            1504057736.0,
            1504044565.0,
            1504080223.0,
            1504083979.0,
            1504089118.0,
            1504063656.0,
            1504056631.0,
            1504042088.0,
            1504044583.0,
            1504088363.0,
            1504046394.0,
            1504085681.0,
            1504055794.0,
            1504050713.0
        ],
        "text": [
            "Ethereum classic classic 😂😂😂",
            "Sideways ETH symbol lmao",
            "You forgot Cherry Ethereum",
            "This cannot happen, Ethereum only $1619? You sure the scenario is not for 2018?",
            "I want Ethereum Classic Classic. lol",
            "You forget Diet Ethereum and coming soon, Cherry Ethereum.",
            "Bitcoin cash and and ethereum prices should be switched. ",
            "I'm really knew to crypto and I haven't even mined a single full ETH yet but I didn't clue into the title right away...when I saw the value of ETH I freaked out a little. Ok, a lot. \n\nThen I realized...",
            "There's almost no chance ethereum survives. every aspect of it is the worst choice you can make at every level, not a single good design choice. it has 0 redeeming features and 0 intelligent developers. can't name a single good project on it including the platform.",
            "What $8 fees? https://bitcoinfees.21.co/ I see $4 to get into next block for average tx. Larger tx like sending to 1000 accounts takes more fee, but similar per tx.\n\nThen you say confirmations take forever too. And $8 fees. That's VERY misleading as they are inversely correlated. If you analyze only tx that included a fee, median time is ~12 minutes https://blockchain.info/charts/median-confirmation-time which is most places require.\n\nWhat you are reading is typical rhetoric used by other coins to promote themselves, often because they are unused and do not mention downsides of their design\n\nYou're saying load without understanding that's an attack vector. \n\nAnyone can create a backlog, trillions per second. Should the network process all those and keep them on chain forever, raising bandwidth requirements (and storage) that high for everyone, and thus compromising security? \n\nNo. Limit has to be placed somewhere on spectrum of security vs speed. BTC chooses security, and use layer 2+ for speed. But they did introduce 1mb to 2-4mb max block weight increase with segwit. Most blocks now are over 1mb. So already they traded off some security for speed increase but also enabled layer 2 solutions required.\n\nSo when someone says they can go faster by changing a few parameters, ask them what they GIVE UP for it: [1](https://twitter.com/SDWouters/status/862426991370358784),[2](https://twitter.com/TuurDemeester/status/881851053913899009),[3](https://twitter.com/TuurDemeester/status/881852318517473280)\n\nIt is a real solution: https://hackernoon.com/simulating-a-decentralized-lightning-network-with-10-million-users-9a8b5930fa7a\n\nIt's not a simple answer, most people start off as completely for speed until they realize the trade offs. \n\nIf I want super fast but very limited in # validators (elected 25-100 witnesses), I'd use bts or steem (free tx) to go faster than VISA for small tx - both process 2x+ more tx than btc and eth combined. When I want security for large amounts, I use BTC. (Hard not to mention them since they are clear leaders in tx today and speed)\n\nIn the end it's possible you can spend entire life only on layer 2 LN network, have option to settle on layer 1, but most will never need it and it will be mostly used by large players like vendors and amazons of the world settling between each other taking on the costs.\n\nAdditionally, pegged side chains are good scaling opportunity as well without losing value - http://i.imgur.com/ENpXtTt.png - this is happening very soon too - https://stats.rsk.co/ - segwit allowed it to use drivechains instead of federated bridges which is huge win. RSK and also MAST for smart contracts are showing BTC ability to adapt good ideas from others. They do this without compromising the security of the foundation, building on the most secure and well understood platform possible.\n\nThere's 4+ lightning implementations including for mobile phones.\n\nNothing wrong with using altcoins for small amounts if you can't afford the fees or speed, until layer 2+ and sidechains are ready since you don't need high security for it. That is a speed solution. But lets not pretend they are equivalent, especially using a chain that shall not be named that can't manage to remain online for few months at a time without security breakdown of the entire chain. \n\ntldr: there's value in security, there's more than speed and fees that's important",
            "move all your coin to ETH and LTC. there problem solved lol",
            "NEO is crap in my opinion, only argument people claim in its favor is that it is a Chinese ETH. The whole point of crypto is borderless finance, global currency, etc, why the hell is a centralized chinese coin a good thing? Also where is the development on NEO, who is working to make the platform better, what advantages does it have over ETH, what uses does it have? ICOs? Bah, ETH is already ICO king platform, I laugh at people claiming that NEO will overtake ETH as the leading smart contract platform when they have no development, no testing, no product while ETH probably has one of the smartest group of people in the planet working to make the platform better and suitable for mass adoption. Only thing NEO has done is change its name from Ant to NEO, big fucking deal, but hey, at least its the Chinese Ethereum copy.\n\nDon't fall for pumping idiots",
            "You need to have BTC in order to buy almost every other type of coin, especially the ones with lower market caps.  ETH and LTC are moderately well adapted, but BTC is the king.  I've thought about selling my BTC frequently in the past month, but I can't bring myself to do it, knowing that despite any inherent technical weaknesses, it's still a gateway drug and therefore will be in strong demand for some time.\n\nI'll reassess this opinion as I see more and more exchanges offering trades directly out of LTC or ETH into coins with small market caps (and to clarify, I know that there are some now - but the main couple of exchanges that I use are quite limited).\n",
            "What's fragmented? a few individuals fragment in any community, there's almost no support for any of those fragments. Anyone can snapshot a crypto and make their own coin, it's not a \"fragment\". Others exagerate it for no reason. Real fragment happened when eth devs stole money from a user without majority support and without even asking to vote and fragmented away from real chain while retaining full control due to centralization.\n\nthere is no project that has more developers or bigger community than bitcoin, or where more work was done for scaling. THe number of layer 2 implementations is enormous there, meanwhile all others are relatively stagnating and mostly just printing tokens.\n\nSo I don't have to repeat myself https://www.reddit.com/r/CryptoCurrency/comments/6wqao8/why_are_you_so_chill_about_the_current_bitcoin/dm9zcw9/",
            "You are overexposed to bitcoin \"FUD\" and shitcoin hype, and underexposed to economic reality.\n\n---\n\nEveryone knows there can be only one money without state intervention.  Over half of the world's currency is pegged to the dollar.  Most of the rest is the Euro, which is just a client state of the USA.  Essentially, we have one world currency but most countries maintain a *nominally* independent currency simply so that they can exit (relatively) cleanly if the US becomes too burdensome.\n\nThis is because of the network effect of money.  Money's value does not come from gold, or the asset sheet of the federal reserve, or any other bullshit.  It is valuable only because lots of other people believe it is valuable.\n\nBitcoin has a chance at becoming money.  Shitcoins do not.\n\n---\n\n99.99% of the opinions you are reading are from technological illiterates.  Anonymous money is so awesome!  But, did you know that it is impossible to verify the total amount of money in circulation in some of the more anonymous coins?  How do you determine the value of dollar in a world where you are unsure if there are 100 of them or 100,000,000,000,0000,000,0000,0000,000 of them?  Right, you can't.  But there are shitcoins in this situation with market caps over $1B.  It's a joke.\n\n---\n\n\"Proof of Stake can solve scaling and save the environment!!!  LOL can't we all be friends?\"\n\nWe have a shitcoin called ethereum with a $30B valuation entirely built on liars and fraudsters.  When is the last time you believed someone who told you that you can get something for free?  Hopefully, a long, long time ago.\n\nAt the same time, all the ethereum idiots believe that today.  The cost of security in crypto is burning energy (mining).  PoS advocates are attempting to convince people you can take away the cost (burning energy) and keep the benefit (security).  It's a transparent fraud to any barely intelligent person, but there are an awful lot of victims of this latest iteration of crypto scamming.\n\n---\n\nWe could go on and on, but the TL;DR is this: all the smart people in the room know shitcoins are shitcoins.  Trading shitcoins is nothing more than a way to accumulate more bitcoins.  Almost everyone does it, but only the retarded are true believers.",
            "New Ethereum Based Cloud Token Aims To Create Decentralized Cloud Services For The Masses - Tokens Can Be Used Starting Today For %50 Off Cloud Services",
            "I wouldn't worry, unlike decentralized blockchains, eth is centralized and claiming otherwise is fraud. tbh any ICO advertising as decentralized is fraud. Nothing much decentralized about a company raising funds for themselves.",
            "DNT District0x, and I'll tell you why: once the masses adopt and wrap their heads around the idea of ethereum and other app based platforms, they'll need a way to implement into real world applications. E-commerce, social platforms, blogs that pay directly for views, etc. DNT is paving a way for everyone (without programming knowledge) to take part in the decentralization world. In my opinion this is huge for the long run. \n\n",
            "A small, high risk/high reward coin: Voise (VSM).\n\n\n\nSmall marked cap, really ambitious, and promising team. Still very young, so I think this is the time to get in early.\n\n\n\nAlso, I've been part of the IOTA community since this spring, and believe it to be the coin with the biggest potential of all cryptos (arguably alongside ETH)",
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything.",
            "I turn 31 in a month, been a redditor for over 6 years in total, been lurkering around here for 6 months and bought my first crypto on July 20th. Bought eth, btc and ltc.",
            "We are 100% in a bubble. My thought is that ETH will crash at some point, bringing down all the shitcoins built on it, and clearing the space for real projects. ",
            "IMHO\n\n\nfor ICO : yes because most of them are still on idea stage. just like startup hype on 2010-2014 . most of them died down now\n\nfor older coins (BTC, ETH, LTC, and such) they are already battle proven and now currently in adoption phase ",
            "I think that there are a lot of parallels for what a crash would look like, but there are some important differences. During the .com crash there was a broad sector decline in value. Every tech company took a walloping and those that weren't profitable or which had fundamentally unsound business models were wiped out completely. Similarly, a crypto crash will likely see sharp declines across the board for all coins. The super dubious, craptastic recent ICOs will almost certainly disappear forever. Coins and tokens with no differentiating technical or business features will go for sure. However, I don't think the carnage will stop there. Most of the crypto products that are *very* similar to existing products will see their values plunge to next-to-worthless levels and they will likely never recover. This is where the similarities end.   \nThere is no direct comparison between \"business model\" and a crypto currency. However, there is a similar concept and that is market adoption and the technical infrastructure that goes with a coin. In this context, the survivors are already starting to emerge. They are bitcoin, ethereum, ripple and perhaps 3 or 4 others (not sure about litecoin, I personally feel it's too similar to bitcoin and doesn't have the ecosystem, but it's on the border).",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "-ETC. IMO, there are better alternatives to Ethereum based solely on tech/dev team (I.e., not highly adopted by any means). ETC didn't gain the mass adoption in time for it to continue to compete.\n\n-95% of Dapps in general (your guess is as good as mine on that one). Blockchain is revolutionary, no doubt about it, but Walmart and McDonalds didn't start with a $10,000,000 valuation...\n\n-XRP. It's a great idea, but I think big banks will be the first to find a way to centralize a blockchain so that they do not have to work with any outside entities.\n\n-XMR. Great idea for crypto privacy, but given recent gov attention, restrictions will be put in place to squash the speculation on it far before it reaches BTC levels.\n\nThat's my two cents. Could be completely wrong, but I'll let you know that I have avoided putting any money in these because the market reacts pretty damn fast to bad news.",
            "BTC and ETH both scam coins and will never catch on!!",
            "You're spread thin on a bunch of high hopes it seems like. I'd have your top be a more stable coin, I know you are mining ETH, but ETH lite or btc would probably be your best bet as #1 to keep you up if/when some of your alts fail. \n\n",
            "I actually like your portfolio quite a bit, but i would reconsider NEO and BCH amd instead go for ETH and BAT.",
            "Overall I like it!\n\nPersonally, I'd dump BCH and 2-3 tokens. Reinvest in your current portfolio.\n\nI'd get more ETH. Even if you mining...\n\nSNGLS will pick up soon with some announcements. Lots of upside there.\n\nConsider picking up one or two of these: BAT, ARK, TAAS or PART.\n\nCheers.  ",
            "Honestly, it seems overly diversified and looking to hard for moon shoots, good to have a few of them in there but I'd rather make the majority of my portfolio up of safer coins like BTC and eth.",
            "RemindMe! 1 month. I bet you suffer 50% losses at least in the next 2 weeks with that portfolio. \n\nIMO, Alt boom is over. Pull back to BTC and ETH, (Maybe BCC not sure). Alts going to get fked!",
            "Blockchain payments startup TenX joins the Enterprise Ethereum Alliance",
            "With no USD avail in the exchange, does one spend BTC/ETH for a reputable altcoin on a sizable dip?\n\nSo far, I have not.",
            "What was ETH's all time high?",
            "What Is Ethereum’s Viper Coding Language?",
            "Eli5: Why do blockchain technologies that seem to serve more as a platform such as Factom, Ethereum, Stratis(to name a few) even have a corresponding coin?",
            "I think it's part of the security. If I want to ddos/spam ETH I would have to buy ETH to do it, which would offset the damage.   ",
            "ETH is just as much a currency as bitcoin",
            "https://poloniex.com/exchange#eth_zrx\n\nhttps://liqui.io/#/exchange/ZRX_ETH\n\nhttps://etherdelta.github.io/#ZRX-ETH\n\nhttps://www.coinswitch.co/exchange/btc/zrx/0.1\n\nhttps://shapeshift.io/\n\nare pretty much all your options",
            "What ico requires you to contribute a minimum of 5 eth? Definitely a scam.",
            "Looks good. probably put your ripple into ETH.   \nThe rest is solid. Adex still speculative, pretty high risk.",
            "I'd definitely buy more Eth, and drop AdEx to add BAT. Better developers, more proof of work, better future, same purpose. Don't listen to the VTC naysayers, it has potential. ",
            "It depends on what your definition of \"near future\" is. In the next 5/10 years, I believe that platforms will be built on top of cryptocurrencies and cryptocurrencies/blockchain will act as the backbone of many of these platforms which is what will give cryptocurrencies value. Of course, the people using these platforms will not need to know how blockchain/cryptocurrencies work in order to utilize these platforms, in the same way that a person who uses Facebook doesn't need to understand the underlying technology (e.g. HTML, Javascript, TCP/IP, etc.)\n\nAdoption will first occur by startups I believe, that are looking to be at the forefront of this technology. Startups will arise to solve many of the issues and inconveniences that cryptocurrency users face, such as having to go to multiple exchanges to get different cryptos, storing crypto (most people will not want to take the time to store their crypto on a hard wallet), etc. \n\nOnce these inconveniences and issues are removed, cryptocurrency/blockchain will be exponentially adopted and the experience will begin to be seamless for end-users. \n\nWith that being said, I believe Bitcoin will crash and fail. There are several altcoins that can do exactly what Bitcoin can do and have additional features as well. Bitcoin's transaction fees are absolutely ridiculous. Until that is resolved, which I'm not sure it will, then I think people will begin to realize that Bitcoin can't be used for what it was originally supposed to do which is being an actual currency. \n\nI truly believe Ethereum will eventually surpass Bitcoin in market value. Ethereum can do exactly what Bitcoin can do and MUCH more, and it's already second in market cap. ",
            "Ethereum.link – Linking Ethereum With The World",
            ">backed with real .999 physical silver \n\ncentralized gateway. nice. \n\nmarketing and old or bad centralized ideas - state of the art in eth",
            ">How is it possible that every ico that releases soars to the sky\n\nFactually incorrect, lots of ICO's immediately open below ICO price, especially compared to Eth. \n\nSome are also scams, obviously.",
            "ETH/USD Forecast: Ether Now Eyes $375"
        ],
        "upvotes": [
            33,
            2,
            2,
            2,
            1,
            1,
            1,
            1,
            -10,
            28,
            1,
            -1,
            3,
            1,
            -3,
            37,
            -5,
            35,
            2,
            1,
            2,
            4,
            1,
            1,
            23,
            2,
            -6,
            7,
            2,
            1,
            1,
            -2,
            20,
            2,
            1,
            10,
            10,
            1,
            1,
            3,
            2,
            1,
            1,
            3,
            5,
            1,
            8,
            3
        ]
    },
    "EXCL": {
        "full_name": "ExclusiveCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EXP": {
        "full_name": "Expanse",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FAIR": {
        "full_name": "FairCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FCT": {
        "full_name": "Factom",
        "mentioned_ids": [
            "dmag5k5",
            "dmbg89n",
            "dmbhisr",
            "dmbhk4s",
            "dmbhk8n",
            "dmadnos",
            "dmaoe4a",
            "dmasyve",
            "6wvdiy",
            "dmb2mne"
        ],
        "mentioned_times": [
            1504056592.0,
            1504101737.0,
            1504104640.0,
            1504104728.0,
            1504104735.0,
            1504054029.0,
            1504065176.0,
            1504070069.0,
            1504080223.0,
            1504081806.0
        ],
        "text": [
            "Im missing Factom ;)",
            "Tierion.\n\nSame as Factom but way undervalued, huge growth potential and interesting partnerships.\n\nAlso its only listed on 3 exchanges right now.",
            "Factom (FCT) and SunContact (SNC)",
            "FCT. I think it's value will be realised in almost direct correlation with the value of blockchain itself being realised by the world. Very, very strong fundamentals that the masses will understand much better only as they understand blockchain itself better.\n\nXRP. Can also see it becoming the industry standard for privacy (a huge concern) and also surviving any future crypto crashes/wipeouts. Sleeper still, despite it's recent rise.\n\nVTC. Strong community, devoted developers and loads of room to grow, especially with lightning network & atomic swapping in development.",
            "dnt, iota, omg, fct",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "Iota, factom, monero but essentially your guess is as good as mine.",
            "FCT",
            "Eli5: Why do blockchain technologies that seem to serve more as a platform such as Factom, Ethereum, Stratis(to name a few) even have a corresponding coin?",
            "As far as I understand, tokens are generally to prevent people from spamming and attacking the networks. The more money you have to spend to do it, the less likely it will happen. \n\nAnd some do serve a purpose of payment, like Factom is burned for EC, which companies use to enter data on the platform."
        ],
        "upvotes": [
            12,
            1,
            1,
            1,
            1,
            0,
            5,
            5,
            10,
            3
        ]
    },
    "FLDC": {
        "full_name": "FoldingCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FLO": {
        "full_name": "Florin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FTC": {
        "full_name": "Feathercoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FUN": {
        "full_name": "FunFair",
        "mentioned_ids": [
            "dmbewn1",
            "dmadnos"
        ],
        "mentioned_times": [
            1504099079.0,
            1504054029.0
        ],
        "text": [
            "IOTA & FUN",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are."
        ],
        "upvotes": [
            1,
            0
        ]
    },
    "GAM": {
        "full_name": "Gambit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GAME": {
        "full_name": "GameCredits",
        "mentioned_ids": [
            "dmaur5a",
            "dmbf9wl",
            "dmbc4w5",
            "dmbfqig",
            "dma8asi",
            "dmb9fub",
            "dmazmgd",
            "dmbfzsd"
        ],
        "mentioned_times": [
            1504072079.0,
            1504099792.0,
            1504094333.0,
            1504100705.0,
            1504048329.0,
            1504090495.0,
            1504077981.0,
            1504101242.0
        ],
        "text": [
            "Thanks for your analysis - with the ICO madness and increasing amount of shady players in the crypto game, I will say that Sia is a breath of fresh air. Here is a post I put up a month ago or so on reasons I am big on Sia for the long-term:\n\n[Things I Considered Before Investing Into Sia](https://www.reddit.com/r/siacoin/comments/6lsfkz/things_i_considered_before_investing_into_sia/)\n\nThe Sia devs are extremely transparent and make a serious effort to engage and communicate with the community (growing super quickly - http://redditmetrics.com/r/siacoin). \n\nI am getting my Raspberry Pi 8TB hosting set up this week to add more capacity to the total storage but to also learn the ins and outs of Sia. I've also purchased a couple of Obelisk miners and created [this profitability calculator](https://docs.google.com/spreadsheets/d/19heDnA_o4Q8KuII4o1mKah7Sxafj85RSB-x-teN1SqE/edit#gid=0) to play around with some of the numbers. IMO, Siacoin is a great investment for a 3-5 year window but it's definitely not a get-rich-quick coin and I don't think it will ever go more than $1 per Siacoin but with enough volume, could be a nice ROI. ",
            "People have mentioned this here already but Bitcoin is a necessary entry to the altcoin game. Every time someone new ones to buy into an ICO or some other shitcoin they must first buy Bitcoin. This means their investments have a multipled effect (they pump Bitcoin as well as shitcoin X with that one fiat purchase). In some instances, people are going through 3 or 4 trades to get their desired crypto. (EX: Fiat>Bitcoin>CounterParty>Pepecash>rare pepe).\n\nCoupled with the fact that it a) is still difficult for many people to withdraw Bitcoin for fiat b) is cheaper/safer to hold Bitcoin than convert to USD and pay taxes/face charges c) goes against core sentiments of Bitcoin to trade it back for fiat- it's really a no brainer why the market keeps soaring. The question becomes how long this will last and wants the train runs out of steam, how hard will everything fall?",
            "Game and mgo. \nThey have plenty of money for marketing and getting developers to integrate into their platforms which are actually really good and may not even need much sweeteners. ",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess. \n\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "It is a bubble. $164 billion dollar market cap, yet there is **not a single coin** that is actually used as a currency. Most don't even have a working product, and the ones that do (eg TenX) are nowhere near adoption by regular consumers. The current craze is fully driven by speculators, not by people actually **using** the cryptocoins. It's the [Dutch Tulip Mania](https://en.wikipedia.org/wiki/Tulip_mania) of the 17th century all over again.\n\nThat being said, blockchain technology will stay and some will be extremely successful, just like some internet companies remaned or became very successful after the bubble. And right now there is absolutely money to be made since the early majority adopters are currently flocking to the game. But just one look at [todays NEO-market](https://i.imgur.com/kSW8NcP.png) shows how nervous the market is. If it crashes (and it will, because the current market is not healthy), it's going *poof* really fast. And after that, it will rise again, based on more solid products and more common sense.",
            "Golem has exploded since the start of the year and I think the market might be waiting for the upcoming Brass release and it should receive a decent bump.\n\nVTC is a bit a of a sleeper agent imo. The developers and reasonably active community are very focused on the tech and while their marketing game has been lifted of late, this isn't where resources are primarily allocated. This is great for the long term prospects of the currency, especially as it's key focus (decentralised mining) is likely to become a hot topic in crypto in the future, as bigger coins struggle due to being beheld to interests of mining pools. But obviously not so great for short term gains. Atomic swapping later this year could also be a boon for the coin, as VTC is likely to be (one of the) first to gain the capability, in collaboration with LTC.",
            "It sounds more like the name of a board game than a cryptocurrency. Do you want to talk about that?",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess.\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?"
        ],
        "upvotes": [
            7,
            1,
            1,
            1,
            6,
            2,
            1,
            1
        ]
    },
    "GBG": {
        "full_name": "GBG",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GBYTE": {
        "full_name": "Byteball",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GCR": {
        "full_name": "GlobalCurrencyReserve",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GEO": {
        "full_name": "GeoCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GLD": {
        "full_name": "GoldCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GNO": {
        "full_name": "Gnosis",
        "mentioned_ids": [
            "dmaylde"
        ],
        "mentioned_times": [
            1504076664.0
        ],
        "text": [
            "If you are a whale who purchased millions of dollars worth of coin at the ICO, you can probably also afford to put up buy orders and MAKE the market. Then start selling your coin incrementally in small amounts, using bot (as opposed to frightening the buyers away by putting all your obtained coins into couple of sell walls). \n\nAlso, the ICOs that are bought instantly buy whales (GNO for example) are more likely to be heavily marketed in the first place, attracting speculative buying during its opening days at exchanges. But the amount of ICOs is *huge*, certainly not all of them meet these criteria. "
        ],
        "upvotes": [
            1
        ]
    },
    "GNT": {
        "full_name": "Golem",
        "mentioned_ids": [
            "dmbhrhb",
            "6wuzl1",
            "dmayy8h",
            "dmb9fub",
            "dmbhytn",
            "6wrcu5"
        ],
        "mentioned_times": [
            1504105210.0,
            1504076282.0,
            1504077123.0,
            1504090495.0,
            1504105704.0,
            1504043588.0
        ],
        "text": [
            "Fun\n\nOmg\n\nGnt\n\nSia\n\n\nAnything that does something tangible ",
            "Golem and vertcoin",
            "as far as I'm aware Golem doesn't have the tech yet. Vertcoin is solid and the devs have listened to their community and are going to focus more on marketing. ",
            "Golem has exploded since the start of the year and I think the market might be waiting for the upcoming Brass release and it should receive a decent bump.\n\nVTC is a bit a of a sleeper agent imo. The developers and reasonably active community are very focused on the tech and while their marketing game has been lifted of late, this isn't where resources are primarily allocated. This is great for the long term prospects of the currency, especially as it's key focus (decentralised mining) is likely to become a hot topic in crypto in the future, as bigger coins struggle due to being beheld to interests of mining pools. But obviously not so great for short term gains. Atomic swapping later this year could also be a boon for the coin, as VTC is likely to be (one of the) first to gain the capability, in collaboration with LTC.",
            "XEL > Golem.\n\nPlease research about it. ",
            "Developer Tech News #3 – The Golem Project"
        ],
        "upvotes": [
            1,
            19,
            8,
            2,
            1,
            4
        ]
    },
    "GOLOS": {
        "full_name": "Golos",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GRC": {
        "full_name": "GridCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GRS": {
        "full_name": "Groestlcoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GUP": {
        "full_name": "Guppy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HKG": {
        "full_name": "HackerGold",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HMQ": {
        "full_name": "Humaniq",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INCNT": {
        "full_name": "Incent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INFX": {
        "full_name": "InfluxCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOC": {
        "full_name": "I/OCoin",
        "mentioned_ids": [
            "dmbgek2"
        ],
        "mentioned_times": [
            1504102114.0
        ],
        "text": [
            "IOC"
        ],
        "upvotes": [
            2
        ]
    },
    "ION": {
        "full_name": "Ion",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOP": {
        "full_name": "Internet Of People",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "KMD": {
        "full_name": "Komodo",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "KORE": {
        "full_name": "KoreCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LBC": {
        "full_name": "LBRY Credits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LGD": {
        "full_name": "Legends",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LMC": {
        "full_name": "Lomocoin",
        "mentioned_ids": [
            "dmb17av"
        ],
        "mentioned_times": [
            1504080012.0
        ],
        "text": [
            "Nav - super active dev and community. The more I learn the more I really like this coin.  \n61,698,298 NAV\n\nLomo - 2.0 and new exchange are announced for Mid September making a platform for US/Japan/Korea\n\n214,037,194 LMC\n\nSngls - Great team very innovative project. New nodes being released in the next month has a pretty high ceiling.\n\n600,000,000 SNGLS\n\nBAT - Coin that will probably moon just because the amount of depth on the team. Just a matter of when not if. \n\n1,000,000,000 BAT \n\n\n\n\nhttps://twitter.com/LoMoCoinTeam/status/902769626127499264"
        ],
        "upvotes": [
            9
        ]
    },
    "LSK": {
        "full_name": "Lisk",
        "mentioned_ids": [
            "dmadeul",
            "dma5fc8",
            "dmaog9e",
            "dmagrj1"
        ],
        "mentioned_times": [
            1504053774.0,
            1504045061.0,
            1504065237.0,
            1504057220.0
        ],
        "text": [
            "LISK",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC",
            "Research the coins you believe in and those that you think will rise in value soon, I like Sia so I have some for the long term although I don't expect it to rise anytime soon, I also have some Lisk, Ark, Pivx & OMG I also want to keep these for the long term but those four are hopefully all going to have a good Q4 with various releases & a rebranding so I think there's short term profit as well if that's what you want to do. Good luck. ",
            "I'd like to echo the recommendations of everyone; NEO and ARK.\n\nNeo is correcting right now. I'd give it a couple days of breathing room before jumping in. The coin has a lot of promising things going for it, so I would highly recommend considering it.\n\nArk is also trending down, so I'd be cautious/patient before jumping in.\n\nI'd also recommend giving OMG and LSK a look. They're pretty promising."
        ],
        "upvotes": [
            9,
            3,
            4,
            2
        ]
    },
    "LTC": {
        "full_name": "Litecoin",
        "mentioned_ids": [
            "dmadddp",
            "dmal8cf",
            "dmae5qm",
            "dmaedml",
            "dmaj3j1",
            "dm9zfr0",
            "dmatm3i",
            "dmbhygk",
            "6wv9qa",
            "dmb0qdi",
            "dmau32w",
            "dmb21mz",
            "dmbgfqe",
            "dmbe0yc",
            "dmbgfkz",
            "dm9zi26",
            "dmaf029",
            "dmaggyq",
            "dmb65l1",
            "dmb7ryu",
            "dma57bb",
            "dmadnos",
            "dmb9fub",
            "dmaks5c"
        ],
        "mentioned_times": [
            1504053732.0,
            1504061854.0,
            1504054542.0,
            1504054762.0,
            1504059637.0,
            1504036453.0,
            1504070791.0,
            1504105680.0,
            1504079133.0,
            1504079404.0,
            1504071322.0,
            1504081072.0,
            1504102185.0,
            1504097453.0,
            1504102175.0,
            1504036576.0,
            1504055398.0,
            1504056917.0,
            1504086234.0,
            1504088279.0,
            1504044795.0,
            1504054029.0,
            1504090495.0,
            1504061386.0
        ],
        "text": [
            "I don't see litecoin lol ",
            "Hum... Where's LTC?",
            "sorry there's something wrong with the chart, that bitcoin cash should be litecoin ;)",
            "move all your coin to ETH and LTC. there problem solved lol",
            "Funny how what we call BTC today diverged more than BCH from \"the original\". BTC introduced a whole new TX format, and BCH only changed one parameter. What's closer to \"vanilla Bitcoin\"? If you want exposure to SegWitCoin I don't see the point of holding BTC and LTC. Pick just one, IMO. I hold none. Only XMR & BCH now.",
            "8$ isn't much when you're making 100K+ transactions. If you're not, use Litecoin.",
            "Litecoin and Vertcoin look great. VTC had a dip at the last days. I just bought some coins while VTC is low",
            "VTC illusion with hopeless VTC hodlers.\n\nPlease don't post anything about VTC anymore. It will never be another LTC. NEVER! \n\nWake up people. This is just a normal coins just like those on the market. ",
            "Litecoin Hits A Record High And Is Up Nearly 1,400 Percent This Year | CNBC",
            "I regret not getting into litecoin much sooner. Much lower fees than the other 2 main cryptos, and the value is only going up with atomic swaps around the corner",
            "Don't be too hung up on big highs and lows. Look at the trend beyond the last 30 mins. Stay positive with the outlook as it's looking up for now. I only own a few, but I'm looking to add more to OMG and LTC as my main coins. Happy HODLING",
            "You need to have BTC in order to buy almost every other type of coin, especially the ones with lower market caps.  ETH and LTC are moderately well adapted, but BTC is the king.  I've thought about selling my BTC frequently in the past month, but I can't bring myself to do it, knowing that despite any inherent technical weaknesses, it's still a gateway drug and therefore will be in strong demand for some time.\n\nI'll reassess this opinion as I see more and more exchanges offering trades directly out of LTC or ETH into coins with small market caps (and to clarify, I know that there are some now - but the main couple of exchanges that I use are quite limited).\n",
            "Developers aren't toxic, it's the Chinese miners who are reluctant to adopt said changes and upgrades. Anything that threatens or reduces their profit is the enemy.  If you want to see what BTC would look like without the greedy chinese cabals, look at litecoin.",
            "VTC - It's another SegWit coin like LTC & BTC.",
            "VTC is like LTC where they contrast from BTC with lower fees and faster transaction times",
            "I turn 31 in a month, been a redditor for over 6 years in total, been lurkering around here for 6 months and bought my first crypto on July 20th. Bought eth, btc and ltc.",
            "IMHO\n\n\nfor ICO : yes because most of them are still on idea stage. just like startup hype on 2010-2014 . most of them died down now\n\nfor older coins (BTC, ETH, LTC, and such) they are already battle proven and now currently in adoption phase ",
            "I think that there are a lot of parallels for what a crash would look like, but there are some important differences. During the .com crash there was a broad sector decline in value. Every tech company took a walloping and those that weren't profitable or which had fundamentally unsound business models were wiped out completely. Similarly, a crypto crash will likely see sharp declines across the board for all coins. The super dubious, craptastic recent ICOs will almost certainly disappear forever. Coins and tokens with no differentiating technical or business features will go for sure. However, I don't think the carnage will stop there. Most of the crypto products that are *very* similar to existing products will see their values plunge to next-to-worthless levels and they will likely never recover. This is where the similarities end.   \nThere is no direct comparison between \"business model\" and a crypto currency. However, there is a similar concept and that is market adoption and the technical infrastructure that goes with a coin. In this context, the survivors are already starting to emerge. They are bitcoin, ethereum, ripple and perhaps 3 or 4 others (not sure about litecoin, I personally feel it's too similar to bitcoin and doesn't have the ecosystem, but it's on the border).",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "Why no litecoin",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "Golem has exploded since the start of the year and I think the market might be waiting for the upcoming Brass release and it should receive a decent bump.\n\nVTC is a bit a of a sleeper agent imo. The developers and reasonably active community are very focused on the tech and while their marketing game has been lifted of late, this isn't where resources are primarily allocated. This is great for the long term prospects of the currency, especially as it's key focus (decentralised mining) is likely to become a hot topic in crypto in the future, as bigger coins struggle due to being beheld to interests of mining pools. But obviously not so great for short term gains. Atomic swapping later this year could also be a boon for the coin, as VTC is likely to be (one of the) first to gain the capability, in collaboration with LTC.",
            "[Coblee said even with lighting transactions on bitcoin and litecoin, LTC will still have lower fees.](https://youtu.be/erqS5f9zPc8?t=2659) 10b marketcap is just a matter of time. "
        ],
        "upvotes": [
            47,
            7,
            6,
            1,
            1,
            1,
            5,
            1,
            55,
            4,
            2,
            3,
            1,
            9,
            1,
            2,
            1,
            1,
            23,
            16,
            9,
            0,
            2,
            8
        ]
    },
    "LUN": {
        "full_name": "Lunyr",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MAID": {
        "full_name": "MaidSafe",
        "mentioned_ids": [
            "dmb2agr"
        ],
        "mentioned_times": [
            1504081377.0
        ],
        "text": [
            "Thanks for sharing this. It really defines the value of the Obelisk miner. There's no way a normie is going to satisfy the network's needs. \n\nI'm interested in the winner of the ceypto storage wars, but I only just now feel like I have a solid understanding of what Sia wants to do. There still remains filecoin, storj, and maidsafe. \n\nFilecoin says PoW is wasteful and they have a smart PoS of sorts. They are SEC compliant already. \n\nStorj had a lot of drama going on, and I believe it is fairly centralized at the moment. Last I checked there were plans to decentralized more. \n\nAnd Maidsafe is... An encrypted storage/communication network? It confuses me so. Are they competing with any of the above?\n\n\n"
        ],
        "upvotes": [
            2
        ]
    },
    "MCO": {
        "full_name": "Monaco",
        "mentioned_ids": [
            "dmb4do9",
            "dmaj8pw"
        ],
        "mentioned_times": [
            1504084006.0,
            1504059784.0
        ],
        "text": [
            "Shake, Shift, Monaco.  I saw a nice chart comparing several a week ago but can't find now. ",
            "coinbase? gemini?  tenx or monaco? "
        ],
        "upvotes": [
            1,
            1
        ]
    },
    "MEME": {
        "full_name": "Memetic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MLN": {
        "full_name": "Melon",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MONA": {
        "full_name": "MonaCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MTL": {
        "full_name": "Metal",
        "mentioned_ids": [
            "6wudoe",
            "dmax11o",
            "dmaz3v2",
            "dmb3zor",
            "dmb5g89",
            "dmb9xfc",
            "dmb7ihw",
            "dmbfnzm"
        ],
        "mentioned_times": [
            1504070569.0,
            1504074754.0,
            1504077321.0,
            1504083522.0,
            1504085345.0,
            1504091165.0,
            1504087945.0,
            1504100562.0
        ],
        "text": [
            "From Apple to Metal: Sid Parihar leads UX Design",
            "Big fan of MTL, glad I got in early.\n",
            "MTL’s team has always been strong. A lot of blockchain and product distribution problems are very hard to solve so you need very competent individuals.\nThis is definitely good signaling.",
            "I'm so ready for the world to see this project. There is nothing else like Metal on the market.\n\nBeen in since $2.",
            "MTL is a sleeping giant. FDIC insured. Go watch the AMA and see why this will be a billion dollar company by end of the year.",
            "Where can I buy Metal? I'm fairly new to crypto and only use Coinbase. I could use some help folks! ",
            "Any love for Metal?",
            "Precious metal especially silver.. been stacking slowly throughout the years "
        ],
        "upvotes": [
            95,
            6,
            4,
            3,
            2,
            1,
            1,
            1
        ]
    },
    "MUE": {
        "full_name": "MonetaryUnit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MUSIC": {
        "full_name": "Musicoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MYST": {
        "full_name": "Mysterium",
        "mentioned_ids": [
            "dmalp5s"
        ],
        "mentioned_times": [
            1504062347.0
        ],
        "text": [
            "This is *exactly* like mine, even the percentages are the same holy crap (of my initial investments at least). Differences are: I don't have aragon (have tenx instead) and have myst instead of singular dtv. Oh and btc classic instead of cash."
        ],
        "upvotes": [
            1
        ]
    },
    "NAV": {
        "full_name": "NAVCoin",
        "mentioned_ids": [
            "dmbcghp",
            "dmb17av",
            "6wv290"
        ],
        "mentioned_times": [
            1504094835.0,
            1504080012.0,
            1504077010.0
        ],
        "text": [
            "NAV",
            "Nav - super active dev and community. The more I learn the more I really like this coin.  \n61,698,298 NAV\n\nLomo - 2.0 and new exchange are announced for Mid September making a platform for US/Japan/Korea\n\n214,037,194 LMC\n\nSngls - Great team very innovative project. New nodes being released in the next month has a pretty high ceiling.\n\n600,000,000 SNGLS\n\nBAT - Coin that will probably moon just because the amount of depth on the team. Just a matter of when not if. \n\n1,000,000,000 BAT \n\n\n\n\nhttps://twitter.com/LoMoCoinTeam/status/902769626127499264",
            "Can someone give me an unbiased opinion of NAV coin?"
        ],
        "upvotes": [
            4,
            9,
            6
        ]
    },
    "NBT": {
        "full_name": "Nubits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NEO": {
        "full_name": "Neo",
        "mentioned_ids": [
            "dmak9lo",
            "dmauj6z",
            "dmbcp9a",
            "dmbcr9d",
            "6wqjwy",
            "dma2hsu",
            "dma694r",
            "dma4llx",
            "dma61il",
            "dma85du",
            "dmaowl2",
            "dmaztm9",
            "dmatzer",
            "dma6mrn",
            "dmbg14v",
            "dma8asi",
            "dmb7ryu",
            "dma8i02",
            "dmadnos",
            "dma6uf0",
            "6wsilj",
            "6wr2vh",
            "dma8hmh",
            "dm9vryw",
            "dma1yry",
            "dma5fc8",
            "dma527j",
            "dma5hnc",
            "dma57g4",
            "dmagrj1"
        ],
        "mentioned_times": [
            1504060845.0,
            1504071830.0,
            1504095230.0,
            1504095322.0,
            1504034266.0,
            1504041376.0,
            1504046031.0,
            1504044055.0,
            1504045788.0,
            1504048163.0,
            1504065707.0,
            1504078236.0,
            1504071206.0,
            1504046456.0,
            1504101321.0,
            1504048329.0,
            1504088279.0,
            1504048552.0,
            1504054029.0,
            1504046697.0,
            1504054271.0,
            1504040673.0,
            1504048542.0,
            1504027626.0,
            1504040633.0,
            1504045061.0,
            1504044624.0,
            1504045138.0,
            1504044799.0,
            1504057220.0
        ],
        "text": [
            "Where's NEO / NEO Red Pill / NEO Blue Pill?",
            "Lol no Neo",
            "You forgot NEO ;(",
            "Where do you suppose NEO went?\n",
            "NEO selling in a dip for those wanting to get in at decent price",
            "Weak hands will suffer in this space. Regulation is a good thing. Would you rather have 100 ICOs in 6 months where 99 are bullshit. Or would you rather have 10 ICOs all passed Chinese regulation? You should applaud the Chinese government\nfor being more mature than the US. I am a US citizen, I should hope the US will be more motivated when their arch dev nemesis are embracing the space. Hold your NEO.",
            "Dear god please let my wire clear today so I can buy a ton of cheap Neo.",
            "just sold my remaining NEO for ARK",
            "You cannot escape regulation no matter what. If you are a weak hand, then fold, I am sure there are plenty of people willing to take your NEO. Onchain is very comfortable with the Chinese gov, and is in\nfact testing use cases with local governments as we speak. I do not see e chinese government swatting NEO away, that is ludacris at this point. NEO is the Chinese governments ticket to the blockchain so far as we know it. Hold your NEO.",
            "You should probably provide some reasoning why it's a \"discount\" or \"decent\" price. \n\nIt would appear to me, the increase in NEO that it got from ICO buzz, just lost some of that steam due to regulation. Maybe a discount or maybe it's priced more accurately.  ",
            "Can someone clear up for me why antshares are still listed on bittirex? It looks like they have both Neo and ANS with a different price for both. ",
            "i'll rebuy if neo reaches <$30, but as of now sold all my neo / gas. too much uncertainty",
            "NEO is crap in my opinion, only argument people claim in its favor is that it is a Chinese ETH. The whole point of crypto is borderless finance, global currency, etc, why the hell is a centralized chinese coin a good thing? Also where is the development on NEO, who is working to make the platform better, what advantages does it have over ETH, what uses does it have? ICOs? Bah, ETH is already ICO king platform, I laugh at people claiming that NEO will overtake ETH as the leading smart contract platform when they have no development, no testing, no product while ETH probably has one of the smartest group of people in the planet working to make the platform better and suitable for mass adoption. Only thing NEO has done is change its name from Ant to NEO, big fucking deal, but hey, at least its the Chinese Ethereum copy.\n\nDon't fall for pumping idiots",
            "I love NEO pushers. They got a massive pump and now they call the dump \"an opportunity\". Sorry but NEO is dead.",
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything.",
            "It is a bubble. $164 billion dollar market cap, yet there is **not a single coin** that is actually used as a currency. Most don't even have a working product, and the ones that do (eg TenX) are nowhere near adoption by regular consumers. The current craze is fully driven by speculators, not by people actually **using** the cryptocoins. It's the [Dutch Tulip Mania](https://en.wikipedia.org/wiki/Tulip_mania) of the 17th century all over again.\n\nThat being said, blockchain technology will stay and some will be extremely successful, just like some internet companies remaned or became very successful after the bubble. And right now there is absolutely money to be made since the early majority adopters are currently flocking to the game. But just one look at [todays NEO-market](https://i.imgur.com/kSW8NcP.png) shows how nervous the market is. If it crashes (and it will, because the current market is not healthy), it's going *poof* really fast. And after that, it will rise again, based on more solid products and more common sense.",
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "I actually like your portfolio quite a bit, but i would reconsider NEO and BCH amd instead go for ETH and BAT.",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "Someone made a thread awhile ago that said \"Ever wondered why everyone that says rate my portfolio has NEO as pretty much their top investment\". Ill tell you what, drop NEO and you will have a winning portfolio.",
            "What Is NEO - The Newbie Guide to Rebranded AntShares",
            "Which coin has a potential like NEO?",
            "NEO isnt a coin.",
            "I'm interested in hearing peoples thoughts on how this would impact NEO. I like NEO but I hate Redpulse and don't feel its a good ICO to promote the platform with and feel its an almost pointless coin.",
            "Less BTC more NEO",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC",
            "Looks Nice And solid. Also add ARK and/or NEO",
            "Wait with Neo. Just came out China news about ico regulations. Research Ark ",
            "Good time to buy NEO low, has potential ",
            "I'd like to echo the recommendations of everyone; NEO and ARK.\n\nNeo is correcting right now. I'd give it a couple days of breathing room before jumping in. The coin has a lot of promising things going for it, so I would highly recommend considering it.\n\nArk is also trending down, so I'd be cautious/patient before jumping in.\n\nI'd also recommend giving OMG and LSK a look. They're pretty promising."
        ],
        "upvotes": [
            4,
            1,
            1,
            1,
            53,
            76,
            9,
            5,
            4,
            5,
            1,
            1,
            -1,
            -15,
            1,
            6,
            16,
            2,
            0,
            -2,
            14,
            8,
            -6,
            6,
            5,
            3,
            4,
            4,
            3,
            2
        ]
    },
    "NEOS": {
        "full_name": "NeosCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NLG": {
        "full_name": "Gulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NMR": {
        "full_name": "Numeraire",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXC": {
        "full_name": "Nexium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXS": {
        "full_name": "Nexus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXT": {
        "full_name": "NXT",
        "mentioned_ids": [
            "dmad0q1"
        ],
        "mentioned_times": [
            1504053364.0
        ],
        "text": [
            "Look into Stratis. Despite a significant price decrease from their ATH, Stratis hasn't experienced any technical problems. Their program is only looking better than it did then. They've partnered with Earth Twine, a company that will be adding compliance to regulation of seafood onto the blockchain, such as verification of the origin and date the seafood was caught. I expect this to be the first Stratis sidechains, in addition to Blitzcash which was announced some time ago. Stratis is in a race to implement sidechains with Ark, and Ardor/NXT. \n\nStratis also has their Breeze wallet, which has TumbleBit integration. An alpha of Breeze should be released within the next two months; but they've verified and stress-tested Tumblebit within the wallet. Plus, they have one of the most professional crypto teams that I've come across. \n\nThe June price spike for Stratis wasn't a pump and dump, but was an early indication of their future success.\n\nDisclosure: I am/we are long STRAT."
        ],
        "upvotes": [
            3
        ]
    },
    "OK": {
        "full_name": "OkCash",
        "mentioned_ids": [
            "dmbecti",
            "dmawwvb",
            "dmay9j5",
            "dmaj7l4",
            "dmafcsp"
        ],
        "mentioned_times": [
            1504098038.0,
            1504074616.0,
            1504076252.0,
            1504059753.0,
            1504055768.0
        ],
        "text": [
            "I'm really knew to crypto and I haven't even mined a single full ETH yet but I didn't clue into the title right away...when I saw the value of ETH I freaked out a little. Ok, a lot. \n\nThen I realized...",
            "What's it with you Sia analysis bus that whenever you put out a Sia analysis bullcrap Sia keeps coming down? Why not put another nail in the coffin and come out with another one next week? Sia was around .0081 on the dollar and now is like0.0076. My goodness. STOP you're not helping anyone. Ok thank you. ",
            "Ok you go first.",
            "Take half, if it goes up - thats ok you have half still in. If it crashes, excellect you have half to reinvest. ",
            "To be the safest, yes you should use a hardware wallet for the most security. Tons of guides how to set it up safely and securely.\n\nMore realistically, if you are going for a x2 gain and then can make yourself sell when you get that? It's probably ok to keep your money on the exchange. No one here will tell you to do that because it definitely has the most risk, but ultimately the risk is small over a short period of time. At $1,000 trying to double your money it could be as short as a month or even 2 weeks. I haven't heard of any big exchanges over the last few weeks being hacked that weren't the end users fault clicking on phishing links. 90+% chance you'd be fine on the exchange. 99.9% on your wallet (MEW or hardware) assuming you did it correctly. \n\nJust be sure you remember your goal. It can be very easy to get caught up in the pumps and think well I doubled my money, might as well triple it right? But no one really knows what's going to happen day to day with all of this. Don't keep going unless you are willing to lose it all. Take out your initial investment if you do so you can at least claim to be playing with house money even though that's an easy way to lose a lot.\n\nTl;dr keeping coins on proven exchange is probably be fine and more convenient, but a wallet would be safer\n"
        ],
        "upvotes": [
            1,
            0,
            5,
            2,
            3
        ]
    },
    "OMG": {
        "full_name": "OmiseGO",
        "mentioned_ids": [
            "dmazfw8",
            "6wpzp4",
            "dm9ww3a",
            "dmau32w",
            "dmbbo90",
            "dmadnos",
            "dmb3614",
            "dma5fc8",
            "dmaog9e",
            "dmagrj1"
        ],
        "mentioned_times": [
            1504077747.0,
            1504025790.0,
            1504030712.0,
            1504071322.0,
            1504093634.0,
            1504054029.0,
            1504082489.0,
            1504045061.0,
            1504065237.0,
            1504057220.0
        ],
        "text": [
            "I was holding Sia for 3 months now and just sold it today. I had enough of it, it may be good, but apparently the people dont appreciate it. I switched to OMG.",
            "OmiseGo has liftoff?",
            "Cause they are clever cookies\nhttps://medium.com/@jun_omise/omise-omisego-strategy-vol-01-5c7269bb2008",
            "Don't be too hung up on big highs and lows. Look at the trend beyond the last 30 mins. Stay positive with the outlook as it's looking up for now. I only own a few, but I'm looking to add more to OMG and LTC as my main coins. Happy HODLING",
            "OMG",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "/biz/ told me about OMG, ANS, and BNB way before I saw them talked about on reddit.\n\nYou just have yo acknowledge /biz/ for what it is - a clusterfuck of hype with the attention span of a fly. But it can give you a good glimpse at coins you've never heard of.\n",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC",
            "Research the coins you believe in and those that you think will rise in value soon, I like Sia so I have some for the long term although I don't expect it to rise anytime soon, I also have some Lisk, Ark, Pivx & OMG I also want to keep these for the long term but those four are hopefully all going to have a good Q4 with various releases & a rebranding so I think there's short term profit as well if that's what you want to do. Good luck. ",
            "I'd like to echo the recommendations of everyone; NEO and ARK.\n\nNeo is correcting right now. I'd give it a couple days of breathing room before jumping in. The coin has a lot of promising things going for it, so I would highly recommend considering it.\n\nArk is also trending down, so I'd be cautious/patient before jumping in.\n\nI'd also recommend giving OMG and LSK a look. They're pretty promising."
        ],
        "upvotes": [
            1,
            45,
            9,
            2,
            23,
            0,
            1,
            3,
            4,
            2
        ]
    },
    "OMNI": {
        "full_name": "OMNI",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PART": {
        "full_name": "Particl",
        "mentioned_ids": [
            "dmbf3tz",
            "dmaifln",
            "dmaj56x"
        ],
        "mentioned_times": [
            1504099460.0,
            1504058949.0,
            1504059685.0
        ],
        "text": [
            "PART\n\nCAT\n\nSNGLS\n\nTAAS\n\nTbh, most of those listed here have been thrown around often....I think these are a bit lower key... ",
            "Overall I like it!\n\nPersonally, I'd dump BCH and 2-3 tokens. Reinvest in your current portfolio.\n\nI'd get more ETH. Even if you mining...\n\nSNGLS will pick up soon with some announcements. Lots of upside there.\n\nConsider picking up one or two of these: BAT, ARK, TAAS or PART.\n\nCheers.  ",
            "I really like PART.\n\nMight be worth it to take a look."
        ],
        "upvotes": [
            1,
            1,
            1
        ]
    },
    "PAY": {
        "full_name": "TenX Pay Token",
        "mentioned_ids": [
            "dmbd3yf",
            "dmabxhf",
            "dma5fc8"
        ],
        "mentioned_times": [
            1504095897.0,
            1504052218.0,
            1504045061.0
        ],
        "text": [
            "PAY (TenX) is rumored to have a huge announcement within the next few days. Price will rocket. IOS application release \n\n",
            "Not personally a fan of IOTA or BCH, or any gaming/gambling coins, but you should look into ARK, QTUM, PAY, BAT, CVC",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC"
        ],
        "upvotes": [
            9,
            0,
            3
        ]
    },
    "PDC": {
        "full_name": "Project Decorum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PINK": {
        "full_name": "PinkCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PIVX": {
        "full_name": "Pivx",
        "mentioned_ids": [
            "dmaog9e"
        ],
        "mentioned_times": [
            1504065237.0
        ],
        "text": [
            "Research the coins you believe in and those that you think will rise in value soon, I like Sia so I have some for the long term although I don't expect it to rise anytime soon, I also have some Lisk, Ark, Pivx & OMG I also want to keep these for the long term but those four are hopefully all going to have a good Q4 with various releases & a rebranding so I think there's short term profit as well if that's what you want to do. Good luck. "
        ],
        "upvotes": [
            4
        ]
    },
    "PKB": {
        "full_name": "ParkByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "POT": {
        "full_name": "PotCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PPC": {
        "full_name": "Peercoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PTC": {
        "full_name": "PesetaCoin ",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PTOY": {
        "full_name": "Patientory",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "QRL": {
        "full_name": "Quantum Resistant Ledger",
        "mentioned_ids": [
            "dmbg14v"
        ],
        "mentioned_times": [
            1504101321.0
        ],
        "text": [
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything."
        ],
        "upvotes": [
            1
        ]
    },
    "QTUM": {
        "full_name": "Qtum",
        "mentioned_ids": [
            "dmb7ryu",
            "dmabxhf",
            "dma5fc8"
        ],
        "mentioned_times": [
            1504088279.0,
            1504052218.0,
            1504045061.0
        ],
        "text": [
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "Not personally a fan of IOTA or BCH, or any gaming/gambling coins, but you should look into ARK, QTUM, PAY, BAT, CVC",
            "Look into OMG, NEO, LSK, BAT, QTUM, PAY, CVC"
        ],
        "upvotes": [
            16,
            0,
            3
        ]
    },
    "QWARK": {
        "full_name": "Qwark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RADS": {
        "full_name": "Radium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RBY": {
        "full_name": "RubyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RDD": {
        "full_name": "ReddCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "REP": {
        "full_name": "Augur",
        "mentioned_ids": [
            "dmadnos"
        ],
        "mentioned_times": [
            1504054029.0
        ],
        "text": [
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are."
        ],
        "upvotes": [
            0
        ]
    },
    "RISE": {
        "full_name": "Rise",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RLC": {
        "full_name": "iEx.ec",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SAFEX": {
        "full_name": "SafeExchangeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SBD": {
        "full_name": "SteemDollars",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SC": {
        "full_name": "Siacoin",
        "mentioned_ids": [
            "dmanhex",
            "dmaknys",
            "dmanibc",
            "dmatp1c",
            "dmaur5a",
            "dmay9a2",
            "dmb3dx5",
            "dmaqdfz",
            "dmay1rs",
            "dmauif3",
            "dmb3thk",
            "6wu00c"
        ],
        "mentioned_times": [
            1504064230.0,
            1504061261.0,
            1504064256.0,
            1504070882.0,
            1504072079.0,
            1504076244.0,
            1504082764.0,
            1504067249.0,
            1504075986.0,
            1504071806.0,
            1504083306.0,
            1504067181.0
        ],
        "text": [
            "Hello. Has anyone verified this claim with SIA COIN?\nAccording to this image Kim dot coms new platform allows you to store on siacoin. \n\nheres the image\nhttp://imgur.com/a/6Cku7\n\nIt's on K.im as a demo.\n\nI tried the service but I'm unsure if he's hosting it server side or on siacoin. You can sign up for the beta invite.",
            "Thanks for this post. Siacoin has been one of the few altcoins that has peaked my interest since it has a potentially really good use case.\n\nThe explanation on how hosting is limited/penalized is really good. Im hoping the upcoming changes, specifically the small file size change, will help adoption pick up.",
            "One point i find important with Siacoin is the integration with Nextcloud. Nextcloud users are not like the average joe...  They are well informed and ready to experiment new tech. So it could get some momentum from them while waiting for some companies partnerships which would dramatically increase the coins value. ",
            "One important thing that should be called out... if anyone plans on actually hosting for Siacoin and aren't on a high end internet connection you will blow through your bandwidth cap in no time flat.\n\nThe additional question that many of these distributed computing projects need to answer up front is are you legally responsible for what is stored on your hardware or is it fully encrypted and you are 100% free from any legality issues?",
            "Thanks for your analysis - with the ICO madness and increasing amount of shady players in the crypto game, I will say that Sia is a breath of fresh air. Here is a post I put up a month ago or so on reasons I am big on Sia for the long-term:\n\n[Things I Considered Before Investing Into Sia](https://www.reddit.com/r/siacoin/comments/6lsfkz/things_i_considered_before_investing_into_sia/)\n\nThe Sia devs are extremely transparent and make a serious effort to engage and communicate with the community (growing super quickly - http://redditmetrics.com/r/siacoin). \n\nI am getting my Raspberry Pi 8TB hosting set up this week to add more capacity to the total storage but to also learn the ins and outs of Sia. I've also purchased a couple of Obelisk miners and created [this profitability calculator](https://docs.google.com/spreadsheets/d/19heDnA_o4Q8KuII4o1mKah7Sxafj85RSB-x-teN1SqE/edit#gid=0) to play around with some of the numbers. IMO, Siacoin is a great investment for a 3-5 year window but it's definitely not a get-rich-quick coin and I don't think it will ever go more than $1 per Siacoin but with enough volume, could be a nice ROI. ",
            "> 6 - There is no cap to how much siacoin there will be\n\nWhat kind of influence does this have on the value of the token? ",
            "No analysis of siafund as well as siacoin in an evaluation of Sia? It's an important part of the Sia ecosystem and an interesting if expensive investment option, the only cryptocurrency worth more than a bitcoin :-)",
            "I believe the analysis should be much more simple than that.  Like all utility coins, I believe the value of the coin will peak at right under the cost of similar services from their competitors.  \nFor example, the price of Siacoin shouldn't rise over the price that it costs to purchase the same amount of storage from Dropbox.  Otherwise, their service becomes unusable causing less people to buy for utility and the price to drop.  This should also keep the coin from dropping too far below the competitors price.  As the coin gets cheaper, so does the service.  This makes people buy more coin and drive the price back up.  This rule should hold for all utility coins.  Speculation may drive the price slightly higher or lower, but not by much.",
            "Here's an easy guide for people to get and store their Siacoin: https://buyingsiacoin.com/",
            "But...but...siacoin?",
            "2 coins I was interested in at the beginning but it seems they are dead ( I wish I am wrong)\n*Digibyte\n*Siacoin",
            "What Is Sia/Siacoin - Decentralised Cloud Storage Video"
        ],
        "upvotes": [
            14,
            12,
            10,
            9,
            7,
            6,
            2,
            1,
            1,
            8,
            2,
            25
        ]
    },
    "SEQ": {
        "full_name": "Sequence",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SHIFT": {
        "full_name": "Shift",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SIB": {
        "full_name": "Siberian Chervonets",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLR": {
        "full_name": "SolarCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLS": {
        "full_name": "SaluS",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNGLS": {
        "full_name": "SingularDTV",
        "mentioned_ids": [
            "dmbbvze",
            "dmbf3tz",
            "dmaifln",
            "dmb17av"
        ],
        "mentioned_times": [
            1504093956.0,
            1504099460.0,
            1504058949.0,
            1504080012.0
        ],
        "text": [
            "nem and singulardtv",
            "PART\n\nCAT\n\nSNGLS\n\nTAAS\n\nTbh, most of those listed here have been thrown around often....I think these are a bit lower key... ",
            "Overall I like it!\n\nPersonally, I'd dump BCH and 2-3 tokens. Reinvest in your current portfolio.\n\nI'd get more ETH. Even if you mining...\n\nSNGLS will pick up soon with some announcements. Lots of upside there.\n\nConsider picking up one or two of these: BAT, ARK, TAAS or PART.\n\nCheers.  ",
            "Nav - super active dev and community. The more I learn the more I really like this coin.  \n61,698,298 NAV\n\nLomo - 2.0 and new exchange are announced for Mid September making a platform for US/Japan/Korea\n\n214,037,194 LMC\n\nSngls - Great team very innovative project. New nodes being released in the next month has a pretty high ceiling.\n\n600,000,000 SNGLS\n\nBAT - Coin that will probably moon just because the amount of depth on the team. Just a matter of when not if. \n\n1,000,000,000 BAT \n\n\n\n\nhttps://twitter.com/LoMoCoinTeam/status/902769626127499264"
        ],
        "upvotes": [
            2,
            1,
            1,
            9
        ]
    },
    "SNRG": {
        "full_name": "Synergy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNT": {
        "full_name": "Status Network Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SPHR": {
        "full_name": "Sphere",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SPR": {
        "full_name": "SpreadCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "START": {
        "full_name": "StartCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "STEEM": {
        "full_name": "STEEM",
        "mentioned_ids": [
            "dm9zcw9"
        ],
        "mentioned_times": [
            1504036304.0
        ],
        "text": [
            "What $8 fees? https://bitcoinfees.21.co/ I see $4 to get into next block for average tx. Larger tx like sending to 1000 accounts takes more fee, but similar per tx.\n\nThen you say confirmations take forever too. And $8 fees. That's VERY misleading as they are inversely correlated. If you analyze only tx that included a fee, median time is ~12 minutes https://blockchain.info/charts/median-confirmation-time which is most places require.\n\nWhat you are reading is typical rhetoric used by other coins to promote themselves, often because they are unused and do not mention downsides of their design\n\nYou're saying load without understanding that's an attack vector. \n\nAnyone can create a backlog, trillions per second. Should the network process all those and keep them on chain forever, raising bandwidth requirements (and storage) that high for everyone, and thus compromising security? \n\nNo. Limit has to be placed somewhere on spectrum of security vs speed. BTC chooses security, and use layer 2+ for speed. But they did introduce 1mb to 2-4mb max block weight increase with segwit. Most blocks now are over 1mb. So already they traded off some security for speed increase but also enabled layer 2 solutions required.\n\nSo when someone says they can go faster by changing a few parameters, ask them what they GIVE UP for it: [1](https://twitter.com/SDWouters/status/862426991370358784),[2](https://twitter.com/TuurDemeester/status/881851053913899009),[3](https://twitter.com/TuurDemeester/status/881852318517473280)\n\nIt is a real solution: https://hackernoon.com/simulating-a-decentralized-lightning-network-with-10-million-users-9a8b5930fa7a\n\nIt's not a simple answer, most people start off as completely for speed until they realize the trade offs. \n\nIf I want super fast but very limited in # validators (elected 25-100 witnesses), I'd use bts or steem (free tx) to go faster than VISA for small tx - both process 2x+ more tx than btc and eth combined. When I want security for large amounts, I use BTC. (Hard not to mention them since they are clear leaders in tx today and speed)\n\nIn the end it's possible you can spend entire life only on layer 2 LN network, have option to settle on layer 1, but most will never need it and it will be mostly used by large players like vendors and amazons of the world settling between each other taking on the costs.\n\nAdditionally, pegged side chains are good scaling opportunity as well without losing value - http://i.imgur.com/ENpXtTt.png - this is happening very soon too - https://stats.rsk.co/ - segwit allowed it to use drivechains instead of federated bridges which is huge win. RSK and also MAST for smart contracts are showing BTC ability to adapt good ideas from others. They do this without compromising the security of the foundation, building on the most secure and well understood platform possible.\n\nThere's 4+ lightning implementations including for mobile phones.\n\nNothing wrong with using altcoins for small amounts if you can't afford the fees or speed, until layer 2+ and sidechains are ready since you don't need high security for it. That is a speed solution. But lets not pretend they are equivalent, especially using a chain that shall not be named that can't manage to remain online for few months at a time without security breakdown of the entire chain. \n\ntldr: there's value in security, there's more than speed and fees that's important"
        ],
        "upvotes": [
            28
        ]
    },
    "STORJ": {
        "full_name": "Storj",
        "mentioned_ids": [
            "dmb2agr"
        ],
        "mentioned_times": [
            1504081377.0
        ],
        "text": [
            "Thanks for sharing this. It really defines the value of the Obelisk miner. There's no way a normie is going to satisfy the network's needs. \n\nI'm interested in the winner of the ceypto storage wars, but I only just now feel like I have a solid understanding of what Sia wants to do. There still remains filecoin, storj, and maidsafe. \n\nFilecoin says PoW is wasteful and they have a smart PoS of sorts. They are SEC compliant already. \n\nStorj had a lot of drama going on, and I believe it is fairly centralized at the moment. Last I checked there were plans to decentralized more. \n\nAnd Maidsafe is... An encrypted storage/communication network? It confuses me so. Are they competing with any of the above?\n\n\n"
        ],
        "upvotes": [
            2
        ]
    },
    "STRAT": {
        "full_name": "Stratis",
        "mentioned_ids": [
            "dmad0q1",
            "6wvdiy"
        ],
        "mentioned_times": [
            1504053364.0,
            1504080223.0
        ],
        "text": [
            "Look into Stratis. Despite a significant price decrease from their ATH, Stratis hasn't experienced any technical problems. Their program is only looking better than it did then. They've partnered with Earth Twine, a company that will be adding compliance to regulation of seafood onto the blockchain, such as verification of the origin and date the seafood was caught. I expect this to be the first Stratis sidechains, in addition to Blitzcash which was announced some time ago. Stratis is in a race to implement sidechains with Ark, and Ardor/NXT. \n\nStratis also has their Breeze wallet, which has TumbleBit integration. An alpha of Breeze should be released within the next two months; but they've verified and stress-tested Tumblebit within the wallet. Plus, they have one of the most professional crypto teams that I've come across. \n\nThe June price spike for Stratis wasn't a pump and dump, but was an early indication of their future success.\n\nDisclosure: I am/we are long STRAT.",
            "Eli5: Why do blockchain technologies that seem to serve more as a platform such as Factom, Ethereum, Stratis(to name a few) even have a corresponding coin?"
        ],
        "upvotes": [
            3,
            10
        ]
    },
    "SWIFT": {
        "full_name": "Bitswift",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SWT": {
        "full_name": "Swarm City Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYNX": {
        "full_name": "Syndicate",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYS": {
        "full_name": "SysCoin",
        "mentioned_ids": [
            "6wtq4i",
            "dmapoic",
            "dmb6njb"
        ],
        "mentioned_times": [
            1504064787.0,
            1504066523.0,
            1504086855.0
        ],
        "text": [
            "SYSCOIN development and update",
            "Can someone make an educated guess based on market cap if this coin can ever grow 10+ or something? I remember a long time ago some called Syscoin the perfect penny stock for the long hold. That was back when it was 0.07 or something. Wish I would have listened.",
            "Sys."
        ],
        "upvotes": [
            17,
            6,
            3
        ]
    },
    "THC": {
        "full_name": "HempCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TIME": {
        "full_name": "Chronobank Time",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TKN": {
        "full_name": "TokenCard",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TKS": {
        "full_name": "Tokes",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRIG": {
        "full_name": "TRIG Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRST": {
        "full_name": "Trustcoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRUST": {
        "full_name": "TrustPlus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TX": {
        "full_name": "TransferCoin",
        "mentioned_ids": [
            "dm9zcw9",
            "dma3hzp",
            "dmaj3j1",
            "dmaimf2"
        ],
        "mentioned_times": [
            1504036304.0,
            1504042687.0,
            1504059637.0,
            1504059147.0
        ],
        "text": [
            "What $8 fees? https://bitcoinfees.21.co/ I see $4 to get into next block for average tx. Larger tx like sending to 1000 accounts takes more fee, but similar per tx.\n\nThen you say confirmations take forever too. And $8 fees. That's VERY misleading as they are inversely correlated. If you analyze only tx that included a fee, median time is ~12 minutes https://blockchain.info/charts/median-confirmation-time which is most places require.\n\nWhat you are reading is typical rhetoric used by other coins to promote themselves, often because they are unused and do not mention downsides of their design\n\nYou're saying load without understanding that's an attack vector. \n\nAnyone can create a backlog, trillions per second. Should the network process all those and keep them on chain forever, raising bandwidth requirements (and storage) that high for everyone, and thus compromising security? \n\nNo. Limit has to be placed somewhere on spectrum of security vs speed. BTC chooses security, and use layer 2+ for speed. But they did introduce 1mb to 2-4mb max block weight increase with segwit. Most blocks now are over 1mb. So already they traded off some security for speed increase but also enabled layer 2 solutions required.\n\nSo when someone says they can go faster by changing a few parameters, ask them what they GIVE UP for it: [1](https://twitter.com/SDWouters/status/862426991370358784),[2](https://twitter.com/TuurDemeester/status/881851053913899009),[3](https://twitter.com/TuurDemeester/status/881852318517473280)\n\nIt is a real solution: https://hackernoon.com/simulating-a-decentralized-lightning-network-with-10-million-users-9a8b5930fa7a\n\nIt's not a simple answer, most people start off as completely for speed until they realize the trade offs. \n\nIf I want super fast but very limited in # validators (elected 25-100 witnesses), I'd use bts or steem (free tx) to go faster than VISA for small tx - both process 2x+ more tx than btc and eth combined. When I want security for large amounts, I use BTC. (Hard not to mention them since they are clear leaders in tx today and speed)\n\nIn the end it's possible you can spend entire life only on layer 2 LN network, have option to settle on layer 1, but most will never need it and it will be mostly used by large players like vendors and amazons of the world settling between each other taking on the costs.\n\nAdditionally, pegged side chains are good scaling opportunity as well without losing value - http://i.imgur.com/ENpXtTt.png - this is happening very soon too - https://stats.rsk.co/ - segwit allowed it to use drivechains instead of federated bridges which is huge win. RSK and also MAST for smart contracts are showing BTC ability to adapt good ideas from others. They do this without compromising the security of the foundation, building on the most secure and well understood platform possible.\n\nThere's 4+ lightning implementations including for mobile phones.\n\nNothing wrong with using altcoins for small amounts if you can't afford the fees or speed, until layer 2+ and sidechains are ready since you don't need high security for it. That is a speed solution. But lets not pretend they are equivalent, especially using a chain that shall not be named that can't manage to remain online for few months at a time without security breakdown of the entire chain. \n\ntldr: there's value in security, there's more than speed and fees that's important",
            "The simple truth of the matter is, that no trustless blockchain can be at the same time:\n- decentralised and secure\n- widely successful as a payment solution\n- have affordable tx fees.\n\nTrustless blockchains propagate every transaction  ever to every full node.  If you do the math for what that means to compete with fiat/visa/paypall, its pretty obvious this cant work. You can make the blocks, and thus the chain, 2x larger, 10x larger,  100x larger,  it won't solve the problem fundamentally. First off, as long as transactions are really cheap, the blockchain will be abused, filled up with spam (by competing blockchains for instance), non transaction messaging, satoshidice crap and what have you, until the blocks get full enough that market pricing of this permanent, ultrasecure decentralised storage reaches an equilibrium.\n\nBut more importantly,  to compete with volumes of Visa and the like, blocks would need to be so large, that virtually no one would be able to run a full node, because the storage requirements and the processing requirements would mean a high end PC wouldnt cut it, you'd need your own datacenter, not unlike VISA. And thus you kill decentralisation and security. Already with a pretty young currency like bitcoin, that \"no one\" uses, with tiny 1MB blocks, the blockchain has grown big enough that we are struggling to have enough full nodes (we lost like 95% of them over the last few years). Time will make this worse, bigger blocks will make this a LOT worse.\n\nOff chain payment channels truly is the only way to achieve scaling. Small payments to pay for your pizza dont need to settle on the blockchain instantly, and some limited counterparty risk for a short period of time, is entirely acceptable. Yes, LN can be implemented on other coins, so what? Bitcoin is still (by far) the most secure blockchain, and payment channels settling on it, rather than some obscure altcoin will still be more desirable. Not so much for the user who wants to pay for his pizza, but for whoever operates the payment channels.",
            "Funny how what we call BTC today diverged more than BCH from \"the original\". BTC introduced a whole new TX format, and BCH only changed one parameter. What's closer to \"vanilla Bitcoin\"? If you want exposure to SegWitCoin I don't see the point of holding BTC and LTC. Pick just one, IMO. I hold none. Only XMR & BCH now.",
            "Bitcoin is such a joke. They just \"scaled\" after a two year hardcore WAR over segwit. And there is no sight of sinking fees or higher TX volume. It will take years before segwit goes into effect, if at all.  \n  \nKodak was first at digital photography.  \nNokia was first on mobile phones.  \nBitcoin was first on crypto currencies.  \n  \nYou know the story...."
        ],
        "upvotes": [
            28,
            15,
            1,
            -1
        ]
    },
    "UBQ": {
        "full_name": "Ubiq",
        "mentioned_ids": [
            "dmbh858",
            "dmbhiig",
            "dma8olh"
        ],
        "mentioned_times": [
            1504103947.0,
            1504104622.0,
            1504048751.0
        ],
        "text": [
            "Cant believe no ones spoken of Ubiq. Its been blowing up this week and still has a long ways to go. The typical bot response (great team, great idea yadd yadda) but its true. Its a better ETC and I would place the value around ETC. Also, if I'm not mistaken Bittrex has a hand in Ubiq and their killing it with their exchange. My other two are ARK and CIVIC ",
            "Signatum is gonna blow up when its no longer minable (block 100k)\n\nUbiq is for sure going to ~10$ this year",
            "Right now Ark, maybe soon I think Ubiq both are great IMO"
        ],
        "upvotes": [
            1,
            1,
            13
        ]
    },
    "UNB": {
        "full_name": "UnbreakableCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UNO": {
        "full_name": "Unobtanium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VIA": {
        "full_name": "ViaCoin ",
        "mentioned_ids": [
            "dmbe0kh"
        ],
        "mentioned_times": [
            1504097435.0
        ],
        "text": [
            "Linx, VIA"
        ],
        "upvotes": [
            2
        ]
    },
    "VOX": {
        "full_name": "Voxels",
        "mentioned_ids": [
            "6wrbp0"
        ],
        "mentioned_times": [
            1504043276.0
        ],
        "text": [
            "What are Voxels and why does this coin keep growing?"
        ],
        "upvotes": [
            3
        ]
    },
    "VRC": {
        "full_name": "VeriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VRM": {
        "full_name": "Verium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VTC": {
        "full_name": "Vertcoin",
        "mentioned_ids": [
            "6wtja2",
            "dmatm3i",
            "dmb5ic2",
            "dmbhygk",
            "dmbbjkg",
            "dmbe0yc",
            "dmbgfkz",
            "dmbh95m",
            "dmbhk4s",
            "6wuzl1",
            "dmayor9",
            "dmayy8h",
            "dmb9fub",
            "dmbhy9x",
            "dmb2ymf",
            "dm9wmpd",
            "dm9wpdk",
            "dma5107"
        ],
        "mentioned_times": [
            1504063099.0,
            1504070791.0,
            1504085422.0,
            1504105680.0,
            1504093443.0,
            1504097453.0,
            1504102175.0,
            1504104012.0,
            1504104728.0,
            1504076282.0,
            1504076788.0,
            1504077123.0,
            1504090495.0,
            1504105668.0,
            1504082230.0,
            1504030016.0,
            1504030218.0,
            1504044583.0
        ],
        "text": [
            "From /r/Vertcoin: \"Just made my first #LightningNetwork transaction on @Vertcoin with the help of @jamesl22!\"",
            "Litecoin and Vertcoin look great. VTC had a dip at the last days. I just bought some coins while VTC is low",
            "The roadmap online says it's not even in progress yet :/ https://trello.com/b/RbsKPeGw/vertcoin-roadmap Im not sure if they pose updates elsewhere ",
            "VTC illusion with hopeless VTC hodlers.\n\nPlease don't post anything about VTC anymore. It will never be another LTC. NEVER! \n\nWake up people. This is just a normal coins just like those on the market. ",
            "I HAD a few sleepers but I recently gave them all up for one... VTC. Once this Lightning Network and Atomic Swaps drop on us.... I may be 100% wrong, but if not, VTC gonna drop than 1000% increase xD",
            "VTC - It's another SegWit coin like LTC & BTC.",
            "VTC is like LTC where they contrast from BTC with lower fees and faster transaction times",
            "Vertcoin\nDistrict0x\nAsch",
            "FCT. I think it's value will be realised in almost direct correlation with the value of blockchain itself being realised by the world. Very, very strong fundamentals that the masses will understand much better only as they understand blockchain itself better.\n\nXRP. Can also see it becoming the industry standard for privacy (a huge concern) and also surviving any future crypto crashes/wipeouts. Sleeper still, despite it's recent rise.\n\nVTC. Strong community, devoted developers and loads of room to grow, especially with lightning network & atomic swapping in development.",
            "Golem and vertcoin",
            "For Vertcoin, it's because the devs don't generally go around shilling it. They believe the tech will give it value. And it's got great tech! Atomic swaps coming soon :) (here I am shilling lmao)",
            "as far as I'm aware Golem doesn't have the tech yet. Vertcoin is solid and the devs have listened to their community and are going to focus more on marketing. ",
            "Golem has exploded since the start of the year and I think the market might be waiting for the upcoming Brass release and it should receive a decent bump.\n\nVTC is a bit a of a sleeper agent imo. The developers and reasonably active community are very focused on the tech and while their marketing game has been lifted of late, this isn't where resources are primarily allocated. This is great for the long term prospects of the currency, especially as it's key focus (decentralised mining) is likely to become a hot topic in crypto in the future, as bigger coins struggle due to being beheld to interests of mining pools. But obviously not so great for short term gains. Atomic swapping later this year could also be a boon for the coin, as VTC is likely to be (one of the) first to gain the capability, in collaboration with LTC.",
            "It seems like VTC is on a downward trend right now - will it hit .7-.6?\n.75 at the moment.",
            "Vertcoin. It has a good solid practical purpose too: helping GPU miners to mine something tradable for bitcoin. Probably won't go to $1000 but I could see it going to $5 or more.",
            "Depends what your goal is. If you want mass profit in a short time than you have to much BTC. That wont go times 10 in a year. \n\nPerhaps Some VTC. Thats pretty well prices at the moment and introducing lightning network later this year. ",
            "Thanks, the main reason I keep so much BTC is to jump on any new coins/ICO's I don't keep at the moment. I will look into VTC today thanks for the advice! ",
            "I'd definitely buy more Eth, and drop AdEx to add BAT. Better developers, more proof of work, better future, same purpose. Don't listen to the VTC naysayers, it has potential. "
        ],
        "upvotes": [
            71,
            5,
            2,
            1,
            20,
            9,
            1,
            1,
            1,
            19,
            21,
            8,
            2,
            1,
            22,
            5,
            3,
            1
        ]
    },
    "VTR": {
        "full_name": "vTorrent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "WAVES": {
        "full_name": "Waves",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "WINGS": {
        "full_name": "Wings DAO",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XAUR": {
        "full_name": "Xaurum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XBB": {
        "full_name": "Boolberry",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XCP": {
        "full_name": "Counterparty",
        "mentioned_ids": [
            "dma3hzp",
            "dmbf9wl"
        ],
        "mentioned_times": [
            1504042687.0,
            1504099792.0
        ],
        "text": [
            "The simple truth of the matter is, that no trustless blockchain can be at the same time:\n- decentralised and secure\n- widely successful as a payment solution\n- have affordable tx fees.\n\nTrustless blockchains propagate every transaction  ever to every full node.  If you do the math for what that means to compete with fiat/visa/paypall, its pretty obvious this cant work. You can make the blocks, and thus the chain, 2x larger, 10x larger,  100x larger,  it won't solve the problem fundamentally. First off, as long as transactions are really cheap, the blockchain will be abused, filled up with spam (by competing blockchains for instance), non transaction messaging, satoshidice crap and what have you, until the blocks get full enough that market pricing of this permanent, ultrasecure decentralised storage reaches an equilibrium.\n\nBut more importantly,  to compete with volumes of Visa and the like, blocks would need to be so large, that virtually no one would be able to run a full node, because the storage requirements and the processing requirements would mean a high end PC wouldnt cut it, you'd need your own datacenter, not unlike VISA. And thus you kill decentralisation and security. Already with a pretty young currency like bitcoin, that \"no one\" uses, with tiny 1MB blocks, the blockchain has grown big enough that we are struggling to have enough full nodes (we lost like 95% of them over the last few years). Time will make this worse, bigger blocks will make this a LOT worse.\n\nOff chain payment channels truly is the only way to achieve scaling. Small payments to pay for your pizza dont need to settle on the blockchain instantly, and some limited counterparty risk for a short period of time, is entirely acceptable. Yes, LN can be implemented on other coins, so what? Bitcoin is still (by far) the most secure blockchain, and payment channels settling on it, rather than some obscure altcoin will still be more desirable. Not so much for the user who wants to pay for his pizza, but for whoever operates the payment channels.",
            "People have mentioned this here already but Bitcoin is a necessary entry to the altcoin game. Every time someone new ones to buy into an ICO or some other shitcoin they must first buy Bitcoin. This means their investments have a multipled effect (they pump Bitcoin as well as shitcoin X with that one fiat purchase). In some instances, people are going through 3 or 4 trades to get their desired crypto. (EX: Fiat>Bitcoin>CounterParty>Pepecash>rare pepe).\n\nCoupled with the fact that it a) is still difficult for many people to withdraw Bitcoin for fiat b) is cheaper/safer to hold Bitcoin than convert to USD and pay taxes/face charges c) goes against core sentiments of Bitcoin to trade it back for fiat- it's really a no brainer why the market keeps soaring. The question becomes how long this will last and wants the train runs out of steam, how hard will everything fall?"
        ],
        "upvotes": [
            15,
            1
        ]
    },
    "XDN": {
        "full_name": "DigitalNote",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XEL": {
        "full_name": "Elastic",
        "mentioned_ids": [
            "dmbhytn"
        ],
        "mentioned_times": [
            1504105704.0
        ],
        "text": [
            "XEL > Golem.\n\nPlease research about it. "
        ],
        "upvotes": [
            1
        ]
    },
    "XEM": {
        "full_name": "NewEconomyMovement",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XLM": {
        "full_name": "Lumen",
        "mentioned_ids": [
            "dmbhg23"
        ],
        "mentioned_times": [
            1504104456.0
        ],
        "text": [
            "Got in on Stellar Lumens (XLM), since my very talented coder friend (who's already created two products in the millions of $ range) is hoarding it. If he's doing it, no way I'm missing out. It is also very cheap."
        ],
        "upvotes": [
            1
        ]
    },
    "XMG": {
        "full_name": "Magi",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XMR": {
        "full_name": "Monero",
        "mentioned_ids": [
            "dmadbu2",
            "dmajbtp",
            "dmatex3",
            "dmaia6z",
            "dmaz0aw",
            "dmaw3vq",
            "dmaprg0",
            "6wtas4",
            "dmb7ep9",
            "dma6wht",
            "dmaj3j1",
            "dmbeot8",
            "dmbdu7f",
            "dmbfqig",
            "dmbg14v",
            "dmb4efj",
            "dmadnos",
            "dmah06b",
            "dmbddcr",
            "dmbfzsd",
            "dmaoe4a",
            "dmakgl9"
        ],
        "mentioned_times": [
            1504053688.0,
            1504059872.0,
            1504070567.0,
            1504058791.0,
            1504077196.0,
            1504073669.0,
            1504066607.0,
            1504061073.0,
            1504087809.0,
            1504046762.0,
            1504059637.0,
            1504098661.0,
            1504097128.0,
            1504100705.0,
            1504101321.0,
            1504084031.0,
            1504054029.0,
            1504057466.0,
            1504096330.0,
            1504101242.0,
            1504065176.0,
            1504061050.0
        ],
        "text": [
            "I dont know about you all but I wouldn't care how many forks there are if bitcoin was 40k and XMR was 1k.",
            "Found the guy who trolls the Monero boards...",
            "Monero would be much more than $988 ",
            "Yes Ripple doesnt fork cause it has a well manered central organization behind it, that is top-notch and works like a fortune 500 company.  \nMonero doesnt fork cause it has a hardfork every six months and they manage well.  \nDash doesnt fork cause they have a really good democratic way of making decisions.  \n\nAll the rest can go fork them self. ",
            "$988 for 1 XMR...not bad. I would think it would be far higher than that, if BTC really was $40K. I'd say XMR would be closer to $3000.",
            "XMR will reach $1k per coin before december 31st 2018. Just watch.",
            "Can anyone guess which coins besides Bitcoin is going to do well? My bet, Monero",
            "You Can Now Buy the Privacy-Focused Cryptocurrency Monero Offline With Cash",
            "Alex from LocalMonero here. I was the one Vice interviewed. I would say Vice did a good job overall, but I'm a bit disappointed they didn't include this classic copypasta I gave them on how Monero's isn't only useful for criminal activities:\n> \n> 1. You are traveling through parts of a country with a medium to high violent crime rate. You need to use some of your Bitcoin to pay for something. If every person you transact with knows exactly how much money you have, this is a threat to your personal physical safety.\n> 2. You are a business that receives a payment from a supplier. That supplier will be able to see how much money your business has, and therefore can guess at how price sensitive you are in future negotiations. They can see every single other payment you’ve ever received to that Bitcoin address, and therefore determine what other suppliers you are dealing with and how much you are paying those suppliers. They may be able to roughly determine how many customers you have and how much you charge your customers. This is commercially sensitive information that damages your negotiating position enough to cause you relative financial loss.\n> 3.  You are a private citizen paying for online goods and services. You are aware that it is common practice for companies to attempt to use ‘price discrimination’ algorithms to attempt to determine the highest prices they can offer future services to you at, and you would prefer they do not have the information advantage of knowing how much you spend and where you spend it.\n> 4. You sell cupcakes and receive Bitcoin as payment. It turns out that someone who owned that Bitcoin before you was involved in criminal activity. Now you are worried that you have become a suspect in a criminal case, because the movement of funds to you is a matter of public record. You are also worried that certain Bitcoins that you thought you owned will be considered ‘tainted’ and that others will refuse to accept them as payment.",
            "I almost think some folks are too personally attached to a virtual asset to discuss and improve on its shortcomings which will lead to its eventual downfall. That, and the fact that most people outside the community don't know how cryptocurrencies (technically not even correct anymore as they have evolved into much more than just currency) work and only associate it with Bitcoin because it's been around for the longest. As cryptos gain popularity, Bitcoin will continue to grow until upon reaching a critical mass it will come crashing down and be replaced by a new standard. Imagine how unlikely it would be for a first of its kind technology to prevail after thousands of attemps to create something that is better for a certain applications (e.g. Monero for anonymous transactions, Doge for micropayments) or just strictly better as a whole (literally anything else). I'm just riding the wave until it's calmed; it's going to take a while.",
            "Funny how what we call BTC today diverged more than BCH from \"the original\". BTC introduced a whole new TX format, and BCH only changed one parameter. What's closer to \"vanilla Bitcoin\"? If you want exposure to SegWitCoin I don't see the point of holding BTC and LTC. Pick just one, IMO. I hold none. Only XMR & BCH now.",
            "* DNT - Solid team. Very low current marketcap.\n\n* XMR (Monero) - Privacy is king.\n\n* IOTA - First Tangle-based currency.",
            "XMR will reach marketcap parity with bitcoin soon, like a year or two at most. If that happens, which it will, XMR is the sleeper of all sleeper coins. ",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess. \n\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "* QRL - Different cryptopgraphy solution than IOTA, NEO, ETH(Metropolis); Mainnet launching on October.\n\n* BLOCK - Small supply; low price; mainnet launching September 1st (afaik)\n\n* XMR - Has yet to reach it's full potential. Privacy is everything.",
            "-ETC. IMO, there are better alternatives to Ethereum based solely on tech/dev team (I.e., not highly adopted by any means). ETC didn't gain the mass adoption in time for it to continue to compete.\n\n-95% of Dapps in general (your guess is as good as mine on that one). Blockchain is revolutionary, no doubt about it, but Walmart and McDonalds didn't start with a $10,000,000 valuation...\n\n-XRP. It's a great idea, but I think big banks will be the first to find a way to centralize a blockchain so that they do not have to work with any outside entities.\n\n-XMR. Great idea for crypto privacy, but given recent gov attention, restrictions will be put in place to squash the speculation on it far before it reaches BTC levels.\n\nThat's my two cents. Could be completely wrong, but I'll let you know that I have avoided putting any money in these because the market reacts pretty damn fast to bad news.",
            "BTC, OMG, FUN the only places I'd hold. Maybe FCT as well. Not sure why you would hold currencies (XMR, BCH) as their intention is to be spent and thus likely to not give great returns - don't use the recent coin pumps as examples.\n\nIt is likely that prediction markets and dividend paying cryptos will soon be illegal under new legislation. That rules out Augur and Etheroll. Don't know much about the others to comment, hope this helped you though. You're in far too many useless coins in my opinion (sorry if overly harsh)\n\nedit: Yep, as usual Reddit produces the goods - downvote me while BTC and OMG surge to new highs and FUN holds its ground, while most other alts are tanking. I've actually provided OP a substantial argument as to why these are good buys, but continue saying how good an investment litecoin, BCC, NEO etc. are.",
            "You are missing ARK and DNT and I think you are gambling with Monero and BCH. ",
            "Just because a coin has a low marketcap, or low price, doesn't mean you should invest in it rather than those with larger prices and larger marketcaps. Don't be silly, just do actual research and learn for yourself which cryptos offer the most usefuless and usability to people in real life. The answer is Monero. \n\ngo 100% monero, or 75% monero 25% BTC if you want to be more conservative. ",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess.\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "Iota, factom, monero but essentially your guess is as good as mine.",
            "Monero"
        ],
        "upvotes": [
            85,
            7,
            6,
            3,
            4,
            2,
            11,
            114,
            30,
            3,
            1,
            18,
            9,
            1,
            1,
            2,
            0,
            -2,
            1,
            1,
            5,
            4
        ]
    },
    "XMY": {
        "full_name": "Myriad",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XRP": {
        "full_name": "Ripple",
        "mentioned_ids": [
            "dmadj9k",
            "dmaia6z",
            "dmadxkk",
            "dmbditk",
            "dmap3ix",
            "dmb0y4x",
            "dmb1mn0",
            "dmasod1",
            "dmbfnnl",
            "dmbhk4s",
            "dmaggyq",
            "dmb3uwu",
            "dmb65l1",
            "dmb4efj",
            "dma314p"
        ],
        "mentioned_times": [
            1504053902.0,
            1504058791.0,
            1504054309.0,
            1504096583.0,
            1504065912.0,
            1504079685.0,
            1504080546.0,
            1504069743.0,
            1504100545.0,
            1504104728.0,
            1504056917.0,
            1504083356.0,
            1504086234.0,
            1504084031.0,
            1504042088.0
        ],
        "text": [
            "Ripple only being $2.15 by 2025 is indeed a nightmare scenario.",
            "Yes Ripple doesnt fork cause it has a well manered central organization behind it, that is top-notch and works like a fortune 500 company.  \nMonero doesnt fork cause it has a hardfork every six months and they manage well.  \nDash doesnt fork cause they have a really good democratic way of making decisions.  \n\nAll the rest can go fork them self. ",
            "Ripple circulating supply would be much higher",
            "This fuckin chart, is fantastic! It also made me feel like a bit of a loser cause I got every single joke on their(ripple really got me).....then I read the comments and now I don't feel so alone",
            "XRP TO THA MOON!",
            "Ripple: Old, but gold. 😂",
            "Ripple $2.15 lol",
            "Why is ripple still around?",
            "Decred (DCR). Open structure within the organization that will allow for a lot of innovation. Experienced team.\n\nAlso, not a sleeper, but XRP. Has the potential for speed that banks will adopt.",
            "FCT. I think it's value will be realised in almost direct correlation with the value of blockchain itself being realised by the world. Very, very strong fundamentals that the masses will understand much better only as they understand blockchain itself better.\n\nXRP. Can also see it becoming the industry standard for privacy (a huge concern) and also surviving any future crypto crashes/wipeouts. Sleeper still, despite it's recent rise.\n\nVTC. Strong community, devoted developers and loads of room to grow, especially with lightning network & atomic swapping in development.",
            "I think that there are a lot of parallels for what a crash would look like, but there are some important differences. During the .com crash there was a broad sector decline in value. Every tech company took a walloping and those that weren't profitable or which had fundamentally unsound business models were wiped out completely. Similarly, a crypto crash will likely see sharp declines across the board for all coins. The super dubious, craptastic recent ICOs will almost certainly disappear forever. Coins and tokens with no differentiating technical or business features will go for sure. However, I don't think the carnage will stop there. Most of the crypto products that are *very* similar to existing products will see their values plunge to next-to-worthless levels and they will likely never recover. This is where the similarities end.   \nThere is no direct comparison between \"business model\" and a crypto currency. However, there is a similar concept and that is market adoption and the technical infrastructure that goes with a coin. In this context, the survivors are already starting to emerge. They are bitcoin, ethereum, ripple and perhaps 3 or 4 others (not sure about litecoin, I personally feel it's too similar to bitcoin and doesn't have the ecosystem, but it's on the border).",
            "Ripple\n\nCentralized coin",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "-ETC. IMO, there are better alternatives to Ethereum based solely on tech/dev team (I.e., not highly adopted by any means). ETC didn't gain the mass adoption in time for it to continue to compete.\n\n-95% of Dapps in general (your guess is as good as mine on that one). Blockchain is revolutionary, no doubt about it, but Walmart and McDonalds didn't start with a $10,000,000 valuation...\n\n-XRP. It's a great idea, but I think big banks will be the first to find a way to centralize a blockchain so that they do not have to work with any outside entities.\n\n-XMR. Great idea for crypto privacy, but given recent gov attention, restrictions will be put in place to squash the speculation on it far before it reaches BTC levels.\n\nThat's my two cents. Could be completely wrong, but I'll let you know that I have avoided putting any money in these because the market reacts pretty damn fast to bad news.",
            "Looks good. probably put your ripple into ETH.   \nThe rest is solid. Adex still speculative, pretty high risk."
        ],
        "upvotes": [
            19,
            3,
            4,
            2,
            1,
            1,
            1,
            -1,
            2,
            1,
            1,
            48,
            23,
            2,
            1
        ]
    },
    "XST": {
        "full_name": "StealthCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVC": {
        "full_name": "Vcash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVG": {
        "full_name": "Verge",
        "mentioned_ids": [
            "dmax8jr",
            "dmbbd46",
            "dmbber2"
        ],
        "mentioned_times": [
            1504075005.0,
            1504093184.0,
            1504093249.0
        ],
        "text": [
            "You're right. If this were real, verge would be top 10 for sure ;)",
            "XVG VERGE",
            "Verge because it's a garbage coin that brings nothing to the table and falsely calls themselves private.  They have no ledger privacy and on top of that, they disregarded actual privacy for a stupid reason"
        ],
        "upvotes": [
            1,
            -4,
            5
        ]
    },
    "XWC": {
        "full_name": "WhiteCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XZC": {
        "full_name": "ZCoin",
        "mentioned_ids": [
            "dmbgxiv"
        ],
        "mentioned_times": [
            1504103272.0
        ],
        "text": [
            "ZCoin (XZC). Private, ASIC-resistant, and undervalued.  "
        ],
        "upvotes": [
            1
        ]
    },
    "ZCL": {
        "full_name": "Zclassic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ZEC": {
        "full_name": "Zcash",
        "mentioned_ids": [
            "dmbfqig",
            "dmb65l1",
            "dmb7ryu",
            "dmbfzsd",
            "6wr9hl"
        ],
        "mentioned_times": [
            1504100705.0,
            1504086234.0,
            1504088279.0,
            1504101242.0,
            1504042653.0
        ],
        "text": [
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess. \n\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "BCH - Even though I like the concept there is no way it can topple BTC, since it's so much more widely known and cemented.\n\nXRP - No development activity, ETH has more banks on board, tokens are close to worthless\n\nLTC - Glorified BTC clone. Could be easily replaced by ETH, Dash, etc.\n\nETC - Dead, ETH is better in every imaginable way\n\nBCC - Obvious scamcoin\n\nZEC - Obsolete by zk-SNARKS on Eth",
            "Let me take a risky jab at some popular ones. Hold off on the downvote and challenge my statements.\n\nIOTA - For the use they described (robots paying eachother), any reasonably large company would create their own Tangle network. Also, correct me if I'm wrong but if they take manual snapshots of the network to decrease Tangle size, that makes it centralized?\n\nBCH - Has nothing on Litecoin. Slower transaction times, higher transaction fees... Isn't even Bitcoin, it's a fork. Useless.\n\nDash - Has nothing to offer besides quick transaction times. That's great and all, but we're seeing other coins pick up on that (LTC, IOTA, NEO(?))\n\nThere's a lot of other obvious failures (Zcash, ETC, QTUM) but I won't go into them because they're obvious. Feel free to challenge me on anything I've said though!",
            "These days I don't have many small-cap coins in my portfolio but one that I am liking is Spectre (XSPEC). Monero & Dash are my two biggest non-bitcoin holdings, and looking for more privacy-focused coins led me to XSPEC. The main reason I like this project is its implementation of Tor & obsf4. Users in countries that are cracking down on Tor usage can still access the Spectre network. While it is a never ending game of cat & mouse, the new developers that have joined the Spectre project have really proven their technical prowess.\nI don't expect Spectre to dethrone Monero, Dash or Zcash as the big 3 of privacy coins, but it is rather well developed and offers an alternative pathway. It is starting to pick up some momentum these days, but with its current market cap of ~$15m it is relatively unknown and qualifies as a sleeper IMHO. Considering it pretty much only trades on cryptopia, it is surprising to see it do between 20-100btc in daily volume. Anyways, that's my .02. Any thoughts on Spectre (XSPEC)?",
            "Bitcoin Meets Zcash: Developers Test Tool for Trustless Trades"
        ],
        "upvotes": [
            1,
            23,
            16,
            1,
            8
        ]
    },
    "ZEN": {
        "full_name": "Zencash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "submissions": [
        "6ws85z",
        "6wsxpp",
        "6wtx86",
        "6wwac8",
        "6wtpac",
        "6wtas4",
        "6wqao8",
        "6wudoe",
        "6wtja2",
        "6wu7m3",
        "6wq9l4",
        "6wswuz",
        "6wqjwy",
        "6wrcr4",
        "6wv9qa",
        "6wrxrl",
        "6wpzp4",
        "6wsn31",
        "6wuc3m",
        "6wsgii",
        "6wwl3h",
        "6wpycs",
        "6wwasj",
        "6wrbf3",
        "6wr2jb",
        "6wvn2r",
        "6wu00c",
        "6wuqqq",
        "6wtdom",
        "6wrmqw",
        "6wqa0i",
        "6wrgru",
        "6wq9hj",
        "6wuzl1",
        "6wusi6",
        "6wtdvx",
        "6wwb2c",
        "6ww52q",
        "6wtq4i",
        "6wt8gf",
        "6wu2ce",
        "6wsilj",
        "6wtclo",
        "6ws5yy",
        "6wqqae",
        "6wur56",
        "6wsxhs",
        "6wsogc",
        "6wrgb0",
        "6wvrjq",
        "6wvcen",
        "6wr2vh",
        "6wq991",
        "6wq0m1",
        "6wpv99",
        "6wvdiy",
        "6wv290",
        "6wtrmf",
        "6ws0f4",
        "6wspxb",
        "6wr9hl",
        "6wr907",
        "6wuisz",
        "6wu178",
        "6wtvlf",
        "6wtl3c",
        "6wta28",
        "6wt4ji",
        "6wrs5r",
        "6wrll0",
        "6wq57s",
        "6wxckt",
        "6wwhad",
        "6wvl11",
        "6wuzqu",
        "6wu97d",
        "6wtgtl",
        "6wtbla",
        "6wt2zx",
        "6wt0lt",
        "6wso9e",
        "6wsdyf",
        "6wrmwh",
        "6wrg36",
        "6wreyi",
        "6wr594",
        "6wq19g",
        "6wpoo1",
        "6wx3u6",
        "6wuwcf",
        "6wuild",
        "6wt8z6",
        "6wsnji",
        "6ws3z7",
        "6wrtuw",
        "6wrgif",
        "6wreuc",
        "6wrcu5",
        "6wrbp0",
        "6wra4d"
    ]
}