{
    "1ST": {
        "full_name": "FirstBlood",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "2GIVE": {
        "full_name": "2GIVE",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ABY": {
        "full_name": "ArtByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADT": {
        "full_name": "adToken",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADX": {
        "full_name": "AdEx",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AEON": {
        "full_name": "Aeon",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AGRS": {
        "full_name": "IDNI Agoras",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AMP": {
        "full_name": "AMP",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ANT": {
        "full_name": "Aragon",
        "mentioned_ids": [
            "dm8mhi1",
            "dm8yzkf",
            "dm8lc9w"
        ],
        "mentioned_times": [
            1503965018.0,
            1503978349.0,
            1503963748.0
        ],
        "text": [
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "District0x is built on top of Aragon."
        ],
        "upvotes": [
            12,
            3,
            2
        ]
    },
    "APX": {
        "full_name": "Apx",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ARDR": {
        "full_name": "Ardor",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ARK": {
        "full_name": "Ark",
        "mentioned_ids": [
            "dm86pie",
            "6wi3h8",
            "dm8gtfe",
            "dm8dspq",
            "dm8cqfh",
            "dm8j1h7",
            "dm8j0lt",
            "dm8s6z9",
            "6wio8k",
            "dm8cg1c",
            "dm8cqup",
            "dm8ltjg",
            "6wjbxj",
            "dm8mh03",
            "dm8gc4i",
            "dm8hisn",
            "dm8jduw",
            "dm8mhi1",
            "dm8sl8r",
            "dm8jhk4",
            "dm8glt7",
            "dm8jsqo",
            "dm8x036",
            "dm8fqfl",
            "dm8nssr",
            "dm8ldvh",
            "dm8tr75",
            "dm8zwcp",
            "dm90x5e",
            "dm8xbnt",
            "dm93qqh",
            "dm91kjs",
            "dm9e0f7"
        ],
        "mentioned_times": [
            1503937381.0,
            1503937508.0,
            1503958524.0,
            1503954337.0,
            1503952543.0,
            1503961193.0,
            1503961166.0,
            1503971071.0,
            1503946851.0,
            1503952021.0,
            1503952565.0,
            1503964298.0,
            1503955155.0,
            1503965003.0,
            1503957910.0,
            1503959402.0,
            1503961595.0,
            1503965018.0,
            1503971495.0,
            1503961710.0,
            1503958276.0,
            1503962044.0,
            1503976239.0,
            1503957118.0,
            1503966444.0,
            1503963797.0,
            1503972744.0,
            1503979311.0,
            1503980410.0,
            1503976584.0,
            1503983455.0,
            1503981108.0,
            1503995907.0
        ],
        "text": [
            "ARK , do not believed me until you research it. \nand try their wallet",
            "ARK News and Potential",
            "ARK, NEO, OMISEGO, FACTOM\n\nThe holy quadrinity. ",
            "Neo - Ark my babies.",
            "I'm big on ark as well. As it's been going up recently I've been putting in more and more. ",
            "People say Ark is a fork of lisk but let me get the facts straight for you.\n\nLisk was a fork of Crypti. \nThe people developing Ark made Crypti.\n\n\n\n",
            "ARK & LISK - The holy grail.",
            "Ark is still not on the ledger right? This site mentions the end of july but can't find it on ledger's site:\n\n[Ark-Ledger](http://bitcoinprbuzz.com/press-release-ark-ledger-hardware-wallet/)\n\nEDIT: Allright, ledger's roadmap says ark will come the fourth of september: [Ledger Roadmap](https://trello.com/b/5nQ1mdzt/ledger-roadmap\n)",
            "Ark now in Coinspot Australia.",
            "Awesome. Nice jump yesterday too.\n\nAgain, FCT and ARK !",
            "Ark is gonna moon soon ",
            "Looks like ARK may be added to Ledger as early as next week as well https://trello.com/b/5nQ1mdzt/ledger-roadmap",
            "I am planning to invest in ARK, DNT, and OMG. Please provide me with arguments why I shouldn't.",
            "I own OMG and don’t own Ark or DNT. So if you’re planning on investing, just avoid OMG and get Ark and DNT. ",
            "Ark is great and will be a good investment. Dnt is a bit weird and doesn't look like a sleeping giant right now but is at its cheapest so I doubt you will lose money. Omg is great too but just got a huge spike so I would suggest waiting for it to calm down a bit",
            "Great picks. Ark is going to moon soon, and OMG although already had huge growth so far, is holding steady rn is still very undervalued. DNT is super cheap rn and they are a great project to get in now. This being said, you should look into ZRX as well. Good longer-term hodl as well as I predicting it mooning within the next week(s). ",
            "As a newcomer what makes you think Ark has good long-term potential? Is it because you read that on here? We're all invested and trying to keep the price rising for big gainz, everything we say is going to be positive. It's a vicious cycle. Most of us are like you: we don't know how much money Ark will be making in a year, if any.\n\nIf you're looking to buy and hodl how would you describe this investment to a family member? Right now you're telling them, \"I read it on Reddit and it must be true\".\n\nIf you're looking to ride the bubble with us come on in and have some fun. Prices have been rocketing with every whisper of a website update. Don't spend any money you aren't prepared to lose, and expect your family members to think you're crazy, because all of us might be.",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "Disclaimer I own ARK and DNT and has done quite a bit of reasearch on them.\n\nI believe ARK to be the most secure one. If you are planning on holding an asset for more than a year and not touching it, this would be my choice. It is a solid team with a solid roadmap and a lot of ideas (maybe too many). Argument for not investing in ARK is that it has just risen 25% today, so might not be the best timing, and it has risen 22.407% since its ICO, so you are quite late to the party. However, I still believe it has great potential, but don't expect it to 10x in 3 months. \n\nDNT is the more riskier higher reward choice. It had bullrun of 7x in a week or two and the dropped 50% without any news. The bullrun might have placed its value too high, but I believe the recent bear market for DNT has been a bit too extreme. If you are ever going to enter DNT, now might be a good time. A lot of the people trading DNT are waiting for Bittrex decision on whether DNT is a security or not.  This decision will probably decide if the price explodes or drops, so DNT has great potential but also larger short term risk. This is also seen from its way lower market cap than ARK and OMG.",
            "Ark is great but literally mid pump as we speak, wait for it to drop. DNT is the opposite, super cheap and still waiting to be listed on Bittrex. I would buy now. OMG has been fairly stable at current pricepoint so I'd say now it a good time to get into it.",
            "not possible to say anything wrong about ARK, its all good.. even the early mistakes.",
            "I just bought a little bit of DNT, it seems like it could grow a nice amount. I've been wanting to get into ARK and OMG for a while now. Waiting for some fiat to come. And it seems like ARK is in a pump now so maybe it'll go down a bit.",
            "ARK is undervalued. Going to rise very soon. Allmost doubled in a few weeks and will go very high very soon. Best wallet Youll see and the voting and delegate system work great. Youll get a 5%-7% interest Every year. And its Paid daily! Youll get Free Ark Every day!",
            "Ive nothing bad to say about Ark and OmiseGo, and havent researched DNT. Also interested to hear if others can offer critiques of ARK and OMG.",
            "If you've been reading up on them you should know the risks.  I'd say the least risky is OMG, with DNT being (currently) the biggest risk.  I personally don't like ARK - but I didn't read their whitepaper thoroughly so I'm prepared to be wrong.  As far as I could tell it only rewards the top 51 holders, as only the top 51 get to forge ARK.  This means the devs and their friends and family are perhaps the only beneficiaries.  I gave up the moment I read that.  It's as bad as the 20% kickback that ZCash devs get.  \n\nSaying that, look at ZCash - the extremely controversial kickback to devs hasn't stopped that coin has it?  So ARK could be amazing.  However, I feel that for actual spending coins XMR and IOTA have pretty much got things covered.\n\nIt's your money, don't listen to me or anyone else.  The markets go against everything I think one day and the next everything goes as I thought.  Truth is almost every coin is going up overall.  You could literally invest with a blindfold on, go away for six months and you'll almost certainly have much more than you originally invested.\n\nOr you can sit there and stress all day, constantly checking how much each has gone up or down.  Wishing you'd put everything into Crown (old coin set to rise) instead.  Then feel depressed, and wake up one day having all but given up on your investment, only to click in and see that one of your investments has gone from 0.000050  to 0.154345  overnight - and you've got 50,000 of them, the other has gone from .0064234  to .0843454 - suddenly the world lights up for you.\n",
            "Some ARK delegates pay close to 10%",
            "POS coins don't require a masternode, smaller amounts work too, however in POS your wallets needs to be on, so there is an electricity cost associated.\n\nAlso don't get confused by dividends. In all POS coins, the supply grows at the same rate as the reward, meaning that receiving that reward does not actually increase the value of your stack. It is profitable because not all people are staking their coins.\n\nIn ark for example the total supply grows by a little less than 5% a year. Because not everyone votes (the devs don't, and the bounty reserve does not and because some people store the ark on exchanges), which means that you receive about 10% a year, meaning you earn 5% a year. Always subtract inflation.\n\nFor example in the Netherlands right now, interest is at 0.1%, meaning you effectively lose 2% of your money if you keep it in a bank.",
            "Ethereum, salty because I bought at 10 sold at 40\n\nArk/OMG/DNT because they're all such obvious pump and dumps. You guys can allllll deny it but the subreddit felt the exact same way about 3 different cryptos a month ago, and no one talks about them now... Don't believe me? Wayback machine is your friend.\n\nNeo, bought at 7 sold at like 40? It's a pump and dump though\n\nI mean tbh they're all pump and dumps that's why we're here lol",
            "Long-term: Ark, Factom, OMG, Monero, BTC and NEO are all solid long-term projects.   ",
            "ARK, ZRX, OMG, NEO, PAY, LSK",
            "I'd say OMG, ARK, XMR and IOTA are all solid choices. Worth diversifying yourself between some large cap and small cap coins.",
            "I looked into it recently and I was happy with what I found so now Im board. Agree that is has a lot of potential. It was good to read about their tumultuous history that you describe in your steemit article, and its interesting that the team switched from a Lisk codebase to an ARK codebase which they considered to be more advanced. Thanks.",
            "I have both, more excited about Ark but Lisk is also a good project!"
        ],
        "upvotes": [
            15,
            87,
            26,
            21,
            17,
            13,
            9,
            3,
            77,
            16,
            15,
            6,
            53,
            61,
            28,
            29,
            19,
            12,
            8,
            6,
            6,
            4,
            4,
            1,
            1,
            7,
            1,
            -1,
            6,
            1,
            1,
            1,
            1
        ]
    },
    "AUR": {
        "full_name": "AuroraCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BAT": {
        "full_name": "Basic Attention Token",
        "mentioned_ids": [
            "dm8obrf",
            "dm992kc",
            "dm8yzkf",
            "dm8ijw0"
        ],
        "mentioned_times": [
            1503967009.0,
            1503989671.0,
            1503978349.0,
            1503960627.0
        ],
        "text": [
            "Great post, I'm curious about your thoughts on BAT?  It seems to fit the criteria for a promising investment.",
            "XRP because that thing is either for banks, and random users shouldnt even have an option buying it, or its for everyone to use in which case its pointless because no one actually uses it for anything.\n\nXMR because I have no idea why. I guess I always felt XMR is hard to scale and its just a proof of concept for some future privacy coin that will take the space. I guess I failed there.\n\nBAT and others in the space, because users wont change their browsers to watch ads. Its insanely hard and competitive space dominated by giants, and having a crypto token in the mix is actually a detriment to the nearly pointless effort. Its a cool idea, I just dont see it working in the real world.\n\nMCO, PAY - love the cards, tokens are stupid.\n\nAnd plenty more. Pretty much any coin/token promising perfectly bright future and butterflies, but with no working and actually used product.",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "BAT- drop by the sub to check it out. 3-4 active community leaders providing technical rebuttals to fud and very non evasive. "
        ],
        "upvotes": [
            6,
            2,
            3,
            3
        ]
    },
    "BAY": {
        "full_name": "BitBay",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BCC": {
        "full_name": "Bitcoin Cash",
        "mentioned_ids": [
            "dm8pmns"
        ],
        "mentioned_times": [
            1503968390.0
        ],
        "text": [
            "The reason litecoin has increased is due to a battle between bitcoin (BTC) and bitcoin cash (BCH).  BCH instituted a difficulty adjustment making BCH much more profitable to mine than BTC.  Miners flipped chains (BCH actually had more hash rate than BTC for awhile) but flipped back at the next adjustment.  This lead to a wild oscillation of miners flipping between chains every difficulty adjustment.  This caused the rate of blocks mined to vary tremendously (even for BTC) and transactions piled up.  This uncertainty caused people to invest in litecoin.  Litecoin is very similar to bitcoin but uses a different hash function (so miners can't flip).    "
        ],
        "upvotes": [
            4
        ]
    },
    "BCY": {
        "full_name": "BitCrystals",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BITB": {
        "full_name": "BitBean",
        "mentioned_ids": [
            "dm8yzp5"
        ],
        "mentioned_times": [
            1503978353.0
        ],
        "text": [
            "Decred. Roughly 30% interest a year right now. Won't be this good forever though. Minimum buy-in is around 60 DCR right now.\n\nOh, and there's also bitbean if you REALLY want to stake ; )"
        ],
        "upvotes": [
            2
        ]
    },
    "BLITZ": {
        "full_name": "Blitzcash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BLK": {
        "full_name": "BlackCoin",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "BLOCK": {
        "full_name": "BlockNet",
        "mentioned_ids": [
            "dm8mhi1",
            "dm96tkh",
            "dm94coy",
            "dm92xhz"
        ],
        "mentioned_times": [
            1503965018.0,
            1503986949.0,
            1503984134.0,
            1503982560.0
        ],
        "text": [
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "I feel there should be two bell curves overlaying each other, tje first is CPU miners (back when you could use a CPU and stand a chance of earning a block), GPU miners, pool miners, ASIC miners and the mega pools. \n\nAround the GPU and pool minners the start of the early adopters bell curve should start and I believe we are still in that stage, I think we are away off early majority.\n\nMaybe when my grandfather starts asking more questions about the various cryptos I am using the we might be on early majority\n",
            "I am not invested in DNT, even though it is very hip right now, because I don't understand what it's supposed to do and nobody seems to be able to explain it, not even the company behind it. They use a lot of buzzwords, which they made up to explain other buzzwords, which they made up. It's all about \"districts\", but what the fuck is a \"district\" really? Apparently it's an autonomous smart-chain contract block solution for distributed independent ledger technologies in a secure smart-space environment. Or something.\n\nI am getting really tired of companies hiding behind buzzwords instead of explaining to people why they need something which they didn't know they needed. That's what Apple does so well and what is sorely lacking in the crypto community. Not everyone is a hyper-optimistic computer scientist.\n\nActually, I think I am going to focus more on coins that don't try to be anything other than a currency from here on out, as I just don't understand the need for all that other stuff. (Not saying it ain't there, but if you can't explain it to me, you're failing)",
            "The way I understand it (and I could be completely wrong, if so someone please correct me)\n\nWhen a miner is contributing to a blockchain network they are essentially exchanging some value for transaction fee while performing tasks. They are incentivized to validate accurately in both scenarios in two different ways.\n\nIn PoW, they miners are providing a certain amount of real world value (the resources needed to run their mining machines) in exchange for transaction fees. If the miner does not provide an accurate block, they essentially forfeit the fees thus leaving them in a net negative (as they used the resources to run their mining machines with no return).\n\nIn PoS, the miner is again providing a certain amount of real world value (in this case the real world value is the value of the coins staked) in exchange for transaction fees. Again, if the minor does not provide an accurate block, they still forfeit the transaction fees. On top of that, in PoS they also forfeit their staked tokens (in the same way the resources consumed to generate an inaccurate block in a PoW scenario would be lost).\n\nBoth provide a certain amount of up front value by the minor that is lost when not being truthful. However, in a PoW scenario, we are essentially burning real world value (resources needed to run the mining computations) as a way for the miner to have to provide a unit of value up front to risk when validating. These resources are consumed REGARDLESS of whether the miner is being truthful, which makes a PoW consensus not very efficient (in terms of real world resources needed to run it). In a PoS model, the value ‘staked’ is digital value (ethereum) which means that we don’t need large amounts of real world resources consistently burning just to provide the minors with a mechanism for risking value (the risking value is the key piece that incentives truthful consensus).\n\nThe thing is that in a PoS scenario you need to ensure that a) you have a significant distribution of tokens and b) the tokens have a significant and fairly stable value. This is why ethereum has started in PoW (to spread the tokens and establish stability) at which point they can switch to PoS."
        ],
        "upvotes": [
            12,
            3,
            2,
            2
        ]
    },
    "BNT": {
        "full_name": "Bancor",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BRK": {
        "full_name": "Breakout",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BRX": {
        "full_name": "Breakout Stake",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BSD": {
        "full_name": "BitSend",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTA": {
        "full_name": "Bata",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "BTCD": {
        "full_name": "BitcoinDark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTS": {
        "full_name": "BitShares",
        "mentioned_ids": [
            "dm8fvaq",
            "dm8mhi1",
            "dm8yqn7",
            "dm94nys"
        ],
        "mentioned_times": [
            1503957298.0,
            1503965018.0,
            1503978087.0,
            1503984470.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "it's on chain token platform.... nxt and bts and xcp had this natively in what 2013-2014?\n\nwhy is almost all work on eth about 4 years behind? no wonder they have trouble understanding basic concepts in crypto.",
            "Can you tell me what's good about Rocket? I see it's proudly boasting of having teammembers involved in Steem & Bitshares, which is quite worrying."
        ],
        "upvotes": [
            2,
            12,
            0,
            3
        ]
    },
    "BURST": {
        "full_name": "BURSTCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BYC": {
        "full_name": "Bytecent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CANN": {
        "full_name": "CannabisCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CFI": {
        "full_name": "Cofound.it",
        "mentioned_ids": [
            "dm8uw9e"
        ],
        "mentioned_times": [
            1503973970.0
        ],
        "text": [
            "First off, you don't need caps to get attention. Second, similar projects already exist, for example Cofound.it."
        ],
        "upvotes": [
            7
        ]
    },
    "CLAM": {
        "full_name": "CLAMs",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLOAK": {
        "full_name": "CloakCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLUB": {
        "full_name": "ClubCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "COVAL": {
        "full_name": "Circuits of Value",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CPC": {
        "full_name": "CapriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRB": {
        "full_name": "CreditBit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRW": {
        "full_name": "Crown",
        "mentioned_ids": [
            "dm8nssr",
            "dm920s7"
        ],
        "mentioned_times": [
            1503966444.0,
            1503981583.0
        ],
        "text": [
            "If you've been reading up on them you should know the risks.  I'd say the least risky is OMG, with DNT being (currently) the biggest risk.  I personally don't like ARK - but I didn't read their whitepaper thoroughly so I'm prepared to be wrong.  As far as I could tell it only rewards the top 51 holders, as only the top 51 get to forge ARK.  This means the devs and their friends and family are perhaps the only beneficiaries.  I gave up the moment I read that.  It's as bad as the 20% kickback that ZCash devs get.  \n\nSaying that, look at ZCash - the extremely controversial kickback to devs hasn't stopped that coin has it?  So ARK could be amazing.  However, I feel that for actual spending coins XMR and IOTA have pretty much got things covered.\n\nIt's your money, don't listen to me or anyone else.  The markets go against everything I think one day and the next everything goes as I thought.  Truth is almost every coin is going up overall.  You could literally invest with a blindfold on, go away for six months and you'll almost certainly have much more than you originally invested.\n\nOr you can sit there and stress all day, constantly checking how much each has gone up or down.  Wishing you'd put everything into Crown (old coin set to rise) instead.  Then feel depressed, and wake up one day having all but given up on your investment, only to click in and see that one of your investments has gone from 0.000050  to 0.154345  overnight - and you've got 50,000 of them, the other has gone from .0064234  to .0843454 - suddenly the world lights up for you.\n",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1,
            1
        ]
    },
    "CURE": {
        "full_name": "CureCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CVC": {
        "full_name": "Civic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DAR": {
        "full_name": "Darcrus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DASH": {
        "full_name": "Dash",
        "mentioned_ids": [
            "dm8dw1a",
            "dm8fvaq",
            "dm8nouk",
            "dm8cy7q"
        ],
        "mentioned_times": [
            1503954484.0,
            1503957298.0,
            1503966325.0,
            1503952927.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "A straight copy of Dash with a couple feature promises. ",
            "You just described Dash Evolution. All those things are planned to be in Dash evolution. However, rolling out all these features is going to be incremental. Starting with usernames, ending with interest bearing accounts.  "
        ],
        "upvotes": [
            102,
            2,
            3,
            2
        ]
    },
    "DCR": {
        "full_name": "Decred",
        "mentioned_ids": [
            "dm8yzp5",
            "dm8xioy",
            "dm948gf"
        ],
        "mentioned_times": [
            1503978353.0,
            1503976791.0,
            1503984003.0
        ],
        "text": [
            "Decred. Roughly 30% interest a year right now. Won't be this good forever though. Minimum buy-in is around 60 DCR right now.\n\nOh, and there's also bitbean if you REALLY want to stake ; )",
            "1k not being a tremendous amount to leverage I would divide it between ones like Decred, IOTA, SYS... maybe wait for the dip and get into NAV? Hold long-term though, because there's bound to be fluctuations that, if you can ride out, will get you good gains. Scoop up a little NEM and XRP for good measure.",
            "Because it does nothing noteworthy, people will say it's asic resistant but if it was financially worthwhile I'm sure it could be overcome, then people will say atomic swaps and lightning network but vtc isn't the only coin eventually getting these upgrades decred is & I believe byteball is compatible too. How is it different & solving a problem in a way that LTC or anyone else isn't?"
        ],
        "upvotes": [
            2,
            -4,
            7
        ]
    },
    "DCT": {
        "full_name": "DECENT",
        "mentioned_ids": [
            "6wldbn"
        ],
        "mentioned_times": [
            1503974003.0
        ],
        "text": [
            "Decent.bet is looking to hire full time CTO/Master developer ASAP."
        ],
        "upvotes": [
            3
        ]
    },
    "DGB": {
        "full_name": "Digibyte",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "DGD": {
        "full_name": "DigixDAO",
        "mentioned_ids": [
            "dm9abm1",
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503991229.0,
            1503978349.0
        ],
        "text": [
            "TaaS - closed end investment fund, pays 50% profits as dividend to tokenholders\n\nDGD - tokenholds collect share of fees generated by upcoming DGX token\n\nDICE - Represent shares of Etheroll dice game profit\n\nXRL - Crowdfunded arbitrage and market-making bot, starts operating end of October\n\nBlackmoon Crypto - Another closed-end dividend fund, in ICO now",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            1,
            3
        ]
    },
    "DMD": {
        "full_name": "Diamond",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DOGE": {
        "full_name": "Dogecoin",
        "mentioned_ids": [
            "6whtuq",
            "dm8helj",
            "dm98335",
            "dm920s7",
            "6wnj83"
        ],
        "mentioned_times": [
            1503932978.0,
            1503959260.0,
            1503988462.0,
            1503981583.0,
            1503994082.0
        ],
        "text": [
            "Now you can pay any Australian bill with Dogecoin at Living Room of Satoshi!",
            "Why Dogecoin? ",
            "yo donated 2 doge",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n",
            "We at r/dogecoin celebrate the small things in life."
        ],
        "upvotes": [
            27,
            2,
            6,
            1,
            5
        ]
    },
    "DOPE": {
        "full_name": "DopeCoin",
        "mentioned_ids": [
            "dm9kbwt"
        ],
        "mentioned_times": [
            1504003975.0
        ],
        "text": [
            "The tipping bot is dope"
        ],
        "upvotes": [
            1
        ]
    },
    "DRACO": {
        "full_name": "DT Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DTB": {
        "full_name": "Databits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DYN": {
        "full_name": "Dynamic",
        "mentioned_ids": [
            "dm8up6q"
        ],
        "mentioned_times": [
            1503973757.0
        ],
        "text": [
            "I don't think you can go wrong with DNT, a very dynamic project with unlimited possibilities."
        ],
        "upvotes": [
            3
        ]
    },
    "EBST": {
        "full_name": "eBoost",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EDG": {
        "full_name": "Edgeless",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EFL": {
        "full_name": "ElectronicGulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EGC": {
        "full_name": "EverGreenCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC": {
        "full_name": "EmerCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC2": {
        "full_name": "Einsteinium",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "ENRG": {
        "full_name": "EnergyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ERC": {
        "full_name": "EuropeCoin",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "ETC": {
        "full_name": "Ethereum Classic",
        "mentioned_ids": [
            "dm93dem",
            "dm892vw",
            "dm94o8z",
            "dm80ehc",
            "dm8fvaq",
            "dm8lawr",
            "dm91xu9",
            "dm920s7"
        ],
        "mentioned_times": [
            1503983040.0,
            1503944286.0,
            1503984480.0,
            1503923641.0,
            1503957298.0,
            1503963707.0,
            1503981494.0,
            1503981583.0
        ],
        "text": [
            "I don't get how this has 1200 upvotes and is gilded. It's a long-winded way of saying \"do your own research\".\n\nA lot of the information is either not applicable to crypto or moot at best (financial records, worst case scenarios, printing physical copies of shit in binders?). \n\nOther advice is flagrantly wrong or dangerous (\"If your buying/selling the same asset more than twice a year; your likely doing something wrong.\")\n\nAnd it's missing shit that should have been made obvious. ANN threads, market sentiment, github repo history, active devs, engaged communities, whitepaper & roadmap, available exchanges/markets, algo used, token / coin / platform, inflationary vs deflationary, distribution, staking & masternodes, etc. \n\nTo me it reads like advice from someone who works in finance and does not have a background in IT or infosec. It completely ignores the topic of underlying blockchain technology and mining, which is like buying a car without looking under the hood. ",
            "Great article...I like your idea about ranking. Can you share your ranking methodology? How you differentiate AA asset from A asset? Do you use any quantitative methods like Sharpe ratio etc?",
            "Working with, reaching out to, collaborating with, etc. It can easily be bullshit or not mean what you think it means.",
            "So accurate.. except for ETC.",
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "There is literally multiple examples of this. U could say ltc is a competitor to btc, monero and zcash, etheruem and dozens of coins out there that offer assets, etc. Very broad range of coins.",
            "Because it doesn't rely on vague promises and marketing hype (paid ads, etc.). \n\nTake for example Monaco, it is skyrocketing awaiting the app release on August 31st which might or might not have \"VISA\" backing. All based on speculation up until now, but because of the promises, paid articles etc. the coin value is skyrocketing. It could either go down hard when alledged promises are not met or it could further grow if it does, but it's all speculation.\n\nVertcoin on the other hand has a dedicated team with solid tech behind it. It's time will come but it has a harder time proving itself because people need to build up more trust in it and it's not being marketed a lot. I strongly believe that the current value is the new baseline after the +1$ pump a few days back, with multiple articles/questions/etc. floating here on /CryptoCurrency. ",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            4,
            2,
            1,
            8,
            2,
            1,
            14,
            1
        ]
    },
    "ETH": {
        "full_name": "Ethereum",
        "mentioned_ids": [
            "dm8dw1a",
            "dm87zju",
            "dm85mkz",
            "dm99saz",
            "dm8avsq",
            "dm8c35i",
            "dm8fvaq",
            "dm8elbb",
            "dm8yye8",
            "dm8mhi1",
            "dm9ahpz",
            "dm9d6d2",
            "dm8yqn7",
            "dm86sen",
            "dm86c8v",
            "dm8zwcp",
            "dm9589r",
            "dm8w9bc",
            "dm8yzkf",
            "6wm7w0",
            "dm920s7",
            "6wkleq",
            "6wjz51",
            "6wn7gl",
            "dm92xhz"
        ],
        "mentioned_times": [
            1503954484.0,
            1503941105.0,
            1503934384.0,
            1503990560.0,
            1503948868.0,
            1503951359.0,
            1503957298.0,
            1503955551.0,
            1503978315.0,
            1503965018.0,
            1503991442.0,
            1503994871.0,
            1503978087.0,
            1503937613.0,
            1503936329.0,
            1503979311.0,
            1503985108.0,
            1503975429.0,
            1503978349.0,
            1503981444.0,
            1503981583.0,
            1503967301.0,
            1503961778.0,
            1503990655.0,
            1503982560.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "good write-up buddy.\n\nI can confirma what you are saying about eth and the EEA i researched it and saw it as being a very strong fundamental to base a bullrun on eth at the time.\n\nnow Dice token is showing the same strong fundamentals but the price has yet to catch up, do your own research, i know nothing of good investments, only you do.",
            ">Research would have informed you of the Ethereum Alliance while ETH was $20 or less. https://www.infoq.com/news/2017/03/Enterprise-Ethereum\n\nfunny thing is we saw this, but this was after pretty much everyone agreed eth was a failure and centralized and people forgot about it completely and focused on better alts. A win for the good tech and punishment for bad.\n\nNope.\n\nthat news came up - of course it was a marketing move by that scam chain for companies to use private chains - surely, we thought, no one will actually think those companies will want any thing to do with public ethereum chain, this won't matter. well, we were correct about EEA companies having zero to do with public eth chain because its obviously unsecure and centralized. but we didn't expect how tech-illiterate and mentally deficient ethereum community has become after the exodus of all intelligent people and bought that up having little understanding of difference between public and private chains or difference between use and one of many experimental projects companies do. ICO's becoming popular was another sign of tech-illiteracy and became prime spot for targeting dumb money moon kids willing to trust strangers for projects unable to raise money via disciplined investors.\n\nwell, lessons we learned: fundamentals do not matter, crypto community is getting \"ethereumized\" i.e. dumber every day, and any news no matter how dumb and irrational is will probably create enormous profit.\n\n",
            "Reading about DNT, should the price move up in conjunction with ETH movement? Am I understanding this incorrectly? ",
            "Anyone remember what happened to the price of Eth when it went live on Bithumb? Did the price skyrocket quickly then fall back down a bit?",
            "Why? \nETH will have anonymous transactions with the coming fork as well. ",
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "Zcash already has atomic swaps with BTC/ETH https://github.com/zcash/ZBXCAT\nwill be publically deployed within next couple months!",
            "Its why I don't get the hype over NEO atm, it only supports C#. Stratis was my go to, but even my love for Stratis is waning.\n\nRight now I am actually quite happy to support Neblio. Its APIs will be REST based, and that means any language with a standard http library can hit it, which is most of them nowadays. Making it easy to adopt.\n\nI no longer care for C# support personally as a selling point. Care about platform, and actually using it. ETH currently has the only really working platform, and Lisk I think too. NEM will hopefully have a good one shortly with Catapult.",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "Do people really think this tech matters. It's eth only, one of the most universally hated fake crypto around without a single useful thing even possible since it's centralized, and this wants to trade between useless things only. Eth already has some \"exchanges\" for on chain token trade other projects had half decade ago.\n\nThis is one of the least interesting projects in the history of crypto right up there with putin coin.",
            "Oh okay I didn't realize nxt was its own chain! This is the first in hearing of a true decentralized token exchange for ethereum based coins that has all the features that Radar relay does. ",
            "it's on chain token platform.... nxt and bts and xcp had this natively in what 2013-2014?\n\nwhy is almost all work on eth about 4 years behind? no wonder they have trouble understanding basic concepts in crypto.",
            "Ethereum 0.5.",
            "You got me interested but I have a question. Can Ethereum do the above things you mention? What's the unique value proposition of stratis that Ethereum or others doesn't have?",
            "Ethereum, salty because I bought at 10 sold at 40\n\nArk/OMG/DNT because they're all such obvious pump and dumps. You guys can allllll deny it but the subreddit felt the exact same way about 3 different cryptos a month ago, and no one talks about them now... Don't believe me? Wayback machine is your friend.\n\nNeo, bought at 7 sold at like 40? It's a pump and dump though\n\nI mean tbh they're all pump and dumps that's why we're here lol",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "Monero - Good choice and only going to go up long-term.\nRialto - Pays token holders dividends of their arbitrage bot.\nBlockCAT - Drag and drop smart contracts, pretty low right now.\nShift - Decentralized Internet, testnet rolling out soon.\nEthereum - For upcoming ICOs, get in a good one early and you will get 10X by the time it hits exchanges.\n",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "Lunyr joins the Enterprise Ethereum Alliance (EEA)",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n",
            "will Litecoin and Bitcoin smart contracts support the same features like ETH? What would be difference?",
            "Ethereum’s Metropolis Update Will Occur Through Two Separate Hard Forks",
            "Crypto meetup in Saskatoon aug 31st Ethereum, PIVX and more.",
            "The way I understand it (and I could be completely wrong, if so someone please correct me)\n\nWhen a miner is contributing to a blockchain network they are essentially exchanging some value for transaction fee while performing tasks. They are incentivized to validate accurately in both scenarios in two different ways.\n\nIn PoW, they miners are providing a certain amount of real world value (the resources needed to run their mining machines) in exchange for transaction fees. If the miner does not provide an accurate block, they essentially forfeit the fees thus leaving them in a net negative (as they used the resources to run their mining machines with no return).\n\nIn PoS, the miner is again providing a certain amount of real world value (in this case the real world value is the value of the coins staked) in exchange for transaction fees. Again, if the minor does not provide an accurate block, they still forfeit the transaction fees. On top of that, in PoS they also forfeit their staked tokens (in the same way the resources consumed to generate an inaccurate block in a PoW scenario would be lost).\n\nBoth provide a certain amount of up front value by the minor that is lost when not being truthful. However, in a PoW scenario, we are essentially burning real world value (resources needed to run the mining computations) as a way for the miner to have to provide a unit of value up front to risk when validating. These resources are consumed REGARDLESS of whether the miner is being truthful, which makes a PoW consensus not very efficient (in terms of real world resources needed to run it). In a PoS model, the value ‘staked’ is digital value (ethereum) which means that we don’t need large amounts of real world resources consistently burning just to provide the minors with a mechanism for risking value (the risking value is the key piece that incentives truthful consensus).\n\nThe thing is that in a PoS scenario you need to ensure that a) you have a significant distribution of tokens and b) the tokens have a significant and fairly stable value. This is why ethereum has started in PoW (to spread the tokens and establish stability) at which point they can switch to PoS."
        ],
        "upvotes": [
            102,
            2,
            -2,
            1,
            12,
            -10,
            2,
            1,
            -1,
            12,
            -10,
            1,
            0,
            8,
            1,
            -1,
            5,
            2,
            3,
            7,
            1,
            5,
            4,
            4,
            2
        ]
    },
    "EXCL": {
        "full_name": "ExclusiveCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EXP": {
        "full_name": "Expanse",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FAIR": {
        "full_name": "FairCoin",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "FCT": {
        "full_name": "Factom",
        "mentioned_ids": [
            "dm8dw1a",
            "dm90biy",
            "dm8gtfe",
            "dm8cg1c",
            "6wmrlp",
            "dm97aq5",
            "dm97r77",
            "6wmssx",
            "dm9hvjb",
            "dm90x5e",
            "dm9589r"
        ],
        "mentioned_times": [
            1503954484.0,
            1503979762.0,
            1503958524.0,
            1503952021.0,
            1503986335.0,
            1503987515.0,
            1503988062.0,
            1503986630.0,
            1504000800.0,
            1503980410.0,
            1503985108.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "Ok so what ARE some excellent undervalued assets?\n\nApart from factom :)",
            "ARK, NEO, OMISEGO, FACTOM\n\nThe holy quadrinity. ",
            "Awesome. Nice jump yesterday too.\n\nAgain, FCT and ARK !",
            "What is Factom and why should you care?",
            "Factom seems like a really great currency. One of the creators of factom also wrote the book \"Blockchain for dummies\" which was a great point for me to get started with blockchains and the technology behind them. ",
            "\"It should be noted that we have no ties to factom except being invested in their currency\" \n\nDude I like factom but that's pretty much the definition of bias. ",
            "Video of mortgage and insurance application using the factom blockchain",
            "Are you sure this is a mortgage and insurance application using Factom?  Because I believe it is a demo of the product that Kuala and Atrris have created to bring tamper resistance and data authenticity to the **Japanese Social Security System**: https://kaula.jp/2017/06/13/kaula-atrris-factom/\n\n> Kaula Inc. and Atrris Corporation have formed a joint development of a usage record management system utilizing Factom’s blockchain solution\n\n> The initiative will retain record authenticity and tamper resistance to data processing of the Japanese social security system.\n\nWhat those of us who are very into Factom aren't sure about is if this has been actively adopted by, and will be integrated into the Japanese Social Security System, or if it is still in the Proof of Concept stage.  Because if it is utilized, this will be **HUGE** for Factom.\n\nFor those that don't understand Factom, this is one of its' countless potential use cases.  We (the Factom Community) see it providing data integrity and identity solutions for the world's systems.  And as an open protocol, any company or developer can be a part of that revolution.",
            "Long-term: Ark, Factom, OMG, Monero, BTC and NEO are all solid long-term projects.   ",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n"
        ],
        "upvotes": [
            102,
            1,
            26,
            16,
            14,
            3,
            1,
            8,
            2,
            6,
            5
        ]
    },
    "FLDC": {
        "full_name": "FoldingCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FLO": {
        "full_name": "Florin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FTC": {
        "full_name": "Feathercoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FUN": {
        "full_name": "FunFair",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GAM": {
        "full_name": "Gambit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GAME": {
        "full_name": "GameCredits",
        "mentioned_ids": [
            "dm9abm1",
            "6wkb95",
            "dm920s7"
        ],
        "mentioned_times": [
            1503991229.0,
            1503964851.0,
            1503981583.0
        ],
        "text": [
            "TaaS - closed end investment fund, pays 50% profits as dividend to tokenholders\n\nDGD - tokenholds collect share of fees generated by upcoming DGX token\n\nDICE - Represent shares of Etheroll dice game profit\n\nXRL - Crowdfunded arbitrage and market-making bot, starts operating end of October\n\nBlackmoon Crypto - Another closed-end dividend fund, in ICO now",
            "[Enigma Catalyst] The MITation game — Q&A with Enigma",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1,
            6,
            1
        ]
    },
    "GBG": {
        "full_name": "GBG",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GBYTE": {
        "full_name": "Byteball",
        "mentioned_ids": [
            "dm95qn3",
            "dm948gf"
        ],
        "mentioned_times": [
            1503985687.0,
            1503984003.0
        ],
        "text": [
            "Of course it's legit! This is the [CTO's explanation](https://www.youtube.com/watch?v=vQPmwWhnfSs) of Hcash on their own Youtube channel. It doesn't get any more solid than this:\n\n> Thanks Sam. You mentioned the 7 H's and I will go quickly over them. One of them is quantum resistance which is Hcash will be using the algoritm what will be post quantum resistance. Hcash will be using features from the best currencies in the market. Like the Zcash it will be using the zero knowledge protocol. For instance, it would be using the messaging and encryption of the messages from the example of what Byteball is using to chat. It will be a hive between the currencies so it will be a gateway between all the blockbase and blockless blockchain and then it will talk at the same time and interact with the tangle as well which is IOTA is based on top of it. So this is the hybrid currency that will live forever in this ecosystem and then interact seamlessly and without any enforce of all these existing technologies on the blockchain using its security and then its protection that will stay with it.\n\nI'm not kidding or being selective, this is word for word how he explained it.\n\nTheir business development director has no profile at all on the internet. No LinkedIn page or any other profile. Must be hard developing a business if business partners cannot check out who they're dealing with? In the video he has to check his notes to sum up his education and experience.\n\nTheir [github](https://github.com/HyperCash/Hcash) repository is completely empty. As is their [instagram](https://www.instagram.com/mkthcash/) page, [Reddit account](https://www.reddit.com/user/H_cash/) and other social media links.\n\nI don't know if it's a scam but it sure smells like it. These guys absolutely don't seem to know what they're talking about.",
            "Because it does nothing noteworthy, people will say it's asic resistant but if it was financially worthwhile I'm sure it could be overcome, then people will say atomic swaps and lightning network but vtc isn't the only coin eventually getting these upgrades decred is & I believe byteball is compatible too. How is it different & solving a problem in a way that LTC or anyone else isn't?"
        ],
        "upvotes": [
            4,
            7
        ]
    },
    "GCR": {
        "full_name": "GlobalCurrencyReserve",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GEO": {
        "full_name": "GeoCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GLD": {
        "full_name": "GoldCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GNO": {
        "full_name": "Gnosis",
        "mentioned_ids": [
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503978349.0
        ],
        "text": [
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            3
        ]
    },
    "GNT": {
        "full_name": "Golem",
        "mentioned_ids": [
            "dm8yzkf",
            "dm9jjc4"
        ],
        "mentioned_times": [
            1503978349.0,
            1504002908.0
        ],
        "text": [
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "I've been following omise go and currently have 95% of my portfolio invested, my other 5% is golem. Don't let me down guys "
        ],
        "upvotes": [
            3,
            1
        ]
    },
    "GOLOS": {
        "full_name": "Golos",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GRC": {
        "full_name": "GridCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GRS": {
        "full_name": "Groestlcoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GUP": {
        "full_name": "Guppy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HKG": {
        "full_name": "HackerGold",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HMQ": {
        "full_name": "Humaniq",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INCNT": {
        "full_name": "Incent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INFX": {
        "full_name": "InfluxCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOC": {
        "full_name": "I/OCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ION": {
        "full_name": "Ion",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOP": {
        "full_name": "Internet Of People",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "KMD": {
        "full_name": "Komodo",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "KORE": {
        "full_name": "KoreCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LBC": {
        "full_name": "LBRY Credits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LGD": {
        "full_name": "Legends",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LMC": {
        "full_name": "Lomocoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LSK": {
        "full_name": "Lisk",
        "mentioned_ids": [
            "dm8hs0a",
            "dm8j1h7",
            "dm8j0lt",
            "dm8fvaq",
            "dm8b5bk",
            "dm8yye8",
            "dm8n9vh",
            "dm8jxwr",
            "dm8xbnt",
            "dm91kjs",
            "6wmhci",
            "dm98cc7",
            "dm94ke3",
            "dm9e0f7",
            "dm8e02d"
        ],
        "mentioned_times": [
            1503959715.0,
            1503961193.0,
            1503961166.0,
            1503957298.0,
            1503949448.0,
            1503978315.0,
            1503965875.0,
            1503962207.0,
            1503976584.0,
            1503981108.0,
            1503983778.0,
            1503988780.0,
            1503984360.0,
            1503995907.0,
            1503954658.0
        ],
        "text": [
            "I researched Lisk. Any good platform is at least $1 billion. They are among the best and have been working hard and not publicising what they are \"going to\" accomplish. They will release their SDK Q4 and rebrand in September. They are an example of a serious blockchain company, not one of the dozens of flash in the pan ones. The last week has shown their price surge but I still think they have room to double by the end of 2017. If everything goes well, they may double two times over in 2018. I think TenX and District0x are also undervalued right now.",
            "People say Ark is a fork of lisk but let me get the facts straight for you.\n\nLisk was a fork of Crypti. \nThe people developing Ark made Crypti.\n\n\n\n",
            "ARK & LISK - The holy grail.",
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "All in on Lisk!\n",
            "Its why I don't get the hype over NEO atm, it only supports C#. Stratis was my go to, but even my love for Stratis is waning.\n\nRight now I am actually quite happy to support Neblio. Its APIs will be REST based, and that means any language with a standard http library can hit it, which is most of them nowadays. Making it easy to adopt.\n\nI no longer care for C# support personally as a selling point. Care about platform, and actually using it. ETH currently has the only really working platform, and Lisk I think too. NEM will hopefully have a good one shortly with Catapult.",
            "There are literally tons of spelling and basic communication errors on the front page of their site, not even to mention to mention the white paper. It seems like others have said, its similar to Lisk, but exponentially more risky/less sound.",
            "Its basically a  precursor to hcash.  What they are doing is pretty much the same thing as Lisk.  Their whitepaper was a terrible read, in terms of both language and professionalism.  It is WAY to hyped up than where it is supposed to be.",
            "ARK, ZRX, OMG, NEO, PAY, LSK",
            "I looked into it recently and I was happy with what I found so now Im board. Agree that is has a lot of potential. It was good to read about their tumultuous history that you describe in your steemit article, and its interesting that the team switched from a Lisk codebase to an ARK codebase which they considered to be more advanced. Thanks.",
            "Thoughts on LISK? ARKs big brother",
            "Im in on Lisk for the long run. I dont expect any big returns by the end of 2017. Im looking into next year if anything at all. ",
            "I was holding lisk months ago but it seemed like the project was about dead, the subreddit had no action and when the team streamed on youtube it looked really unprofessional and boring. I still think this recent rise has been nothing but fomo of people not wanting to miss rebranding because of what happened to Neo. I don't think Lisk will hold it's value or do much in the recent future other than change their image. I don't care I missed the train, I kinda stopped believing in the project.",
            "I have both, more excited about Ark but Lisk is also a good project!",
            "Lisk got the biggest slack group "
        ],
        "upvotes": [
            6,
            13,
            9,
            2,
            1,
            -1,
            2,
            9,
            1,
            1,
            6,
            2,
            0,
            1,
            1
        ]
    },
    "LTC": {
        "full_name": "Litecoin",
        "mentioned_ids": [
            "dm8fvaq",
            "6wj2rh",
            "dm8cn95",
            "dm8pmns",
            "dm9c0my",
            "dm98adl",
            "dm94dnm",
            "dm9589r",
            "dm8lawr",
            "6wioii",
            "dm948gf",
            "6wm2rz",
            "dm913mr",
            "dm920s7",
            "6wkleq"
        ],
        "mentioned_times": [
            1503957298.0,
            1503952245.0,
            1503952384.0,
            1503968390.0,
            1503993377.0,
            1503988710.0,
            1503984163.0,
            1503985108.0,
            1503963707.0,
            1503946960.0,
            1503984003.0,
            1503980182.0,
            1503980601.0,
            1503981583.0,
            1503967301.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "Litecoin Price Soars to $62 as Atomic Swaps Become More Feasible",
            "Amazon needs to get on board and accept litecoin and bitcoin! ",
            "The reason litecoin has increased is due to a battle between bitcoin (BTC) and bitcoin cash (BCH).  BCH instituted a difficulty adjustment making BCH much more profitable to mine than BTC.  Miners flipped chains (BCH actually had more hash rate than BTC for awhile) but flipped back at the next adjustment.  This lead to a wild oscillation of miners flipping between chains every difficulty adjustment.  This caused the rate of blocks mined to vary tremendously (even for BTC) and transactions piled up.  This uncertainty caused people to invest in litecoin.  Litecoin is very similar to bitcoin but uses a different hash function (so miners can't flip).    ",
            "I hate moon more. The term was supposed to be a joke, like when a cents stock goes up to x5+. Now you see LTC go up 15% the other day and everyone start screaming moon. I shouldn't complain, knee-jerk sentiment and dumb money is what makes this market so volatile. ",
            "litecoin bout to blast off, seriously undervalued!",
            "litecoin, all it seems to offer are faster transactions and I can't see that being an issue in the future with products like OMG or IOTA or the lightning network.",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "There is literally multiple examples of this. U could say ltc is a competitor to btc, monero and zcash, etheruem and dozens of coins out there that offer assets, etc. Very broad range of coins.",
            "Litecoin Price Surges to New All-Time High Over $60",
            "Because it does nothing noteworthy, people will say it's asic resistant but if it was financially worthwhile I'm sure it could be overcome, then people will say atomic swaps and lightning network but vtc isn't the only coin eventually getting these upgrades decred is & I believe byteball is compatible too. How is it different & solving a problem in a way that LTC or anyone else isn't?",
            "XPost - Litecoin Community Alliance Website is Live",
            "Litecoin is unstoppable at this point ",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n",
            "will Litecoin and Bitcoin smart contracts support the same features like ETH? What would be difference?"
        ],
        "upvotes": [
            2,
            56,
            7,
            4,
            22,
            2,
            1,
            5,
            1,
            9,
            7,
            5,
            3,
            1,
            5
        ]
    },
    "LUN": {
        "full_name": "Lunyr",
        "mentioned_ids": [
            "dm8yzkf",
            "6wm7w0"
        ],
        "mentioned_times": [
            1503978349.0,
            1503981444.0
        ],
        "text": [
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "Lunyr joins the Enterprise Ethereum Alliance (EEA)"
        ],
        "upvotes": [
            3,
            7
        ]
    },
    "MAID": {
        "full_name": "MaidSafe",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MCO": {
        "full_name": "Monaco",
        "mentioned_ids": [
            "dm8dw1a",
            "dm9apsc",
            "dm992kc",
            "dm91xu9",
            "6wkgiq"
        ],
        "mentioned_times": [
            1503954484.0,
            1503991725.0,
            1503989671.0,
            1503981494.0,
            1503966112.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "I thought this said Monaco... and I damn near had a heart attack.",
            "XRP because that thing is either for banks, and random users shouldnt even have an option buying it, or its for everyone to use in which case its pointless because no one actually uses it for anything.\n\nXMR because I have no idea why. I guess I always felt XMR is hard to scale and its just a proof of concept for some future privacy coin that will take the space. I guess I failed there.\n\nBAT and others in the space, because users wont change their browsers to watch ads. Its insanely hard and competitive space dominated by giants, and having a crypto token in the mix is actually a detriment to the nearly pointless effort. Its a cool idea, I just dont see it working in the real world.\n\nMCO, PAY - love the cards, tokens are stupid.\n\nAnd plenty more. Pretty much any coin/token promising perfectly bright future and butterflies, but with no working and actually used product.",
            "Because it doesn't rely on vague promises and marketing hype (paid ads, etc.). \n\nTake for example Monaco, it is skyrocketing awaiting the app release on August 31st which might or might not have \"VISA\" backing. All based on speculation up until now, but because of the promises, paid articles etc. the coin value is skyrocketing. It could either go down hard when alledged promises are not met or it could further grow if it does, but it's all speculation.\n\nVertcoin on the other hand has a dedicated team with solid tech behind it. It's time will come but it has a harder time proving itself because people need to build up more trust in it and it's not being marketed a lot. I strongly believe that the current value is the new baseline after the +1$ pump a few days back, with multiple articles/questions/etc. floating here on /CryptoCurrency. ",
            "What is Monaco & Why is it doing so well recently? Up more than 670% in the last 2 weeks alone!"
        ],
        "upvotes": [
            102,
            0,
            2,
            14,
            6
        ]
    },
    "MEME": {
        "full_name": "Memetic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MLN": {
        "full_name": "Melon",
        "mentioned_ids": [
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503978349.0
        ],
        "text": [
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            3
        ]
    },
    "MONA": {
        "full_name": "MonaCoin",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "MTL": {
        "full_name": "Metal",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MUE": {
        "full_name": "MonetaryUnit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MUSIC": {
        "full_name": "Musicoin",
        "mentioned_ids": [
            "dm8frkp"
        ],
        "mentioned_times": [
            1503957162.0
        ],
        "text": [
            "I am a normie. I like popular music and eat fastfood and wear levi jeans. So mainstream man. Should be listening to wind chimes eating alfalfa in a poncho right?"
        ],
        "upvotes": [
            1
        ]
    },
    "MYST": {
        "full_name": "Mysterium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NAV": {
        "full_name": "NAVCoin",
        "mentioned_ids": [
            "dm8pf80",
            "6wjenv",
            "dm8nq38",
            "dm8xioy",
            "dm920s7"
        ],
        "mentioned_times": [
            1503968175.0,
            1503955998.0,
            1503966361.0,
            1503976791.0,
            1503981583.0
        ],
        "text": [
            "NAVcoin (5% rate). Dev team released a tutorial how to stake with a Raspberry Pi.\n\nFurthermore Stratis and Pivx (also without masternode): https://newkidsontheblockchain.nl/en/2017/07/a-hardware-stake-wallet-using-raspberry-zero/",
            "NavCoin - whoosh!!!",
            "Hey Matthew, I discovered about NavCoin some days ago thanks to you. I don't know why you only talk about this coin but I made good profits. Thanks. I will Hold some for the long term. ",
            "1k not being a tremendous amount to leverage I would divide it between ones like Decred, IOTA, SYS... maybe wait for the dip and get into NAV? Hold long-term though, because there's bound to be fluctuations that, if you can ride out, will get you good gains. Scoop up a little NEM and XRP for good measure.",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            2,
            16,
            1,
            -4,
            1
        ]
    },
    "NBT": {
        "full_name": "Nubits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NEO": {
        "full_name": "Neo",
        "mentioned_ids": [
            "dm8dw1a",
            "dm89ger",
            "dm8c6ak",
            "dm8gtfe",
            "dm8dspq",
            "dm8bs0k",
            "dm8yye8",
            "dm8mhi1",
            "dm8u62g",
            "dm8zwcp",
            "dm90x5e",
            "dm9589r",
            "dm8xbnt",
            "dm9a0oe",
            "dm99kbh",
            "dm94ke3",
            "6wiuo5",
            "dm8d70j",
            "dm8dgow",
            "dm8eqgd",
            "dm8hf1p"
        ],
        "mentioned_times": [
            1503954484.0,
            1503945335.0,
            1503951519.0,
            1503958524.0,
            1503954337.0,
            1503950758.0,
            1503978315.0,
            1503965018.0,
            1503973190.0,
            1503979311.0,
            1503980410.0,
            1503985108.0,
            1503976584.0,
            1503990848.0,
            1503990280.0,
            1503984360.0,
            1503949383.0,
            1503953344.0,
            1503953795.0,
            1503955755.0,
            1503959275.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "Antshares (NEO) they don't have partnership with Ali baba the CEO himself da hongfei many times said it's fake news \n\nSo do better research next time ",
            "I don't believe you. I don't think you bought Neo in October and held through the slow 30% drawdown over 5 months. Do you have proof of this masterful display of discipline?",
            "ARK, NEO, OMISEGO, FACTOM\n\nThe holy quadrinity. ",
            "Neo - Ark my babies.",
            "You forgot NEO!",
            "Its why I don't get the hype over NEO atm, it only supports C#. Stratis was my go to, but even my love for Stratis is waning.\n\nRight now I am actually quite happy to support Neblio. Its APIs will be REST based, and that means any language with a standard http library can hit it, which is most of them nowadays. Making it easy to adopt.\n\nI no longer care for C# support personally as a selling point. Care about platform, and actually using it. ETH currently has the only really working platform, and Lisk I think too. NEM will hopefully have a good one shortly with Catapult.",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "I'm not invested in Neo because I bought extremely early ( like 2$) and sold extremely early (around 12$) and have kicked myself basically every day since and can't bring myself to buy less than I had ",
            "Ethereum, salty because I bought at 10 sold at 40\n\nArk/OMG/DNT because they're all such obvious pump and dumps. You guys can allllll deny it but the subreddit felt the exact same way about 3 different cryptos a month ago, and no one talks about them now... Don't believe me? Wayback machine is your friend.\n\nNeo, bought at 7 sold at like 40? It's a pump and dump though\n\nI mean tbh they're all pump and dumps that's why we're here lol",
            "Long-term: Ark, Factom, OMG, Monero, BTC and NEO are all solid long-term projects.   ",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "ARK, ZRX, OMG, NEO, PAY, LSK",
            "Pulled it all out of my shitty BBRY stock, bought NEO at 8$. Fuck stocks.",
            "I did. Not everything but maybe 3/4. So glad I did too, bought NEO@ 4-5$:)",
            "I was holding lisk months ago but it seemed like the project was about dead, the subreddit had no action and when the team streamed on youtube it looked really unprofessional and boring. I still think this recent rise has been nothing but fomo of people not wanting to miss rebranding because of what happened to Neo. I don't think Lisk will hold it's value or do much in the recent future other than change their image. I don't care I missed the train, I kinda stopped believing in the project.",
            "NEO (antshares): if you plan to hold, here is a simple tutorial on how to create/restore a neo paper wallet. A paper wallet is safe, free and is the safest way to store your coins.",
            "NEO",
            "NEO for sure",
            "NEO.",
            "NEO"
        ],
        "upvotes": [
            102,
            62,
            6,
            26,
            21,
            5,
            -1,
            12,
            12,
            -1,
            6,
            5,
            1,
            6,
            4,
            0,
            6,
            8,
            5,
            3,
            3
        ]
    },
    "NEOS": {
        "full_name": "NeosCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NLG": {
        "full_name": "Gulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NMR": {
        "full_name": "Numeraire",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXC": {
        "full_name": "Nexium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXS": {
        "full_name": "Nexus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXT": {
        "full_name": "NXT",
        "mentioned_ids": [
            "dm8igkn",
            "dm9d6d2",
            "dm8yqn7",
            "6wiqhd"
        ],
        "mentioned_times": [
            1503960519.0,
            1503994871.0,
            1503978087.0,
            1503947762.0
        ],
        "text": [
            "Does anyone feel like NXT is really low right now, and has a potential to build a solid platform?",
            "Oh okay I didn't realize nxt was its own chain! This is the first in hearing of a true decentralized token exchange for ethereum based coins that has all the features that Radar relay does. ",
            "it's on chain token platform.... nxt and bts and xcp had this natively in what 2013-2014?\n\nwhy is almost all work on eth about 4 years behind? no wonder they have trouble understanding basic concepts in crypto.",
            "Nxter Newsletter - Ignis Round 2 Update, Nxt Blockchain Creation Kit, Jelurida AMA on Cryptocopia, Media Mentions, and More"
        ],
        "upvotes": [
            1,
            1,
            0,
            11
        ]
    },
    "OK": {
        "full_name": "OkCash",
        "mentioned_ids": [
            "dm90biy",
            "dm8mhi1",
            "dm8kab9",
            "dm9akhc",
            "dm8sufu"
        ],
        "mentioned_times": [
            1503979762.0,
            1503965018.0,
            1503962593.0,
            1503991538.0,
            1503971763.0
        ],
        "text": [
            "Ok so what ARE some excellent undervalued assets?\n\nApart from factom :)",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "Dnt is a terrible attempt at pump and dump  dnt = do not touch for me . Other 2 are probably ok ",
            "Ok I'll be the idiot and ask; how do tip boots work? \n\nI get I can use a command to tip the bot but how does the tippee get the funds into their own account? \n\nDoes your bot just send out digital wallets to the recipient in their inbox.. prompt for a wallet address... or something completely different?",
            "OK Cash, Populous"
        ],
        "upvotes": [
            1,
            12,
            -7,
            6,
            1
        ]
    },
    "OMG": {
        "full_name": "OmiseGO",
        "mentioned_ids": [
            "dm8u4ne",
            "dm8gtfe",
            "6wjbxj",
            "dm8mh03",
            "dm8hisn",
            "dm8mhi1",
            "dm8sl8r",
            "dm8jhk4",
            "dm8jsqo",
            "dm8fqfl",
            "dm8nssr",
            "dm95ak1",
            "dm8p596",
            "dm8vxpb",
            "dm8qwej",
            "dm94dnm",
            "dm8zwcp",
            "dm8w5fa",
            "dm90x5e",
            "dm9589r",
            "dm8xbnt",
            "dm93qqh",
            "dm8yzkf",
            "6wnhgb",
            "dm9cr2j",
            "dm9d0gx",
            "dm9evbl",
            "6wnydx"
        ],
        "mentioned_times": [
            1503973149.0,
            1503958524.0,
            1503955155.0,
            1503965003.0,
            1503959402.0,
            1503965018.0,
            1503971495.0,
            1503961710.0,
            1503962044.0,
            1503957118.0,
            1503966444.0,
            1503985182.0,
            1503967880.0,
            1503975091.0,
            1503969721.0,
            1503984163.0,
            1503979311.0,
            1503975315.0,
            1503980410.0,
            1503985108.0,
            1503976584.0,
            1503983455.0,
            1503978349.0,
            1503993547.0,
            1503994324.0,
            1503994658.0,
            1503996982.0,
            1503998379.0
        ],
        "text": [
            "I have a very similar strategy! There's tons of coins that nobody talks about which have incredible potential to succeed while many will fail. I bought a ton of OMG when it was $1.20 and was blown away that nobody was talking about it. If you'd like to collaborate on research, let me know! ",
            "ARK, NEO, OMISEGO, FACTOM\n\nThe holy quadrinity. ",
            "I am planning to invest in ARK, DNT, and OMG. Please provide me with arguments why I shouldn't.",
            "I own OMG and don’t own Ark or DNT. So if you’re planning on investing, just avoid OMG and get Ark and DNT. ",
            "Great picks. Ark is going to moon soon, and OMG although already had huge growth so far, is holding steady rn is still very undervalued. DNT is super cheap rn and they are a great project to get in now. This being said, you should look into ZRX as well. Good longer-term hodl as well as I predicting it mooning within the next week(s). ",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "Disclaimer I own ARK and DNT and has done quite a bit of reasearch on them.\n\nI believe ARK to be the most secure one. If you are planning on holding an asset for more than a year and not touching it, this would be my choice. It is a solid team with a solid roadmap and a lot of ideas (maybe too many). Argument for not investing in ARK is that it has just risen 25% today, so might not be the best timing, and it has risen 22.407% since its ICO, so you are quite late to the party. However, I still believe it has great potential, but don't expect it to 10x in 3 months. \n\nDNT is the more riskier higher reward choice. It had bullrun of 7x in a week or two and the dropped 50% without any news. The bullrun might have placed its value too high, but I believe the recent bear market for DNT has been a bit too extreme. If you are ever going to enter DNT, now might be a good time. A lot of the people trading DNT are waiting for Bittrex decision on whether DNT is a security or not.  This decision will probably decide if the price explodes or drops, so DNT has great potential but also larger short term risk. This is also seen from its way lower market cap than ARK and OMG.",
            "Ark is great but literally mid pump as we speak, wait for it to drop. DNT is the opposite, super cheap and still waiting to be listed on Bittrex. I would buy now. OMG has been fairly stable at current pricepoint so I'd say now it a good time to get into it.",
            "I just bought a little bit of DNT, it seems like it could grow a nice amount. I've been wanting to get into ARK and OMG for a while now. Waiting for some fiat to come. And it seems like ARK is in a pump now so maybe it'll go down a bit.",
            "Ive nothing bad to say about Ark and OmiseGo, and havent researched DNT. Also interested to hear if others can offer critiques of ARK and OMG.",
            "If you've been reading up on them you should know the risks.  I'd say the least risky is OMG, with DNT being (currently) the biggest risk.  I personally don't like ARK - but I didn't read their whitepaper thoroughly so I'm prepared to be wrong.  As far as I could tell it only rewards the top 51 holders, as only the top 51 get to forge ARK.  This means the devs and their friends and family are perhaps the only beneficiaries.  I gave up the moment I read that.  It's as bad as the 20% kickback that ZCash devs get.  \n\nSaying that, look at ZCash - the extremely controversial kickback to devs hasn't stopped that coin has it?  So ARK could be amazing.  However, I feel that for actual spending coins XMR and IOTA have pretty much got things covered.\n\nIt's your money, don't listen to me or anyone else.  The markets go against everything I think one day and the next everything goes as I thought.  Truth is almost every coin is going up overall.  You could literally invest with a blindfold on, go away for six months and you'll almost certainly have much more than you originally invested.\n\nOr you can sit there and stress all day, constantly checking how much each has gone up or down.  Wishing you'd put everything into Crown (old coin set to rise) instead.  Then feel depressed, and wake up one day having all but given up on your investment, only to click in and see that one of your investments has gone from 0.000050  to 0.154345  overnight - and you've got 50,000 of them, the other has gone from .0064234  to .0843454 - suddenly the world lights up for you.\n",
            "I'm not sure about OMG. They don't really have a product yet and you could use virtually any cryptocurrency for remittances. Why omg over any other crypto? The hype is solely based around the company behind it which is probably a good company but I don't see why we can't just use any other token. ",
            "DNT and OMG were yesterdays pumps",
            "I sold all my stratis for OMG. Best decision i made. The problem I had with stratis is the team didn't care to participate in the stratis subreddit or care that it wasn't very active. They didn't seem to understand the importance of reddit with regards to crypto. This is where most people in crypto come for info. They would just use slack and somehow expect the community and awareness to grow.",
            "OMG (OmiseGo) will pay out dividends in the future too.",
            "litecoin, all it seems to offer are faster transactions and I can't see that being an issue in the future with products like OMG or IOTA or the lightning network.",
            "Ethereum, salty because I bought at 10 sold at 40\n\nArk/OMG/DNT because they're all such obvious pump and dumps. You guys can allllll deny it but the subreddit felt the exact same way about 3 different cryptos a month ago, and no one talks about them now... Don't believe me? Wayback machine is your friend.\n\nNeo, bought at 7 sold at like 40? It's a pump and dump though\n\nI mean tbh they're all pump and dumps that's why we're here lol",
            "OmiseGo is about to go exponential.. ticker is OMG",
            "Long-term: Ark, Factom, OMG, Monero, BTC and NEO are all solid long-term projects.   ",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "ARK, ZRX, OMG, NEO, PAY, LSK",
            "I'd say OMG, ARK, XMR and IOTA are all solid choices. Worth diversifying yourself between some large cap and small cap coins.",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "What do you think of OmiseGO (OMG) currency?",
            "This sub has ALOT of recent OMG discussions going on... I think you should check those out.",
            "Super bullish on OMG",
            "OMG is the solution to all of these dumb cryptocurrency squabbles. Just a totally agnostic payment system, use whatever you want and may the best currency win.\n\nExtremely bullish on this one. It makes up about 15% of my portfolio now.",
            "Omise / OmiseGO strategy vol.01 – JUN – Medium"
        ],
        "upvotes": [
            1,
            26,
            53,
            61,
            29,
            12,
            8,
            6,
            4,
            1,
            1,
            1,
            -1,
            2,
            1,
            1,
            -1,
            8,
            6,
            5,
            1,
            1,
            3,
            5,
            8,
            7,
            5,
            4
        ]
    },
    "OMNI": {
        "full_name": "OMNI",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PART": {
        "full_name": "Particl",
        "mentioned_ids": [
            "dm8vctd",
            "dm911h6",
            "dm8pjlp",
            "dm9hvjb",
            "dm9589r"
        ],
        "mentioned_times": [
            1503974465.0,
            1503980537.0,
            1503968302.0,
            1504000800.0,
            1503985108.0
        ],
        "text": [
            "No matter how well you can convince yourself by doing research and investing a huge part of it its just plain pure randomness.\n\nPsychology is much more important in making profits in this field, in that you can stand losses and understand that in most cases when something does down if very often comes back up. And you cannot go with the crowd, moving against the flow is not fun but you either have profits or have fun. Or have fun when most don't. Its also useful to have sources to monitor what the go-with-the-flow people do and use that as a signal to make decisions. It takes a lonely wolf to do it properly.\n\n",
            "Im not invested in this at all, but I know Dr Joseph Liu is in fact a real person due to his work on ring signatures and that he is part of the project as he says so on his research page. http://users.monash.edu.au/~kailiu/index.html ",
            ">but with POS coins you can only get if you are a masternode\n\nThat is the case with the masternode part of coins with a masternode system, but others like PIVX will give you solid ROI for staking which is pretty much just holding the coins and running the program.  You can use a raspberry pi, VPS, VM, or anything",
            "Are you sure this is a mortgage and insurance application using Factom?  Because I believe it is a demo of the product that Kuala and Atrris have created to bring tamper resistance and data authenticity to the **Japanese Social Security System**: https://kaula.jp/2017/06/13/kaula-atrris-factom/\n\n> Kaula Inc. and Atrris Corporation have formed a joint development of a usage record management system utilizing Factom’s blockchain solution\n\n> The initiative will retain record authenticity and tamper resistance to data processing of the Japanese social security system.\n\nWhat those of us who are very into Factom aren't sure about is if this has been actively adopted by, and will be integrated into the Japanese Social Security System, or if it is still in the Proof of Concept stage.  Because if it is utilized, this will be **HUGE** for Factom.\n\nFor those that don't understand Factom, this is one of its' countless potential use cases.  We (the Factom Community) see it providing data integrity and identity solutions for the world's systems.  And as an open protocol, any company or developer can be a part of that revolution.",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n"
        ],
        "upvotes": [
            4,
            2,
            2,
            2,
            5
        ]
    },
    "PAY": {
        "full_name": "TenX Pay Token",
        "mentioned_ids": [
            "dm8mxo5",
            "dm992kc",
            "dm9589r",
            "dm8xbnt",
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503965503.0,
            1503989671.0,
            1503985108.0,
            1503976584.0,
            1503978349.0
        ],
        "text": [
            "TenX does.  PAY tokens specifically pay dividends based on monthly transaction volume.\n\nAnd you get 0.1% pay token rewards evertime you spend money with the card.",
            "XRP because that thing is either for banks, and random users shouldnt even have an option buying it, or its for everyone to use in which case its pointless because no one actually uses it for anything.\n\nXMR because I have no idea why. I guess I always felt XMR is hard to scale and its just a proof of concept for some future privacy coin that will take the space. I guess I failed there.\n\nBAT and others in the space, because users wont change their browsers to watch ads. Its insanely hard and competitive space dominated by giants, and having a crypto token in the mix is actually a detriment to the nearly pointless effort. Its a cool idea, I just dont see it working in the real world.\n\nMCO, PAY - love the cards, tokens are stupid.\n\nAnd plenty more. Pretty much any coin/token promising perfectly bright future and butterflies, but with no working and actually used product.",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "ARK, ZRX, OMG, NEO, PAY, LSK",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            2,
            2,
            5,
            1,
            3
        ]
    },
    "PDC": {
        "full_name": "Project Decorum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PINK": {
        "full_name": "PinkCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PIVX": {
        "full_name": "Pivx",
        "mentioned_ids": [
            "dm8pf80",
            "dm8pjlp",
            "dm95d65",
            "dm9589r",
            "dm920s7",
            "6wn7gl"
        ],
        "mentioned_times": [
            1503968175.0,
            1503968302.0,
            1503985263.0,
            1503985108.0,
            1503981583.0,
            1503990655.0
        ],
        "text": [
            "NAVcoin (5% rate). Dev team released a tutorial how to stake with a Raspberry Pi.\n\nFurthermore Stratis and Pivx (also without masternode): https://newkidsontheblockchain.nl/en/2017/07/a-hardware-stake-wallet-using-raspberry-zero/",
            ">but with POS coins you can only get if you are a masternode\n\nThat is the case with the masternode part of coins with a masternode system, but others like PIVX will give you solid ROI for staking which is pretty much just holding the coins and running the program.  You can use a raspberry pi, VPS, VM, or anything",
            "PIVX Does and it's anonymous as well ",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n",
            "Crypto meetup in Saskatoon aug 31st Ethereum, PIVX and more."
        ],
        "upvotes": [
            2,
            2,
            1,
            5,
            1,
            4
        ]
    },
    "PKB": {
        "full_name": "ParkByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "POT": {
        "full_name": "PotCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PPC": {
        "full_name": "Peercoin",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "PTC": {
        "full_name": "PesetaCoin ",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PTOY": {
        "full_name": "Patientory",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "QRL": {
        "full_name": "Quantum Resistant Ledger",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "QTUM": {
        "full_name": "Qtum",
        "mentioned_ids": [
            "dm8bho2",
            "dm90024",
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503950173.0,
            1503979419.0,
            1503978349.0
        ],
        "text": [
            "QTUM will be listed on CoinOne today, get in for some gains",
            "QTUM.. biggest scamcoin since well, like a week before QTUM bought a bunch of sponsorships on trading websites and still didn't have a white paper",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            -15,
            5,
            3
        ]
    },
    "QWARK": {
        "full_name": "Qwark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RADS": {
        "full_name": "Radium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RBY": {
        "full_name": "RubyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RDD": {
        "full_name": "ReddCoin",
        "mentioned_ids": [
            "dm8fvaq"
        ],
        "mentioned_times": [
            1503957298.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?"
        ],
        "upvotes": [
            2
        ]
    },
    "REP": {
        "full_name": "Augur",
        "mentioned_ids": [
            "dm9hrpj",
            "dm8yzkf",
            "dm9i2xr"
        ],
        "mentioned_times": [
            1504000665.0,
            1503978349.0,
            1504001054.0
        ],
        "text": [
            "I have an AdWords rep for work and showed them this thread as well as that site. I don't know what she will do with it, but she passed it along. Good lookin out!",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation.",
            "> First, there is a new entity that is considering issuing a brand new digital currency that is compliant with anti-money laundering laws unlike any other in circulation.\n\nThis is terrifying. Please call you congress rep and ask them to oppose this. NSA + fully transparent Crypto-USD is something I am very very frightened by. "
        ],
        "upvotes": [
            2,
            3,
            1
        ]
    },
    "RISE": {
        "full_name": "Rise",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RLC": {
        "full_name": "iEx.ec",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SAFEX": {
        "full_name": "SafeExchangeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SBD": {
        "full_name": "SteemDollars",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SC": {
        "full_name": "Siacoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SEQ": {
        "full_name": "Sequence",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SHIFT": {
        "full_name": "Shift",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SIB": {
        "full_name": "Siberian Chervonets",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLR": {
        "full_name": "SolarCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLS": {
        "full_name": "SaluS",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNGLS": {
        "full_name": "SingularDTV",
        "mentioned_ids": [
            "dm8k60e",
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503962459.0,
            1503978349.0
        ],
        "text": [
            "SingularDTV will distribute Ether rewards based on how many SNGLS tokens you own, once that mechanism launches.",
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            4,
            3
        ]
    },
    "SNRG": {
        "full_name": "Synergy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNT": {
        "full_name": "Status Network Token",
        "mentioned_ids": [
            "dm8yzkf"
        ],
        "mentioned_times": [
            1503978349.0
        ],
        "text": [
            "There are a ton of erc20 coins that are arguably dependent on ETH. They include GNT, OMG, QTUM, PAY, EOS, MKR, REP, BAT, ICN, GNO, DGD, SNT, ANT, DNT, SNGLS, TAAS, MLN, SAN, LUN, and many others.\n\nThere are many competitors but that is a very complicated situation."
        ],
        "upvotes": [
            3
        ]
    },
    "SPHR": {
        "full_name": "Sphere",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SPR": {
        "full_name": "SpreadCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "START": {
        "full_name": "StartCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "STEEM": {
        "full_name": "STEEM",
        "mentioned_ids": [
            "dm8fvaq",
            "dm94nys"
        ],
        "mentioned_times": [
            1503957298.0,
            1503984470.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "Can you tell me what's good about Rocket? I see it's proudly boasting of having teammembers involved in Steem & Bitshares, which is quite worrying."
        ],
        "upvotes": [
            2,
            3
        ]
    },
    "STORJ": {
        "full_name": "Storj",
        "mentioned_ids": [
            "dm8fvaq"
        ],
        "mentioned_times": [
            1503957298.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?"
        ],
        "upvotes": [
            2
        ]
    },
    "STRAT": {
        "full_name": "Stratis",
        "mentioned_ids": [
            "dm8ge6y",
            "dm8yye8",
            "6whsay",
            "dm8npqa",
            "dm8vxpb",
            "dm86c8v",
            "dm8pf80",
            "dm920s7"
        ],
        "mentioned_times": [
            1503957985.0,
            1503978315.0,
            1503932327.0,
            1503966350.0,
            1503975091.0,
            1503936329.0,
            1503968175.0,
            1503981583.0
        ],
        "text": [
            "As a C# developer I was initially interested in this Stratis thing but was quickly repelled 3 hours later.",
            "Its why I don't get the hype over NEO atm, it only supports C#. Stratis was my go to, but even my love for Stratis is waning.\n\nRight now I am actually quite happy to support Neblio. Its APIs will be REST based, and that means any language with a standard http library can hit it, which is most of them nowadays. Making it easy to adopt.\n\nI no longer care for C# support personally as a selling point. Care about platform, and actually using it. ETH currently has the only really working platform, and Lisk I think too. NEM will hopefully have a good one shortly with Catapult.",
            "Stratis: Sleeping giant",
            "Warning: this account is 2 months old and has only talked about Stratis. ",
            "I sold all my stratis for OMG. Best decision i made. The problem I had with stratis is the team didn't care to participate in the stratis subreddit or care that it wasn't very active. They didn't seem to understand the importance of reddit with regards to crypto. This is where most people in crypto come for info. They would just use slack and somehow expect the community and awareness to grow.",
            "You got me interested but I have a question. Can Ethereum do the above things you mention? What's the unique value proposition of stratis that Ethereum or others doesn't have?",
            "NAVcoin (5% rate). Dev team released a tutorial how to stake with a Raspberry Pi.\n\nFurthermore Stratis and Pivx (also without masternode): https://newkidsontheblockchain.nl/en/2017/07/a-hardware-stake-wallet-using-raspberry-zero/",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            17,
            -1,
            18,
            2,
            2,
            1,
            2,
            1
        ]
    },
    "SWIFT": {
        "full_name": "Bitswift",
        "mentioned_ids": [
            "dm8dw1a",
            "6whwkq"
        ],
        "mentioned_times": [
            1503954484.0,
            1503934220.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "World First Cryptocurrency Integrate With iOS -[ ARKKit Swift Framework ]"
        ],
        "upvotes": [
            102,
            5
        ]
    },
    "SWT": {
        "full_name": "Swarm City Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYNX": {
        "full_name": "Syndicate",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYS": {
        "full_name": "SysCoin",
        "mentioned_ids": [
            "dm8xioy",
            "dm920s7"
        ],
        "mentioned_times": [
            1503976791.0,
            1503981583.0
        ],
        "text": [
            "1k not being a tremendous amount to leverage I would divide it between ones like Decred, IOTA, SYS... maybe wait for the dip and get into NAV? Hold long-term though, because there's bound to be fluctuations that, if you can ride out, will get you good gains. Scoop up a little NEM and XRP for good measure.",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            -4,
            1
        ]
    },
    "THC": {
        "full_name": "HempCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TIME": {
        "full_name": "Chronobank Time",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TKN": {
        "full_name": "TokenCard",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TKS": {
        "full_name": "Tokes",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRIG": {
        "full_name": "TRIG Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRST": {
        "full_name": "Trustcoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRUST": {
        "full_name": "TrustPlus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TX": {
        "full_name": "TransferCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UBQ": {
        "full_name": "Ubiq",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UNB": {
        "full_name": "UnbreakableCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UNO": {
        "full_name": "Unobtanium",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "VIA": {
        "full_name": "ViaCoin ",
        "mentioned_ids": [
            "dm85mkz",
            "dm8mhi1",
            "dm920s7"
        ],
        "mentioned_times": [
            1503934384.0,
            1503965018.0,
            1503981583.0
        ],
        "text": [
            ">Research would have informed you of the Ethereum Alliance while ETH was $20 or less. https://www.infoq.com/news/2017/03/Enterprise-Ethereum\n\nfunny thing is we saw this, but this was after pretty much everyone agreed eth was a failure and centralized and people forgot about it completely and focused on better alts. A win for the good tech and punishment for bad.\n\nNope.\n\nthat news came up - of course it was a marketing move by that scam chain for companies to use private chains - surely, we thought, no one will actually think those companies will want any thing to do with public ethereum chain, this won't matter. well, we were correct about EEA companies having zero to do with public eth chain because its obviously unsecure and centralized. but we didn't expect how tech-illiterate and mentally deficient ethereum community has become after the exodus of all intelligent people and bought that up having little understanding of difference between public and private chains or difference between use and one of many experimental projects companies do. ICO's becoming popular was another sign of tech-illiteracy and became prime spot for targeting dumb money moon kids willing to trust strangers for projects unable to raise money via disciplined investors.\n\nwell, lessons we learned: fundamentals do not matter, crypto community is getting \"ethereumized\" i.e. dumber every day, and any news no matter how dumb and irrational is will probably create enormous profit.\n\n",
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            -2,
            12,
            1
        ]
    },
    "VOX": {
        "full_name": "Voxels",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VRC": {
        "full_name": "VeriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VRM": {
        "full_name": "Verium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VTC": {
        "full_name": "Vertcoin",
        "mentioned_ids": [
            "dm8fvaq",
            "6wm54l",
            "dm91xu9",
            "dm948gf",
            "dm920s7"
        ],
        "mentioned_times": [
            1503957298.0,
            1503980760.0,
            1503981494.0,
            1503984003.0,
            1503981583.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "Why is vertcoin struggling?",
            "Because it doesn't rely on vague promises and marketing hype (paid ads, etc.). \n\nTake for example Monaco, it is skyrocketing awaiting the app release on August 31st which might or might not have \"VISA\" backing. All based on speculation up until now, but because of the promises, paid articles etc. the coin value is skyrocketing. It could either go down hard when alledged promises are not met or it could further grow if it does, but it's all speculation.\n\nVertcoin on the other hand has a dedicated team with solid tech behind it. It's time will come but it has a harder time proving itself because people need to build up more trust in it and it's not being marketed a lot. I strongly believe that the current value is the new baseline after the +1$ pump a few days back, with multiple articles/questions/etc. floating here on /CryptoCurrency. ",
            "Because it does nothing noteworthy, people will say it's asic resistant but if it was financially worthwhile I'm sure it could be overcome, then people will say atomic swaps and lightning network but vtc isn't the only coin eventually getting these upgrades decred is & I believe byteball is compatible too. How is it different & solving a problem in a way that LTC or anyone else isn't?",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            2,
            7,
            14,
            7,
            1
        ]
    },
    "VTR": {
        "full_name": "vTorrent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "WAVES": {
        "full_name": "Waves",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "WINGS": {
        "full_name": "Wings DAO",
        "mentioned_ids": [
            "dm8mhi1"
        ],
        "mentioned_times": [
            1503965018.0
        ],
        "text": [
            "I hate sounding like a commercial so I focus on risks only. This is their properties only, not investment advice as prices don't have to follow tech quality.\n\nark's only more unique play are bridges - connecting blockchains. This isn't a new concept. However this is a HUGE HUGE requirement:\n\n>In order for ARK to become the medium/intermediary between chains, each chain needs a small snippet of code implemented. It is very easy to insert and not harmful to any blockchain, current or otherwise. Once this tiny code is inserted into the core code of any blockchain, that’s it. Now that blockchain is connected to ARK. We make it painless and extremely simple to implement, and will provide very easy to follow instructions with 24/7 support via slack chat.\n\nhttps://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\n\nhowever it seems might not be the case anymore\n\n> Actually in the current implementation the hard fork is no longer needed. An intermediate node called the encode listener is used. Bridging a different blockchain does no longer require the cooperation of that blockchain. /u/randomstring12345678 said below\n\n~~Maybe someone can tell me how they plan to get BTC for example to add that snippet.~~\n\nthere are others connecting blockchains together: blocknet, heat, supernet, internet of coins, cosmos, just plain old atomic swaps w or w/o state channels, polkadot, few more.\n\nOtherwise it seems ok and well managed, but did do ICO which is a negative bc centralized funding, hard to fire devs, and so on.\n\n\n----\n\ndnt is just another attempt at dao on eth. why this one instead of another? who knows. DAO's existed since 2014 in bts, and since eth one failed several more attempts have appeared: ant and wings seem similar.\n\neth is probably going to succeed despite being centralized through misinformation as always and while cloning it is an improvement from 0 security, other aspects of it aren't much improved to warrant obvious switch away from it for its present community's preferences. They are even introducing trusted setup to eth via zk snarks, one of the best signs of developers lack of understanding in why trustless tech is important. Enormously better alternatives are coming built from ground up to be better, for example EOS (11 months) and heavily inspired by EOS dpos tech NEO (not sure on timeline for custom smart contracts live, someone help me) will both provide better alternatives imo by every category. \n\nit also had ICO and thus is unsecure and centralized and high risk\n\n---\n\nOMG - It doesn't really provide anything new at first you can't do better with even tech from 2014, future plan depends heavily on tech not written yet including state channels, ran by centralized company with all the funding including ICO and all the connections so good luck disagreeing with the leader of that \"decentralized\" organization\n\nOh yeah, and since typical ICO designs are the worst method possible for coin distribution for PoS, much like in eth, it's a huge security concern.\n\nfor positive aspects just read their websites, promising the world is easy.\n"
        ],
        "upvotes": [
            12
        ]
    },
    "XAUR": {
        "full_name": "Xaurum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XBB": {
        "full_name": "Boolberry",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XCP": {
        "full_name": "Counterparty",
        "mentioned_ids": [
            "dm8fvaq",
            "dm8yqn7"
        ],
        "mentioned_times": [
            1503957298.0,
            1503978087.0
        ],
        "text": [
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "it's on chain token platform.... nxt and bts and xcp had this natively in what 2013-2014?\n\nwhy is almost all work on eth about 4 years behind? no wonder they have trouble understanding basic concepts in crypto."
        ],
        "upvotes": [
            2,
            0
        ]
    },
    "XDN": {
        "full_name": "DigitalNote",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XEL": {
        "full_name": "Elastic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XEM": {
        "full_name": "NewEconomyMovement",
        "mentioned_ids": [
            "dm8yyj9",
            "dm9589r"
        ],
        "mentioned_times": [
            1503978319.0,
            1503985108.0
        ],
        "text": [
            "I'm not in BTC as I think it's likely to shit the bed when the 2x hard fork rolls around, I'm not in XEM as with 9b coins in circulation how high can it really go.",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n"
        ],
        "upvotes": [
            3,
            5
        ]
    },
    "XLM": {
        "full_name": "Lumen",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XMG": {
        "full_name": "Magi",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XMR": {
        "full_name": "Monero",
        "mentioned_ids": [
            "dm8dw1a",
            "dm8q3ki",
            "6wi9xv",
            "dm89fab",
            "dm885d8",
            "dm8ozq1",
            "dm8o9rg",
            "dm8xw98",
            "6wiuw0",
            "dm8brex",
            "dm8fvaq",
            "dm8nssr",
            "6wiw88",
            "dm992kc",
            "dm90x5e",
            "dm9589r",
            "dm8w9bc",
            "dm93qqh",
            "dm9jtk0",
            "dm8lawr",
            "6wjs6u"
        ],
        "mentioned_times": [
            1503954484.0,
            1503968880.0,
            1503940590.0,
            1503945249.0,
            1503941573.0,
            1503967714.0,
            1503966950.0,
            1503977189.0,
            1503949466.0,
            1503950726.0,
            1503957298.0,
            1503966444.0,
            1503949978.0,
            1503989671.0,
            1503980410.0,
            1503985108.0,
            1503975429.0,
            1503983455.0,
            1504003287.0,
            1503963707.0,
            1503959920.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "Research would have informed you that Monero is the only fungible cryptocurrency before it hit $140 ($38 last month).",
            "Monero live on bithumb, $214 and rising",
            "WHOOOO!! Me and my 0.274693 XMR are going to the MOON!",
            "Did you know that Bithumb is going to organize a traders competition on september 2 & 3 (local time Seoul)? The 50 best traders will get awarded, in XMR! ",
            "I fucking hate myself, about 2/3 weeks ago I posted a list of coins I was planning on buying with 5k I just got. Was going to put 1750 more into Monero, with wiretransfers, back transfers and me fucking up, I haven't gotten my money to buy yet. This was when it was $47",
            "Aw YISS. we going to the MOON bby. my 0.8 XMR and I.\n\nEddti: Little drunk",
            "only bought 4.75 @ 0.021 satoshi\nbut im happy monero is being recognised because it's my favourite coin",
            "Monero Price Hits an All-time High of $154.18 While Bithumb Trades at $168",
            "$200 million volume on bitthumb.\nBittrex + Bitfinex + Polo = 110 million.\nPrice Bitthumb = $165-170\nBittrex is catching up but Polo and Bitfinex is still at 150. \n\nYou can folow the XMR price on Bithumb here,\n\nhttps://www.bithumb.com/u2/US201 ",
            "Can we name them all without looking it up? Left to right\n\n* storj\n* ?\n* counterparty\n* ?\n* Dash\n* Vertcoin?\n* bitshares\n* reddcoin\n* ?\n* Other dash?\n* Digix\n* Steem\n* ETC\n* ?\n* Nimiq?\n* ?\n* ?\n* Sia\n* Lisk\n* LTC\n* ?\n* ?\n* ?\n* Eth\n* Monero\n* BCH\n* ?",
            "If you've been reading up on them you should know the risks.  I'd say the least risky is OMG, with DNT being (currently) the biggest risk.  I personally don't like ARK - but I didn't read their whitepaper thoroughly so I'm prepared to be wrong.  As far as I could tell it only rewards the top 51 holders, as only the top 51 get to forge ARK.  This means the devs and their friends and family are perhaps the only beneficiaries.  I gave up the moment I read that.  It's as bad as the 20% kickback that ZCash devs get.  \n\nSaying that, look at ZCash - the extremely controversial kickback to devs hasn't stopped that coin has it?  So ARK could be amazing.  However, I feel that for actual spending coins XMR and IOTA have pretty much got things covered.\n\nIt's your money, don't listen to me or anyone else.  The markets go against everything I think one day and the next everything goes as I thought.  Truth is almost every coin is going up overall.  You could literally invest with a blindfold on, go away for six months and you'll almost certainly have much more than you originally invested.\n\nOr you can sit there and stress all day, constantly checking how much each has gone up or down.  Wishing you'd put everything into Crown (old coin set to rise) instead.  Then feel depressed, and wake up one day having all but given up on your investment, only to click in and see that one of your investments has gone from 0.000050  to 0.154345  overnight - and you've got 50,000 of them, the other has gone from .0064234  to .0843454 - suddenly the world lights up for you.\n",
            "Massive Monero volumes trading on BitHumb (Korea), interesting times for XMR...",
            "XRP because that thing is either for banks, and random users shouldnt even have an option buying it, or its for everyone to use in which case its pointless because no one actually uses it for anything.\n\nXMR because I have no idea why. I guess I always felt XMR is hard to scale and its just a proof of concept for some future privacy coin that will take the space. I guess I failed there.\n\nBAT and others in the space, because users wont change their browsers to watch ads. Its insanely hard and competitive space dominated by giants, and having a crypto token in the mix is actually a detriment to the nearly pointless effort. Its a cool idea, I just dont see it working in the real world.\n\nMCO, PAY - love the cards, tokens are stupid.\n\nAnd plenty more. Pretty much any coin/token promising perfectly bright future and butterflies, but with no working and actually used product.",
            "Long-term: Ark, Factom, OMG, Monero, BTC and NEO are all solid long-term projects.   ",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "Monero - Good choice and only going to go up long-term.\nRialto - Pays token holders dividends of their arbitrage bot.\nBlockCAT - Drag and drop smart contracts, pretty low right now.\nShift - Decentralized Internet, testnet rolling out soon.\nEthereum - For upcoming ICOs, get in a good one early and you will get 10X by the time it hits exchanges.\n",
            "I'd say OMG, ARK, XMR and IOTA are all solid choices. Worth diversifying yourself between some large cap and small cap coins.",
            "long-term i'd suggest monero. and for short-term i'd suggest monero. since you want 3-5 coins i'd break it up as follows:\n\n50% monero\n20% monero\n30% monero \n\nwhy diversify when one coin does it all?",
            "There is literally multiple examples of this. U could say ltc is a competitor to btc, monero and zcash, etheruem and dozens of coins out there that offer assets, etc. Very broad range of coins.",
            "Monero to the Moon!"
        ],
        "upvotes": [
            102,
            1,
            105,
            47,
            9,
            6,
            2,
            1,
            78,
            6,
            2,
            1,
            31,
            2,
            6,
            5,
            2,
            1,
            1,
            1,
            10
        ]
    },
    "XMY": {
        "full_name": "Myriad",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XRP": {
        "full_name": "Ripple",
        "mentioned_ids": [
            "dm8dw1a",
            "dm8dts3",
            "dm8z9gb",
            "dm992kc",
            "dm9589r",
            "dm8xioy"
        ],
        "mentioned_times": [
            1503954484.0,
            1503954383.0,
            1503978640.0,
            1503989671.0,
            1503985108.0,
            1503976791.0
        ],
        "text": [
            "eh. not much useful information. imho. just like your previous \"making a million $\"\n\n1. this year will be difficult to repeat. possible, but difficult. it's the exception, not the rule. putting 10k in the top 10 one year ago would've netted you about 200k. putting 10k in the top 10 in 2015 wouldn't have netted you more than 40-50k in august 2016, and going a year further back, 2014-2015 would've probably lost you some money (can't be arsed to do exact calculations, but i'll gladly do them if there's demand). plus, look at the prices (and marketcaps!) of the current top 10 (or go even further!) vs the ones from previous years. the difference is orders of magnitude!\n\n2. if you invested any time before May this year, you would have needed to do something *seriously* wrong to not make a good profit. research or no research\n\n3. i want to see your strategy in place for years 2014-15 or 2015-16, where the market was nowhere near as bullish\n\n4. your examples are kinda useless. XRP working with banks didn't coincide with any rally (it was pretty stable, almost static up to the beginning of april with a relatively small pump). XRP skyrocketed *just like every other altcoin* back in may/june. it's not unlikely XRP will be destroyed by ChainkLink+SWIFT. plus plus, afaik, banks are using the protocol, not the token, so by doing thorough research nobody in their right mind would've invested. ETH was also almost uninfluenced by the Alliance news. the NEO pump also had nothing to do with Alibaba. meanwhile, Factom (just to give one example) has existed for as long as Eth, has real world applications and very solid business partners and yadda yadda yadda, and it has just barely reached 30$ these past few days. will it go higher? probably. but i'd be lying if i said \"100%\" because we all saw what happened in June\n\nwith your research, would you have guessed the BCH rally this month just because Koreans pumped it? did you predict the rise of Dash and Monero? or the fall of DNT after so much hype, even though it ticks pretty much every box for \"future success story\"? could you have predicted Monaco exploding to 20× its price in less than a month, even though it's a vastly inferior product to TenX, a coin that's been stagnant for a while? no? thought so...\n\nseriously, dude. it's mostly luck. let's stop pretending it's anything else. the market is *extremely* volatile, and it's difficult to predict what news will affect the market and what won't and when. sometimes you can go by \"buy the rumour sell the news\", while other times \"the news\" won't make a difference. plus, there are soooo many of the smaller coins that are used for p&d schemes it's very risky to invest. perhaps when cryptos will become ubiquitous and mainstream, then some kind of Buffet-like value investing will be feasible, but right now...\n\njust my 0.02€",
            "This is great and all but people forget that many other coins had similar news but they still failed miserably.\n\n> Research would have let you known that Ripple (XRP) was working with major banks in Asia (Japan) while the asset was only half a cent. ($0.005)\n\nFor example the above, I could find at least 5 coins with similar claims that are now more or less dead.",
            "I'm not in XRP because I don't understand it's value.",
            "XRP because that thing is either for banks, and random users shouldnt even have an option buying it, or its for everyone to use in which case its pointless because no one actually uses it for anything.\n\nXMR because I have no idea why. I guess I always felt XMR is hard to scale and its just a proof of concept for some future privacy coin that will take the space. I guess I failed there.\n\nBAT and others in the space, because users wont change their browsers to watch ads. Its insanely hard and competitive space dominated by giants, and having a crypto token in the mix is actually a detriment to the nearly pointless effort. Its a cool idea, I just dont see it working in the real world.\n\nMCO, PAY - love the cards, tokens are stupid.\n\nAnd plenty more. Pretty much any coin/token promising perfectly bright future and butterflies, but with no working and actually used product.",
            "I can suggest you a few coins for both long term holding and short term gains. Some of these I am personally invested in, some of them I am not, but also see a lot of potential in.\n\n\n**Long term:**\n\n* OmiseGo (OMG)\n* NEM (XEM)\n* Factom (FCT)\n* NEO (NEO)\n* Ethereum (ETH)\n* Ripple (XRP)\n\n**Short term:**\n\n* TenX (PAY)\n* District0x (DNT)\n* openANX (OAX)\n* PIVX (PIVX)\n\n**Other coins that I believe are here to stay:**\n\n* Bitcoin (BTC)\n* Litecoin (LTC)\n* Monero (XMR)\n* Iconomi (ICN)\n* Waves (WAVES)\n\nThere are other projects that I am interested in (*and some even invested in*) that I did not list here, but this is a short list of the coins I see the most potential in after a lot of research. I would advise you to only use these recommendations (*goes for all other recommendations in this thread*) as part of your research for possible investments and not as actual financial advice. \n",
            "1k not being a tremendous amount to leverage I would divide it between ones like Decred, IOTA, SYS... maybe wait for the dip and get into NAV? Hold long-term though, because there's bound to be fluctuations that, if you can ride out, will get you good gains. Scoop up a little NEM and XRP for good measure."
        ],
        "upvotes": [
            102,
            5,
            3,
            2,
            5,
            -4
        ]
    },
    "XST": {
        "full_name": "StealthCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVC": {
        "full_name": "Vcash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVG": {
        "full_name": "Verge",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XWC": {
        "full_name": "WhiteCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XZC": {
        "full_name": "ZCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ZCL": {
        "full_name": "Zclassic",
        "mentioned_ids": [
            "dm920s7"
        ],
        "mentioned_times": [
            1503981583.0
        ],
        "text": [
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1
        ]
    },
    "ZEC": {
        "full_name": "Zcash",
        "mentioned_ids": [
            "dm8elbb",
            "dm8nssr",
            "dm95qn3",
            "dm8lawr",
            "dm920s7"
        ],
        "mentioned_times": [
            1503955551.0,
            1503966444.0,
            1503985687.0,
            1503963707.0,
            1503981583.0
        ],
        "text": [
            "Zcash already has atomic swaps with BTC/ETH https://github.com/zcash/ZBXCAT\nwill be publically deployed within next couple months!",
            "If you've been reading up on them you should know the risks.  I'd say the least risky is OMG, with DNT being (currently) the biggest risk.  I personally don't like ARK - but I didn't read their whitepaper thoroughly so I'm prepared to be wrong.  As far as I could tell it only rewards the top 51 holders, as only the top 51 get to forge ARK.  This means the devs and their friends and family are perhaps the only beneficiaries.  I gave up the moment I read that.  It's as bad as the 20% kickback that ZCash devs get.  \n\nSaying that, look at ZCash - the extremely controversial kickback to devs hasn't stopped that coin has it?  So ARK could be amazing.  However, I feel that for actual spending coins XMR and IOTA have pretty much got things covered.\n\nIt's your money, don't listen to me or anyone else.  The markets go against everything I think one day and the next everything goes as I thought.  Truth is almost every coin is going up overall.  You could literally invest with a blindfold on, go away for six months and you'll almost certainly have much more than you originally invested.\n\nOr you can sit there and stress all day, constantly checking how much each has gone up or down.  Wishing you'd put everything into Crown (old coin set to rise) instead.  Then feel depressed, and wake up one day having all but given up on your investment, only to click in and see that one of your investments has gone from 0.000050  to 0.154345  overnight - and you've got 50,000 of them, the other has gone from .0064234  to .0843454 - suddenly the world lights up for you.\n",
            "Of course it's legit! This is the [CTO's explanation](https://www.youtube.com/watch?v=vQPmwWhnfSs) of Hcash on their own Youtube channel. It doesn't get any more solid than this:\n\n> Thanks Sam. You mentioned the 7 H's and I will go quickly over them. One of them is quantum resistance which is Hcash will be using the algoritm what will be post quantum resistance. Hcash will be using features from the best currencies in the market. Like the Zcash it will be using the zero knowledge protocol. For instance, it would be using the messaging and encryption of the messages from the example of what Byteball is using to chat. It will be a hive between the currencies so it will be a gateway between all the blockbase and blockless blockchain and then it will talk at the same time and interact with the tangle as well which is IOTA is based on top of it. So this is the hybrid currency that will live forever in this ecosystem and then interact seamlessly and without any enforce of all these existing technologies on the blockchain using its security and then its protection that will stay with it.\n\nI'm not kidding or being selective, this is word for word how he explained it.\n\nTheir business development director has no profile at all on the internet. No LinkedIn page or any other profile. Must be hard developing a business if business partners cannot check out who they're dealing with? In the video he has to check his notes to sum up his education and experience.\n\nTheir [github](https://github.com/HyperCash/Hcash) repository is completely empty. As is their [instagram](https://www.instagram.com/mkthcash/) page, [Reddit account](https://www.reddit.com/user/H_cash/) and other social media links.\n\nI don't know if it's a scam but it sure smells like it. These guys absolutely don't seem to know what they're talking about.",
            "There is literally multiple examples of this. U could say ltc is a competitor to btc, monero and zcash, etheruem and dozens of coins out there that offer assets, etc. Very broad range of coins.",
            "More screeshots:\n\n* [Coins status enable/disable](http://i.imgur.com/0worsuE.png)\n* [Exchange Screen](http://i.imgur.com/koNILsD.png)\n\nThis is a simple working \"ugly\" gui for the [BarterDex Atomic Swap Exchange](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). \n\nA \"pretty\" gui for end users is in the works. For now it is reccomended only for developers and advanced users.\n\nIf you are a Coin developer you can ask for integration by getting in contact at the [barterdex website](http://barterdex.supernet.org/).\n\nSpecial features:\n\n**Quantum trading**:\n\nTraders can place multiple orders using the same funds, allowing them to have multiple orders in various markets and to “catch” dips in the market without having to choose between any coins. Once a trade takes place, however, the user will receive the funds from the order that was actually filled and all other orders that were using the same funds get canceled.\n\n**Liquidity Providers**:\n\nAny user can become a LP node and use Centralised Exchanges to get more liquidity. LP nodes can have their funds on centralised exchange connected to LP node market maker via API keys that will balance liquidity and trades at both sides: centeralised exchange side and decentralised exchange side. \n\n**Auto Portfolio**:\n\nUsers can set their target balance of coins and the dex will keep auto trading in order to reach the target portfolio of coins.\n\n**List of Coins tested & working:**\n\nAnoncoin\nArcticcoin\nArgentum\nBata\nBitcoin\nBitcore\nBitdeal\nBitmark\nCarboncoin\nCreativecoin\nCrown \nDashcore\nDigibyte\nDogecoin\nEinsteinium\nEuropecoin\nFaircoin\nFlorincoin\nFranko \nGamecredits\nGlobaltoken\nHodlcoin\nHuntercoin\nHush\ni0coin\nKomodo\nLbrycrd\nLitecoin\nMachinecoin\nMazacoin\nMonacoin\nMooncoin\nMuecore\nMyriadcoin\nNamecoin\nNavcoin\nOctocoin\nPivx\nRevolvercoin\nSexcoin \nSibcoin\nSmartcoin \nStratis\nSyscoin\nTerracoin\nUnitus\nUnobtanium \nVertcoin\nViacoin\nZcash\nZclassic\nZero\nZetacoin\n\nA lot of other simple bitcoind forks like Peercoin, Blackcoin, etc... can be integrated as soon as the developers add some simple api. \n\nThere is a bounty for Iota integration. \n\nEthereum and Erc20 tokens are planned as well but will take some time\n\nBarterDex is an important component of the [SuperNet platform](https://supernet.org/), in due time the coins supported will enjoy a seamless integration with other SuperNet features.\n\n"
        ],
        "upvotes": [
            1,
            1,
            4,
            1,
            1
        ]
    },
    "ZEN": {
        "full_name": "Zencash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "submissions": [
        "6whiyv",
        "6wmosw",
        "6wkffs",
        "6wi9xv",
        "6wh7dv",
        "6whcxn",
        "6wkny2",
        "6wi3h8",
        "6wiuw0",
        "6wio8k",
        "6wjwrb",
        "6wh5jm",
        "6wj2rh",
        "6wjkw1",
        "6wjbxj",
        "6wo4od",
        "6wml07",
        "6wkrc6",
        "6wjph8",
        "6wjb8e",
        "6wkyra",
        "6wk41u",
        "6wjoan",
        "6wn9hi",
        "6wjcf2",
        "6wgwiq",
        "6wlh2a",
        "6wiw88",
        "6wmeyz",
        "6wldu0",
        "6wjcgr",
        "6whtuq",
        "6wkusu",
        "6wh75j",
        "6wm7id",
        "6wjzt8",
        "6wkqh6",
        "6wjz3l",
        "6wkhhw",
        "6whsay",
        "6wk4zk",
        "6wkqut",
        "6wjwgy",
        "6wjenv",
        "6wmegq",
        "6wiis7",
        "6wmrlp",
        "6wk61i",
        "6wk4g6",
        "6whsjb",
        "6wjghi",
        "6wkcgn",
        "6wja8z",
        "6wnenu",
        "6wmen1",
        "6wl0os",
        "6wkmhz",
        "6wiqhd",
        "6wmssx",
        "6wlh2b",
        "6wk32b",
        "6wjs6u",
        "6wjh47",
        "6wjgfz",
        "6wioii",
        "6wm54l",
        "6wm0ze",
        "6wlx2d",
        "6wkgiq",
        "6wiuyw",
        "6wmut2",
        "6wmhci",
        "6wm7w0",
        "6wm2rz",
        "6wkb95",
        "6wiuo5",
        "6wisxg",
        "6wnhgb",
        "6wn2qq",
        "6wm3dk",
        "6wlntb",
        "6wldbn",
        "6wl6ff",
        "6wkleq",
        "6wjz51",
        "6wj9x1",
        "6wj2ce",
        "6wislz",
        "6whwkq",
        "6wnydx",
        "6wnj83",
        "6wnecv",
        "6wn7gl",
        "6wn3hu",
        "6wmwer",
        "6wmiu2",
        "6wmhge",
        "6wmdhf",
        "6wm9vq",
        "6wm6a2"
    ]
}