{
    "1ST": {
        "full_name": "FirstBlood",
        "mentioned_ids": [
            "6waj6q",
            "6wd4m7",
            "dm74f2q",
            "dm76vqx"
        ],
        "mentioned_times": [
            1503840336.0,
            1503880441.0,
            1503881536.0,
            1503884584.0
        ],
        "text": [
            "Agrello Becomes 1st LegalTech Co. To Launch Its Own Digital Currency",
            "JUST POSTED! FirstBlood.io launches a Partnership Program in the Gaming World!",
            "I'm long on firstblood, super cheap right now ",
            "How does this compare to Gimli.io? I was considering buying into the Gimli ICO but Firstblood already has a service available. Might be the better bet."
        ],
        "upvotes": [
            25,
            4,
            6,
            1
        ]
    },
    "2GIVE": {
        "full_name": "2GIVE",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ABY": {
        "full_name": "ArtByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADT": {
        "full_name": "adToken",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ADX": {
        "full_name": "AdEx",
        "mentioned_ids": [
            "dm6qypn"
        ],
        "mentioned_times": [
            1503856214.0
        ],
        "text": [
            "Ok this will be a noob question but havent really looked much into the wallets, just because i hold only like 90-100$ worth of usd on exchange, but for future I want be secured. \n\nIm currently holding ark, xmr, adx, cvc, dnt and some other coins. which wallet could hold all these coins in one place? Or do i have to download seperate wallets for some coins? Also will I be losing some money by fees everytime i transfer? "
        ],
        "upvotes": [
            3
        ]
    },
    "AEON": {
        "full_name": "Aeon",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AGRS": {
        "full_name": "IDNI Agoras",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "AMP": {
        "full_name": "AMP",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ANT": {
        "full_name": "Aragon",
        "mentioned_ids": [
            "dm7komj",
            "6wghy9"
        ],
        "mentioned_times": [
            1503902640.0,
            1503915818.0
        ],
        "text": [
            "WAVES: A decentralized exchange  \nLEV: Decentralized AND derivatives trading  \nARAGON: Decentralized governance  \nIOTA: This may make blockchain issues moot",
            "district0x will launch a district creation platform to deploy marketplace apps with Aragon governance"
        ],
        "upvotes": [
            3,
            4
        ]
    },
    "APX": {
        "full_name": "Apx",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ARDR": {
        "full_name": "Ardor",
        "mentioned_ids": [
            "dm6yz2e",
            "dm7hoyx",
            "dm7va42"
        ],
        "mentioned_times": [
            1503874352.0,
            1503898652.0,
            1503916912.0
        ],
        "text": [
            "Ardr will have child chains that will be prunable. Problem solved.",
            "These numbers are how much I put into the coins a couple of days ago. I think my portfolio has raised 20$ or something.\n\n100$ - Ardor\n100$ - Stratis\n100$ - OMG\n300$ - LTC",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv."
        ],
        "upvotes": [
            5,
            1,
            3
        ]
    },
    "ARK": {
        "full_name": "Ark",
        "mentioned_ids": [
            "dm7a7f1",
            "dm791eg",
            "dm7cphx",
            "dm76hbj",
            "dm7lojg",
            "dm7ew93",
            "dm7ma3r",
            "dm7tibe",
            "dm6qypn",
            "dm6xp9z",
            "dm6yq4v",
            "dm6zk1r",
            "dm72812",
            "dm7b740",
            "dm6z5ii",
            "dm79ixo",
            "dm7c6in",
            "dm7v65q",
            "dm7va42",
            "dm6ip9z",
            "dm6ris0"
        ],
        "mentioned_times": [
            1503888864.0,
            1503887340.0,
            1503892146.0,
            1503884098.0,
            1503904019.0,
            1503894986.0,
            1503904850.0,
            1503914840.0,
            1503856214.0,
            1503872315.0,
            1503873959.0,
            1503875244.0,
            1503878809.0,
            1503890168.0,
            1503874632.0,
            1503887970.0,
            1503891453.0,
            1503916798.0,
            1503916912.0,
            1503837589.0,
            1503857989.0
        ],
        "text": [
            "Ark, it's extremely new but it has my favorite wallet and I'm excited how user friendly the team makes their products.  Also, Factom for how big it can get and how honest it can keep the mortgage companies. ",
            "I've been a FCT fan for a long time.\n\nArk has only been mentioned once here. It's the tech that will tie them all together.",
            "ARK and/or HCASH. It would crazily transform crypto and solve so many problems with blockchain bridges.\n\nEDIT: Also, ticketing systems like Aventus and Blocktix, as well as Musiconomi/Musicoin",
            "ARK, XRP",
            "Really looking forward to seeing Lisk develop. Honestly feel that this time round the project is going to go full term. One of the best funded projects in the space and with a fast growing roster of developers. \n\nWhen good to go it should be an all in one package for any one with basic computer knowledge to create a simple blockchain application. \n\nThey are working with Taikonauten to rebrand Lisk with a more corporate image. These guys have put out some really clean and fresh looking work for some big companies in the past so it should be good. \n\nAlso have an interest in RISE, a similar approach looking to create \"the WIX of the blockchain\" making it easy to drag and drop and create dApps. \n\nMuch smaller development team and no where near the level of funding that Lisk has, they have recently performed a chain swap from pure Lisk code to Shift-Ark hybrid.",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Bytom and ARK!",
            "DNT, ARK, FCT\n\nBased on the strength of communities and the actual technologies they are developing. ",
            "Ok this will be a noob question but havent really looked much into the wallets, just because i hold only like 90-100$ worth of usd on exchange, but for future I want be secured. \n\nIm currently holding ark, xmr, adx, cvc, dnt and some other coins. which wallet could hold all these coins in one place? Or do i have to download seperate wallets for some coins? Also will I be losing some money by fees everytime i transfer? ",
            "Ltc btc and eth. Thinking about buying some ark, omg, or vtc.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "Ark Xmr Eth",
            "ETH\n\nFCT\n\nARK\n\nTAAS\n\nPART\n\nSNGLS  (think it's gonna take off in the next few weeks) ",
            "Everyone shill your coin go! Here I go: Factom, Ark, BTC and NEO. ",
            "Ark appears to be waking up too.",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Curious, why ARK? There's so many people saying it's going to be huge, but why?",
            "why BAT? I sold mine to buy more ark. What makes it (BAT) good?"
        ],
        "upvotes": [
            27,
            15,
            4,
            4,
            3,
            1,
            1,
            1,
            3,
            9,
            5,
            6,
            4,
            2,
            1,
            1,
            1,
            1,
            3,
            6,
            2
        ]
    },
    "AUR": {
        "full_name": "AuroraCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BAT": {
        "full_name": "Basic Attention Token",
        "mentioned_ids": [
            "dm72w1r",
            "dm7drmr",
            "dm7ffgn",
            "6wbhqs",
            "dm6upyr",
            "dm6sse5",
            "dm6ynxp",
            "dm7mzib",
            "6wbtnb",
            "dm6ris0"
        ],
        "mentioned_times": [
            1503879649.0,
            1503893534.0,
            1503895689.0,
            1503858082.0,
            1503866700.0,
            1503861843.0,
            1503873861.0,
            1503905838.0,
            1503864270.0,
            1503857989.0
        ],
        "text": [
            "IOTA skyrocketing and Neo reaching ETH prices. \n\nSiacoin to get massiv PR bump and adoptation. But this is years out i am afraid. \n\n\nI am also excited for BAT in general. It would be awesome if they could breakthrough. \n\n",
            "IOTA, GNT, BAT - Not your regular Bitcoin copycats.",
            "BAT.",
            "What are known downsides of BAT? 1 LTC award for best answer",
            "The problem I see for BAT is the Brave browser itself. I've used the browser as I looked into supporting BAT. The browser needs work, the amount of bugs that it currently has is staggering. Considering that it is going to try and compete with Google Chrome, it has to be flawless and marketed out the wazoo. When you look at the population as a whole, I don't see average people making the switch. Chrome is the default browser on all Android phones and a majority of people are okay with that or don't even really know that they have options. Even Mozilla Firefox which is arguably the second most popular browser, is miles behind Chrome in popularity and usage. I don't see the population making the switch because people don't like change. ",
            "Just personal speculation, but to me, bat as a coin is only investment worthy if the browser actually becomes a player in the common browsers for most users of the internet. I believe that Chrome will have a strong hold as the google product necessary to reach the internet for a while to come, as well as Safari for mac users and internet explorer for those who are not internet savvy.  \n\nI personally do not see BAT as a browser becoming mainstream, even if it does pay you for the adds, considering that for a while most people, as in 99% of the world, do not know how, or even care, to dabble in crypto currencies.  It's like a bank offering you X amount of $ to sign up for a checking account linked to direct deposit. Most people follow the \"if it ain't broke don't fix it\" rule, and I believe the internet is another one of those things.\n\nI believe that those who dabble in crypto are up to receive coins for certain ads, but I don't ever see BAT being a huge player in terms of their product captivating audiences, seeing as their \"payout\" for using their product is in a currency that most don't know how to use.\n\nThat being said, in terms of crypto and strictly those who know how to go about trading and using said coins, the market is definitely there and people do use their internet browser, so it's all speculation in terms of main stream adoption.",
            "BAT is a really good idea and i am invested in this. \n\nThere is however a huge competition, and thats google.\n\nGoogle is already working on an adblocker on their on which will kick out shitty ads and only display ads which they like (they said they have an agreement, this alliance for better ads and stuff, but i think they can just do what they want).\n\nIf google is too restrictive with their adblocker, brave can skyrocket. If they are not too restrictive, there won't be an incentive to switch to another browser or chrome addon (brave addon). (Noone really cares for earning pennys for watching ads, and the majoritiy does not care for a more fair distribution between publishers and big networks like google). \n\n\nLets say users really want to pay for content, there is another competitor aside from the simple paypal donation button: https://www.youtube.com/watch?v=Hr1eNMq9aDI\nWildspark by synereo will create a micropayment system which can be embedded where content was created.\nBut this project however won't hurt BAT",
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here..",
            "MonteCrypto.eu Poll, is it time to Buy BAT?",
            "why BAT? I sold mine to buy more ark. What makes it (BAT) good?"
        ],
        "upvotes": [
            59,
            7,
            3,
            20,
            17,
            4,
            2,
            1,
            3,
            2
        ]
    },
    "BAY": {
        "full_name": "BitBay",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BCC": {
        "full_name": "Bitcoin Cash",
        "mentioned_ids": [
            "6we1id",
            "dm7u7ix",
            "6wavgk",
            "dm6rvpl",
            "dm7obm3",
            "dm72sq1",
            "dm6i2em"
        ],
        "mentioned_times": [
            1503889418.0,
            1503915836.0,
            1503845925.0,
            1503859118.0,
            1503907695.0,
            1503879536.0,
            1503836304.0
        ],
        "text": [
            "IRS May Consider Bitcoin Cash Fork Taxable Income This Year",
            "Reporting it as income would require disclosing your exact BTC holdings to the IRS.  I think thats the kind of thing that could result is some serious legal challenges.  \n\nFor example if Satoshi happens to be a US citizen would he be required to reveal himself and claim a million Bitcoin Cash as income on his tax return despite never having sold any of those coins?  \n\nIf I owned a single 25 BTC physical coin that I bought for $50 or so back in the day am I required to crack it open and sell off enough to cover the tax?  Same deal if I mined coins years ago that I have never sold.\n\nWhat if Bitcoin Cash dies before the end of the year does everyone who had bitcoins at the time of the split just owe a shit load of tax anyway.  You can't write off the loss if you can't sell it.  \n\nI sat with my tax guy for a few hours talking about this and a few other crypto issues and I don't think this is a likely outcome.  Not to give the IRS the benefit of thinking they will make the sane choice, but there are just so many issues with doing it that way.  Where if they just consider it something more less gifted to you for free with 0 basis it's pretty simple to deal with.\n\n",
            "It is now 250% more PROFITABLE to mine BITCOIN vs bitcoin cash. FOUR hours since bitcoin cash found a block... end of a SHITCOIN?",
            "i have no clue why anyone would fall for bitcoin cash.",
            "Let's do the math:\n\nThe biggest blocksize in Bitcoin right now is Bitcoin Cash with 8MB.\n\nIf a block is found every 10 minutes, then you have 144 10-minute intervals in a 24 hour day.\n\nThat's 8MB * 144 = 1152\n\nSo you can increase the blocksize by 1.152GB in a day or roughly 420GB in a year.\n\nThat sounds a lot?\n\nWell - a 10TB drive currently costs $300. To fill the entire 10TB drive at that rate it will take 23 years. 120TB drives are set to come by 2020. God knows what technology we'll have by 2040.\n\nYour FUD is unwarranted and unwelcome. Do basic mathematics before going around spreading false information. Ticking timebomb? Far from it. A medium corporate database today already has a 10TB size. That's peanuts for a technology such as Bitcoin, or did you think you will 'bank the world' with 100GB forever?",
            "Bitcoin, litecoin, monero plus recently Bitcoin cash.\n\nAs I am still looking for useful crypto I added recently iota and decred as high risk one but with potential.\n\nI reckon I got to many but that is it at the moment. ",
            "That's a good-looking portfolio, poised for solid growth. \n\nI don't see Bitcoin Cash lasting long-term. It's great that you acquired it at no cost. I'd just keep an eye out for downward trends and cash out. I haven't been a fan of ETH since they broke their \"immutable\" contract with DAO, and they keep adding features, trying to be all things to all people. You have only 6.9% and I think it can still make money short term, but it's another one I'd keep an eye on. Some of those smaller ones I don't know about. But overall, that looks solid."
        ],
        "upvotes": [
            16,
            2,
            12,
            7,
            2,
            1,
            3
        ]
    },
    "BCY": {
        "full_name": "BitCrystals",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BITB": {
        "full_name": "BitBean",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BLITZ": {
        "full_name": "Blitzcash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BLK": {
        "full_name": "BlackCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BLOCK": {
        "full_name": "BlockNet",
        "mentioned_ids": [
            "dm7iytd",
            "6wavgk",
            "dm7obm3",
            "dm7nbnm",
            "dm7va42",
            "dm7mwrx"
        ],
        "mentioned_times": [
            1503900328.0,
            1503845925.0,
            1503907695.0,
            1503906307.0,
            1503916912.0,
            1503905735.0
        ],
        "text": [
            "Noone will risk compatibility issues with a new browser easily. Additionally many will patch around ad removal, like youtube does really well\n\nFurthermore it uses ethereum, known best as [chain of liars and thieves](https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb) and [centralization](https://www.reddit.com/r/ethereumfraud/comments/6bgvqv/faq_what_exactly_is_the_fraud_in_ethereum/) - which means it's not secure for any use case unless you're the one it's centralized around. It's one of the slower blockchains with most bloat with infinitely big attack surface prone to significant downtimes, rarely up for more than few months at a time without enormous issues. Can't really trust a developer who would ever rely on something that flawed with hundreds if not thousands of superior alternatives.\n\nICO's are a centrally controlled funding in a field built around decentralization and plenty of other funding options. Good luck firing the developers for being bad or malicious when they are the only ones with funding forcing the tokens to die in value or succeed through misinformation like the centralized platform it was built on did. They in the end will decide which contracts are real and which ones are outdated or \"illegal\" due to that. No one can say how long misinformation campaign success can last.\n\nAdvertisement is a dying industry that requires centralization to push it.\n\nGoogle plans some of similar [features](http://www.latimes.com/business/la-fi-tn-google-chrome-ad-block-20170602-story.html).",
            "It is now 250% more PROFITABLE to mine BITCOIN vs bitcoin cash. FOUR hours since bitcoin cash found a block... end of a SHITCOIN?",
            "Let's do the math:\n\nThe biggest blocksize in Bitcoin right now is Bitcoin Cash with 8MB.\n\nIf a block is found every 10 minutes, then you have 144 10-minute intervals in a 24 hour day.\n\nThat's 8MB * 144 = 1152\n\nSo you can increase the blocksize by 1.152GB in a day or roughly 420GB in a year.\n\nThat sounds a lot?\n\nWell - a 10TB drive currently costs $300. To fill the entire 10TB drive at that rate it will take 23 years. 120TB drives are set to come by 2020. God knows what technology we'll have by 2040.\n\nYour FUD is unwarranted and unwelcome. Do basic mathematics before going around spreading false information. Ticking timebomb? Far from it. A medium corporate database today already has a 10TB size. That's peanuts for a technology such as Bitcoin, or did you think you will 'bank the world' with 100GB forever?",
            "also try this service [CoinBalance.org](https://coinbalance.org/) (fully free). It supports ROI, adding public wallet address grabbing a balance from an existing block-chain, or most popular exchanges.",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "atomic swaps have existed for a long time now.\n\nblocknet and supernet have made it their specialty by serving as inbetween chain and matching orders for liquidity.\n\nI think blocknet has got it working for like 10-15 of them.\n\nNote, they are typically quite slow as require on chain tx on each one, not like traditional exchanges or even fast dex like bts dex.\n\nyou can also do p2p atomic swapping depending on blockchain.\n\n\nIt's pretty simple conceptually but requires some features on chains to make it easier and to account for various designs of blockchains - e.g. \"when is it considered safe\".\n\nhttps://en.bitcoin.it/wiki/Atomic_cross-chain_trading\n\nhttps://bitcoinmagazine.com/articles/atomic-swaps-how-the-lightning-network-extends-to-altcoins-1484157052/\n\nhttps://themerkle.com/what-is-an-atomic-swap/\n\nhttps://www.coindesk.com/cross-blockchain-trades-lightning-gives-new-life-atomic-swaps/\n\nhttps://steemit.com/cryptocurrency/@digicrypt/atomic-swaps-future-of-crypto\n\nhttps://www.reddit.com/r/theblocknet/comments/676buj/ask_anything_about_blocknet_qa/"
        ],
        "upvotes": [
            1,
            12,
            2,
            1,
            3,
            3
        ]
    },
    "BNT": {
        "full_name": "Bancor",
        "mentioned_ids": [
            "dm7mijb",
            "dm7b740",
            "dm7ptst"
        ],
        "mentioned_times": [
            1503905178.0,
            1503890168.0,
            1503909691.0
        ],
        "text": [
            "Ethereum, but not so much for its own sake (it is my favorite platform FYI), but for what it enables.\n\nOn it, bancor. \n\nOutside of ethereum, I'm watching dash and monero closely.",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "That's actually a very interesting idea. I think it could be done on some way on an existing service that let's you launch your own tokens. Now only tokens would be shares of the fund. You'd also want to decide if you want to make the investments public and record them on ledger somewhere.\n\nI think Bancor allows you to create a basket from selection of cryptos/tokens, and you can buy a share of that basket as a token. That might be an alternative route to do it."
        ],
        "upvotes": [
            1,
            2,
            1
        ]
    },
    "BRK": {
        "full_name": "Breakout",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BRX": {
        "full_name": "Breakout Stake",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BSD": {
        "full_name": "BitSend",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTA": {
        "full_name": "Bata",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTCD": {
        "full_name": "BitcoinDark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BTS": {
        "full_name": "BitShares",
        "mentioned_ids": [
            "dm7sf4c",
            "dm7hag2",
            "dm70vcv",
            "dm7mwrx"
        ],
        "mentioned_times": [
            1503913271.0,
            1503898119.0,
            1503877077.0,
            1503905735.0
        ],
        "text": [
            "HERO (new market pegged asset on BitShares) because it may very well be the answer to the question of \"How can we successfully sell cryptocurrency to Joe the plumber along with all of his friends, and all of their friends?\" It is literally the only cryptocurrency based financial instrument that grants people something flat out unavailable to them from the legacy financial system: a completely liquid savings account with 5% APR. And it's on a blockchain that can scale to MasterCard levels of tx/sec today - as in right now, not someday in the future when a scaling solution that may or may not work is developed. \n\nOther graphene chains - Peerplays, Muse, Steem, and Calibrae (a upcoming fork of STEEM that relieves whales who mined a shitload during the early hyperinflationary period of their advantage, placing those funds in the reward pool).\n\nMonero because fungibility. \n\nEOS because scalability.",
            "I didn't read in detail about lisk's version of dpos and I'm a little shocked\n\nIt rewards voting for people based on their share?!\n\nIsn't that like bribery? Someone with could get a ton of voting power just by offering high payments alone.\n\nThis is specifically avoided in bitshares (creator of dpos) to even out the choices to where individual actions are most important requiring some research. And if you can't do the research to vote for witnesses/dao/, no time, you find a proxy you like who's job it is to vote and monitor witnesses behavior for you. Witnesses do sometimes burn some % of their reward to deflate supply (which is capped).\n\n",
            "Ok, let's say you look at Bitshares (I'm picking this almost at random - it may be a great coin or a terrible one - I don't know much about it).  But the current price is only 0.13 cents.  You think, \"awesome, it's a bargain.  At only 0.13 cents, it's got a lot of room to grow.  Maybe it will go to $1.30 or even $10.  Maybe even a $100 - I mean Bitcoin is worth over $4000 so it's possible.\"\n\nBut then you look at the coins in circulation which is 2.6 billion.  2.6 billion times 0.13 cents brings you to the current market cap of $350 million.\n\nSo, let's see what happens to the market cap if it the coin value reaches your hoped for highs:\n\n* At $1.30, the market cap becomes $3.5 billion.  That's position #3 and worth more than Litecoin.  Is that possible? I don't know much about Bitshares but Litecoin is a pretty solid coin with high adoption.\n\n* At $10, the market cap becomes over $30 billion dollars.  That's about the value of Ethereum.  Is that likely? \n\n* At $100, the market cap becomes over $300 billion dollars.  That's more than three times the total worth of Bitcoin.\n\nAgain, I don't know much about Bitshares but it looks pretty unlikely to me that it would be worth more than Bitcoin.  Or Ethereum for that matter.\n",
            "atomic swaps have existed for a long time now.\n\nblocknet and supernet have made it their specialty by serving as inbetween chain and matching orders for liquidity.\n\nI think blocknet has got it working for like 10-15 of them.\n\nNote, they are typically quite slow as require on chain tx on each one, not like traditional exchanges or even fast dex like bts dex.\n\nyou can also do p2p atomic swapping depending on blockchain.\n\n\nIt's pretty simple conceptually but requires some features on chains to make it easier and to account for various designs of blockchains - e.g. \"when is it considered safe\".\n\nhttps://en.bitcoin.it/wiki/Atomic_cross-chain_trading\n\nhttps://bitcoinmagazine.com/articles/atomic-swaps-how-the-lightning-network-extends-to-altcoins-1484157052/\n\nhttps://themerkle.com/what-is-an-atomic-swap/\n\nhttps://www.coindesk.com/cross-blockchain-trades-lightning-gives-new-life-atomic-swaps/\n\nhttps://steemit.com/cryptocurrency/@digicrypt/atomic-swaps-future-of-crypto\n\nhttps://www.reddit.com/r/theblocknet/comments/676buj/ask_anything_about_blocknet_qa/"
        ],
        "upvotes": [
            2,
            0,
            13,
            3
        ]
    },
    "BURST": {
        "full_name": "BURSTCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "BYC": {
        "full_name": "Bytecent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CANN": {
        "full_name": "CannabisCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CFI": {
        "full_name": "Cofound.it",
        "mentioned_ids": [
            "dm7b740"
        ],
        "mentioned_times": [
            1503890168.0
        ],
        "text": [
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)"
        ],
        "upvotes": [
            2
        ]
    },
    "CLAM": {
        "full_name": "CLAMs",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CLOAK": {
        "full_name": "CloakCoin",
        "mentioned_ids": [
            "dm7eciy"
        ],
        "mentioned_times": [
            1503894277.0
        ],
        "text": [
            "I know i'm just shilling my coin but Cloakcoin has amazing potential. Privacy is and will be a huge concern and while monero has great privacy it is not user friendly at all and doesn't look like it will be anytime soon. Cloak is very user friendly, has great privacy and is a POS coin so doesn't burn electricity like all the POW coins. They will be going fully open source soon and could be a contender in the top then of crypto very soon. "
        ],
        "upvotes": [
            -1
        ]
    },
    "CLUB": {
        "full_name": "ClubCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "COVAL": {
        "full_name": "Circuits of Value",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CPC": {
        "full_name": "CapriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRB": {
        "full_name": "CreditBit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CRW": {
        "full_name": "Crown",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CURE": {
        "full_name": "CureCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "CVC": {
        "full_name": "Civic",
        "mentioned_ids": [
            "dm7mzyl",
            "dm7fjyk",
            "dm7ew93",
            "dm6qypn"
        ],
        "mentioned_times": [
            1503905855.0,
            1503895856.0,
            1503894986.0,
            1503856214.0
        ],
        "text": [
            "Iota, FCT, PTOY, and Civic ",
            "CVC is neat it deals with privacy and anonymity - hot commodities right now ",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Ok this will be a noob question but havent really looked much into the wallets, just because i hold only like 90-100$ worth of usd on exchange, but for future I want be secured. \n\nIm currently holding ark, xmr, adx, cvc, dnt and some other coins. which wallet could hold all these coins in one place? Or do i have to download seperate wallets for some coins? Also will I be losing some money by fees everytime i transfer? "
        ],
        "upvotes": [
            7,
            3,
            1,
            3
        ]
    },
    "DAR": {
        "full_name": "Darcrus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DASH": {
        "full_name": "Dash",
        "mentioned_ids": [
            "dm7mijb",
            "dm77zpk",
            "dm70rkv",
            "dm6yq4v",
            "dm72812",
            "dm6und6",
            "dm7va42",
            "dm7u0fc",
            "dm7610l"
        ],
        "mentioned_times": [
            1503905178.0,
            1503885988.0,
            1503876935.0,
            1503873959.0,
            1503878809.0,
            1503866541.0,
            1503916912.0,
            1503915565.0,
            1503883528.0
        ],
        "text": [
            "Ethereum, but not so much for its own sake (it is my favorite platform FYI), but for what it enables.\n\nOn it, bancor. \n\nOutside of ethereum, I'm watching dash and monero closely.",
            "The nodes just need enough money to pay for sufficient storage. In dash the MasterNodes earn plenty to do so. So yea Dash has this solved.",
            "I usually use LTC or Dash. Fast and cheap, but depends on the withdrawal fee.\nI believe Kraken even allows the use of the Dash Instantsend if you choose. Although you'll have to wait for full confirmations anyway before you can trade them.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "I would say that you need to buy at least 5 coins such as Factom, Dash, Monero and Stratis in addition to ETH. All have good teams and clear functionalities",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Dash has a really good intro video series. Of course, all cryptos are different, but it's a good primer.\n\nhttps://www.youtube.com/watch?v=e7UwwcCKj4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod",
            "I'm starting to feel the same concerns. Read [this discussion](https://www.reddit.com/r/CryptoCurrency/comments/6w5zyp/lets_read_the_wikipedia_for_dotcom_bubble_and_see/) from yesterday about the dot-com bubble, investor behavior is eerily similar and it's starting to get scary. Who do we have to convince to keep this momentum going? Should we try to explain the blockchain to our Grandmas?\n\nFurthermore, how is mass adoption possible when nobody here wants to spend their fixed-supply Dash or Bitcoin on things like toothbrushes and coffee? We're all hodling for new cars and early retirement. \n\nHow can we expect mass adoption as a currency if everyone will hoard it? Why would businesses want to accept a currency that discourages spending? It's starting to seem we have a lot of questions that need answering before we can convince Grandma this is best for her and not just us."
        ],
        "upvotes": [
            1,
            1,
            2,
            5,
            4,
            0,
            3,
            1,
            2
        ]
    },
    "DCR": {
        "full_name": "Decred",
        "mentioned_ids": [
            "6wf3ff",
            "dm7rjav",
            "dm7kxlu",
            "dm6yq4v",
            "dm72sq1"
        ],
        "mentioned_times": [
            1503900105.0,
            1503911980.0,
            1503902994.0,
            1503873959.0,
            1503879536.0
        ],
        "text": [
            "It's official! Decred is coming to LedgerHQ's Blue and Nano S hardware wallets.",
            "DCR is my crypto investment. This is the best dev team in the industry. OG Bitcoin devs that have effectively solved the governance issue that will plague BTC forever.\n\nForget the guy down below, this is truly undervalued.",
            "Waiting for the inevitable comments to come saying:\n\nTHIS WILL BE WORTH MORE THAN BITCOIN IN ONE YEAr\n\nand\n\nSELL YOUR HOUSE, SELL YOUR CAR, SELL YOUR MAMA PUT YOUR NET WORTH IN DECRED IT'S EXTREMELY UNDERVALUED.\n\nSure DECRED hype isn't as undeserving as some other pump n' dump coins on here, but I personally think this subreddit's users are pretty bad at getting trapped in their own world of hype.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "Bitcoin, litecoin, monero plus recently Bitcoin cash.\n\nAs I am still looking for useful crypto I added recently iota and decred as high risk one but with potential.\n\nI reckon I got to many but that is it at the moment. "
        ],
        "upvotes": [
            19,
            3,
            -4,
            5,
            1
        ]
    },
    "DCT": {
        "full_name": "DECENT",
        "mentioned_ids": [
            "dm77c4k"
        ],
        "mentioned_times": [
            1503885152.0
        ],
        "text": [
            "with title:\nhttp://i.imgur.com/eACYIR2.png\n\nwithout:\nhttp://i.imgur.com/bylhP7k.png\n\nYou'll never make everyone happy with a limited selection of coins unless you put every shitcoin imaginable on there, which is what the current banner does. I chose current top 20 coins that have had a strong showing and decent stability over the past few years. Please don't whine about what's missing. I intentionally kept it limited. I have no personal stake in any of these coins except a tiny amount of bitcoin/eth (less than $100 each). 99% of anything I'm invested in are ERC20 tokens not represented here.\n\nIf people like it and it gets chosen, feel free to throw something at me here:\n16MaonXLBcxscLJftbGPidmzfq3iB2u2fd"
        ],
        "upvotes": [
            3
        ]
    },
    "DGB": {
        "full_name": "Digibyte",
        "mentioned_ids": [
            "dm72812",
            "dm6y1x5",
            "dm7nncg"
        ],
        "mentioned_times": [
            1503878809.0,
            1503872875.0,
            1503906767.0
        ],
        "text": [
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "90% BTC\n\n9.5% Omise-Go\n\n0.5% (Combination of Dogecoin, Vertcoin,DigiByte, Litecoin)",
            "Add Syscoin & Digibyte to the list for coins on SegWit and using cross chain atomic swaps. On my cell now but had the same thought earlier and I can link to a few articles."
        ],
        "upvotes": [
            4,
            2,
            1
        ]
    },
    "DGD": {
        "full_name": "DigixDAO",
        "mentioned_ids": [
            "dm7lavw"
        ],
        "mentioned_times": [
            1503903507.0
        ],
        "text": [
            "I can't believe DGD hasn't appeared here yet. I'm really, really excited for the launch, that it's going to happen in one or two months. I think it can change how exchanges are used, especially the new decentralized ones."
        ],
        "upvotes": [
            1
        ]
    },
    "DMD": {
        "full_name": "Diamond",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DOGE": {
        "full_name": "Dogecoin",
        "mentioned_ids": [
            "dm6y1x5",
            "dm7b740"
        ],
        "mentioned_times": [
            1503872875.0,
            1503890168.0
        ],
        "text": [
            "90% BTC\n\n9.5% Omise-Go\n\n0.5% (Combination of Dogecoin, Vertcoin,DigiByte, Litecoin)",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)"
        ],
        "upvotes": [
            2,
            2
        ]
    },
    "DOPE": {
        "full_name": "DopeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DRACO": {
        "full_name": "DT Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DTB": {
        "full_name": "Databits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "DYN": {
        "full_name": "Dynamic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EBST": {
        "full_name": "eBoost",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EDG": {
        "full_name": "Edgeless",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EFL": {
        "full_name": "ElectronicGulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EGC": {
        "full_name": "EverGreenCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC": {
        "full_name": "EmerCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EMC2": {
        "full_name": "Einsteinium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ENRG": {
        "full_name": "EnergyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ERC": {
        "full_name": "EuropeCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ETC": {
        "full_name": "Ethereum Classic",
        "mentioned_ids": [
            "dm73j4f",
            "dm7opc6",
            "dm72v9o",
            "dm6vqtr",
            "dm6qsxt",
            "dm7btp5",
            "dm7b740"
        ],
        "mentioned_times": [
            1503880465.0,
            1503908195.0,
            1503879622.0,
            1503868778.0,
            1503855700.0,
            1503890989.0,
            1503890168.0
        ],
        "text": [
            "what I'm watching:\n\n* Wagerr: Betting platform using crypto. Easy to understand use-case and has real-world value today. Siacoin, Golem, and other projects have interesting use-cases but it's still up for grabs whether people will be interested in decentralized storage and computing, etc. People are interested in betting on sports today, so the use-case already exists. \n* Santiment: Another one I've been tracking for a while. They're attempting to be the Bloomberg Terminal of the crypto world. Definitely see the use-case as it's difficult to find information about different cryptocurrencies from a centralized location.  \n* IOTA: No fees, network gets faster the more people use it. No miners. That's a big fucking deal. Technology is fundamentally different from other coins, and it's not just another shitty ERC20 copy-paste. ",
            "🌮 coin. We're not even working but yeah.. fucking tacos dude.\n\n\nKidding , I've been into cash lately. After 4 years of this shit, I'm going back to cash. Fuck ledgers, I don't care about software to help lawyers and cops and salesman, etc.\n\n",
            "Pretty cool idea in theory man. \n\nYou need better marketing though; better copy. More focus on benefit as opposed to features. \n\nAnd/or perhaps you're trying to solve a problem that not enough people view as very problematic at this point in time. \n\nWho's your target audience? Would those who would benefit from something like this be technologically able/inclined to use it? \n\nEtc. \n\nWay to be on distributing back the ETH. Stay classy. \n\nAnd oh--you didn't fail. You just learned you need to do things differently next time. You learned what NOT to do here.\n\nSo get back to the lab, refine your idea, read the book The Science of Getting Rich by Wallace Wattles and help the world out. ",
            "I see three main downsides:\n\n&nbsp;\n\n1) Mainstream penetration - nowadays a browser is more important than the OS, so once someone is used to something, it's hard to change\n\n&nbsp;\n\n2) Click fraud(many bots will be watching ads)\n\n&nbsp;\n\n3) It has to fight with giants such as Google/FB/Microsoft/etc",
            "Anyone who didn't learn from ethereum classic is a fucking idiot. \n\n*Edit: So many fucking idiots*",
            "Coinbase (and Gemini) are great on-ramps for people unfamiliar with crypto. I highly recommend them to anyone just getting into it.\n\nI'd also take a lot of the reviews with heavy doses of salt. I see so many people bitching about Coinbase closing their accounts, etc and not understanding that the company will follow US KYC and AML laws to the letter. That means if you buy on Coinbase and transfer funds to known gambling sites or questionable exchanges, you're putting your account at risk. They've also grown exponentially over the last year and they, like all exchanges, have had a rough time keeping up with customer service issues. I for one have never had a single issue with my account and transfers in and out (some very large) have been fast and easy - no issues.\n\nI know I sound like a Coinbase apologist here but as someone who works in the fintech space, I have a soft spot for what a shitshow it must be at Coinbase on some days trying to deal with the huge flood of new users who don't know jack about cryptocurrency.\n\nAs others in the thread have said, other exchanges are much better once you've gone down the rabbit hole. GDAX (owned by Coinbase), bittrex, and Kraken are the other three I recommend depending on what my friends are interested in trading. Good luck with your investments!",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)"
        ],
        "upvotes": [
            22,
            1,
            13,
            5,
            -2,
            7,
            2
        ]
    },
    "ETH": {
        "full_name": "Ethereum",
        "mentioned_ids": [
            "dm784ke",
            "dm72w1r",
            "dm790al",
            "dm7cigd",
            "dm7f2go",
            "dm7mijb",
            "dm7qtiu",
            "dm7r8uo",
            "dm77c4k",
            "dm7q0ez",
            "dm72v9o",
            "dm758kt",
            "dm70vcv",
            "dm7iytd",
            "dm6qsxt",
            "dm72pgd",
            "dm78ba7",
            "6walv5",
            "dm6l6ea",
            "dm6oh5j",
            "dm6ovgx",
            "dm6xp9z",
            "dm70ir5",
            "dm6zk1r",
            "dm72812",
            "dm727zc",
            "dm73xiq",
            "dm78v45",
            "dm7b740",
            "dm6z5ii",
            "dm79ixo",
            "dm7mzib",
            "dm7p6ba",
            "dm6und6",
            "dm7va42",
            "dm7w6cb",
            "dm7a91u",
            "dm7fb9j",
            "dm79xy8",
            "dm6i2em",
            "dm7kbtb"
        ],
        "mentioned_times": [
            1503886165.0,
            1503879649.0,
            1503887299.0,
            1503891885.0,
            1503895213.0,
            1503905178.0,
            1503910994.0,
            1503911564.0,
            1503885152.0,
            1503909933.0,
            1503879622.0,
            1503882524.0,
            1503877077.0,
            1503900328.0,
            1503855700.0,
            1503879420.0,
            1503886402.0,
            1503841478.0,
            1503841596.0,
            1503848875.0,
            1503849948.0,
            1503872315.0,
            1503876596.0,
            1503875244.0,
            1503878809.0,
            1503878807.0,
            1503880943.0,
            1503887110.0,
            1503890168.0,
            1503874632.0,
            1503887970.0,
            1503905838.0,
            1503908824.0,
            1503866541.0,
            1503916912.0,
            1503917906.0,
            1503888925.0,
            1503895532.0,
            1503888515.0,
            1503836304.0,
            1503902151.0
        ],
        "text": [
            "This is not investment advice, just the coins I like a lot.\n\nLTC, ETH, XMR, NEO and OMG ",
            "IOTA skyrocketing and Neo reaching ETH prices. \n\nSiacoin to get massiv PR bump and adoptation. But this is years out i am afraid. \n\n\nI am also excited for BAT in general. It would be awesome if they could breakthrough. \n\n",
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "For now I hold half of my coins in a BTC paperwallet, the rest of my long term holdings are divided between NEO, ETH and GBYTE. Some coins I may hold too, but for now I use them for trading until I get a clearer picture on them, like DNT, BAS, OMG, BNB, ICN, FCT and others.",
            "IXT. \n\nInsurex will allow Insurance companies to buy/sell insurance to each other. \n\nIt's aiming to provide a valuable service to a massive industry, built on top of the Eth network. \n\nAnd after the ICO they haven't hyped it too much. Makes me think they're playing the long game. \n\nInsurance is a very risk averse industry, so them not pumping and dumping IXT is a very good move. Hopefully we'll hear something from them in the coming months. ",
            "Ethereum, but not so much for its own sake (it is my favorite platform FYI), but for what it enables.\n\nOn it, bancor. \n\nOutside of ethereum, I'm watching dash and monero closely.",
            "Ethereum\n",
            "Monaco. A well designed, functional btc/eth>fiat debit card would be very good for the publicity of cryptocurrency as a whole. I'm most excited for this one as I'll actually be using their technology asap (hopefully)",
            "with title:\nhttp://i.imgur.com/eACYIR2.png\n\nwithout:\nhttp://i.imgur.com/bylhP7k.png\n\nYou'll never make everyone happy with a limited selection of coins unless you put every shitcoin imaginable on there, which is what the current banner does. I chose current top 20 coins that have had a strong showing and decent stability over the past few years. Please don't whine about what's missing. I intentionally kept it limited. I have no personal stake in any of these coins except a tiny amount of bitcoin/eth (less than $100 each). 99% of anything I'm invested in are ERC20 tokens not represented here.\n\nIf people like it and it gets chosen, feel free to throw something at me here:\n16MaonXLBcxscLJftbGPidmzfq3iB2u2fd",
            "It's funny to see eth attempt more DAO's after theirs failed so hard. I guess there's comfort in knowing nothing on eth is final and can be reversed. Meanwhile DAO's predating eth's attempts are running just fine.",
            "Pretty cool idea in theory man. \n\nYou need better marketing though; better copy. More focus on benefit as opposed to features. \n\nAnd/or perhaps you're trying to solve a problem that not enough people view as very problematic at this point in time. \n\nWho's your target audience? Would those who would benefit from something like this be technologically able/inclined to use it? \n\nEtc. \n\nWay to be on distributing back the ETH. Stay classy. \n\nAnd oh--you didn't fail. You just learned you need to do things differently next time. You learned what NOT to do here.\n\nSo get back to the lab, refine your idea, read the book The Science of Getting Rich by Wallace Wattles and help the world out. ",
            "I would have tried for more professional pictures in your bio. And the FOOD tokens should be bought behind the scenes. If you could buy the food with fiat and have it buy and burn some FOOD tokens with every transaction then you would have had a better structure. Nobody can imagine themselves or farmers buying food with FOOD tokens. Should have been an option between fiat, Ethereum, Bitcoin or the food token (which gets you a slight discount). \n\nBetter luck next time!",
            "Ok, let's say you look at Bitshares (I'm picking this almost at random - it may be a great coin or a terrible one - I don't know much about it).  But the current price is only 0.13 cents.  You think, \"awesome, it's a bargain.  At only 0.13 cents, it's got a lot of room to grow.  Maybe it will go to $1.30 or even $10.  Maybe even a $100 - I mean Bitcoin is worth over $4000 so it's possible.\"\n\nBut then you look at the coins in circulation which is 2.6 billion.  2.6 billion times 0.13 cents brings you to the current market cap of $350 million.\n\nSo, let's see what happens to the market cap if it the coin value reaches your hoped for highs:\n\n* At $1.30, the market cap becomes $3.5 billion.  That's position #3 and worth more than Litecoin.  Is that possible? I don't know much about Bitshares but Litecoin is a pretty solid coin with high adoption.\n\n* At $10, the market cap becomes over $30 billion dollars.  That's about the value of Ethereum.  Is that likely? \n\n* At $100, the market cap becomes over $300 billion dollars.  That's more than three times the total worth of Bitcoin.\n\nAgain, I don't know much about Bitshares but it looks pretty unlikely to me that it would be worth more than Bitcoin.  Or Ethereum for that matter.\n",
            "Noone will risk compatibility issues with a new browser easily. Additionally many will patch around ad removal, like youtube does really well\n\nFurthermore it uses ethereum, known best as [chain of liars and thieves](https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb) and [centralization](https://www.reddit.com/r/ethereumfraud/comments/6bgvqv/faq_what_exactly_is_the_fraud_in_ethereum/) - which means it's not secure for any use case unless you're the one it's centralized around. It's one of the slower blockchains with most bloat with infinitely big attack surface prone to significant downtimes, rarely up for more than few months at a time without enormous issues. Can't really trust a developer who would ever rely on something that flawed with hundreds if not thousands of superior alternatives.\n\nICO's are a centrally controlled funding in a field built around decentralization and plenty of other funding options. Good luck firing the developers for being bad or malicious when they are the only ones with funding forcing the tokens to die in value or succeed through misinformation like the centralized platform it was built on did. They in the end will decide which contracts are real and which ones are outdated or \"illegal\" due to that. No one can say how long misinformation campaign success can last.\n\nAdvertisement is a dying industry that requires centralization to push it.\n\nGoogle plans some of similar [features](http://www.latimes.com/business/la-fi-tn-google-chrome-ad-block-20170602-story.html).",
            "Anyone who didn't learn from ethereum classic is a fucking idiot. \n\n*Edit: So many fucking idiots*",
            "As the value of ETH/USD goes up of course you're going to get a poorer deal at the end of an ICO compared to the start. If Everex does reach it's hard cap, its market value will still only be about $23mil which is very low for a company that has a very useful working product.",
            "I got myself one of those TimeMints by contributing 1 ETH. I hope I can make some profit of it but I am very skeptical now too.",
            "Bittrex question: Are BTC and ETH the only coins I can use to buy alt coins?",
            "yes bittex only accoet btc or eth, i would avoid btx atm cause their fee is much higher then sending eth ",
            "Is it cheaper to buy ETH on coinbase, transfer it to bittrex, and then go from ETH -> BTC? Seems like BTC fees are higher.",
            "How do you buy with ETH on Bittrex and bypass BTC? When you purchase a coin there is no ETH option only BTC right?",
            "Ltc btc and eth. Thinking about buying some ark, omg, or vtc.",
            "100% ETH",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "ETH 3.78, LTC 4.34, DNT 9498.2",
            "200% eth\n\nEdit: and some MTL",
            "Omg, lisk, iota, eth, btc, Bch, sia, xrp, dnt and safex",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "Ark Xmr Eth",
            "ETH\n\nFCT\n\nARK\n\nTAAS\n\nPART\n\nSNGLS  (think it's gonna take off in the next few weeks) ",
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here..",
            "I don't have it broken down into % but:\nNEO (vast majority)\nDNT\nWGR\nBTC\nETH",
            "I would say that you need to buy at least 5 coins such as Factom, Dash, Monero and Stratis in addition to ETH. All have good teams and clear functionalities",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "ethereum popularizing censorship and centralization - its core principles - so nothing will change, just have expensive overhead for no reason\n\nit's culture of marketing of bad ideas and bad tech has already succeeded in popularizing premines via ico's",
            "ETH has gone up almost 3000%. Virtually any major coin would've been great to buy into at the beginning of the year. ",
            "That fucking line made me buy eth at 420 dollars. Fuck your advice. Patience is key.",
            "There's 12 ETH in the order book, I wouldn't order the Lambo yet.",
            "That's a good-looking portfolio, poised for solid growth. \n\nI don't see Bitcoin Cash lasting long-term. It's great that you acquired it at no cost. I'd just keep an eye out for downward trends and cash out. I haven't been a fan of ETH since they broke their \"immutable\" contract with DAO, and they keep adding features, trying to be all things to all people. You have only 6.9% and I think it can still make money short term, but it's another one I'd keep an eye on. Some of those smaller ones I don't know about. But overall, that looks solid.",
            "A little more ETH?"
        ],
        "upvotes": [
            65,
            59,
            38,
            6,
            3,
            1,
            1,
            1,
            3,
            0,
            13,
            3,
            13,
            1,
            -2,
            2,
            1,
            5,
            3,
            2,
            2,
            9,
            7,
            6,
            4,
            3,
            3,
            2,
            2,
            1,
            1,
            1,
            1,
            0,
            3,
            1,
            9,
            8,
            1,
            3,
            1
        ]
    },
    "EXCL": {
        "full_name": "ExclusiveCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "EXP": {
        "full_name": "Expanse",
        "mentioned_ids": [
            "dm76839"
        ],
        "mentioned_times": [
            1503883775.0
        ],
        "text": [
            "Tokenlab and EXP.LIFE\nwww.borderlesscorp.com/docs/tokenlab-whitepaper.pdf\nwww.borderlesscorp.com/docs/explife-whitepaper.pdf"
        ],
        "upvotes": [
            1
        ]
    },
    "FAIR": {
        "full_name": "FairCoin",
        "mentioned_ids": [
            "dm6ynxp",
            "dm7vvun"
        ],
        "mentioned_times": [
            1503873861.0,
            1503917570.0
        ],
        "text": [
            "BAT is a really good idea and i am invested in this. \n\nThere is however a huge competition, and thats google.\n\nGoogle is already working on an adblocker on their on which will kick out shitty ads and only display ads which they like (they said they have an agreement, this alliance for better ads and stuff, but i think they can just do what they want).\n\nIf google is too restrictive with their adblocker, brave can skyrocket. If they are not too restrictive, there won't be an incentive to switch to another browser or chrome addon (brave addon). (Noone really cares for earning pennys for watching ads, and the majoritiy does not care for a more fair distribution between publishers and big networks like google). \n\n\nLets say users really want to pay for content, there is another competitor aside from the simple paypal donation button: https://www.youtube.com/watch?v=Hr1eNMq9aDI\nWildspark by synereo will create a micropayment system which can be embedded where content was created.\nBut this project however won't hurt BAT",
            "fun fact: monero has i2p router in development called kovri https://github.com/monero-project/kovri\n\nkovri was chosen because it's more anonymous than tor\n\nhttps://monero.stackexchange.com/questions/16/why-was-i2p-chosen-over-tor-for-native-monero-integration\n\nThat table is missing a ton of criteria: forced anonymity?, shows amounts? (xmr uses ringct), trusted setup (lol)?, ico vs fair distribution?\n\nico = bad distribution = PoS security risk since coins directly affect security\n\nI see nothing about no fees on it which won't make sense since you have to protect against sybil attacks in some way, and there are some experimental ways in some coins, but I see nothing like that here. I'm sure since it's not used heavily the fees are just low or the blocks aren't full so there's no concern about prioritizing transaction until it's heavier used - the case with most altcoins.\n\nFees are a solution to a problem of how to avoid requiring infinite bandwidth to validate nodes which is a security risk - blocksize limit needs a way to prioritize tx - they are normally fees. xmr uses adjustable blocksize automatically changing to account for increases or decreases to keep it secure and on small size but still needs fees\n\nzerocash and pivx required trusted setup, so they are not an option for trustless crypto.\n\nxspec has zeroknowledge proofs so it also required trusted setup and thus not an option for trustless crypto https://bitcointalk.org/index.php?topic=1704473.0\n\nperpetual 5% yearly inflation is much higher than [xmr's plan](https://en.wikipedia.org/wiki/Monero_\\(cryptocurrency\\)) of < 0.87%. \n\noh god it has a rich list LOL https://chainz.cryptoid.info/xspec/#!rich\n\nfor comparison, this is xmr rich list: http://moneroblocks.info/richlist (it's literally impossible)\n\nFew more things like we're not entirely sure PoS3 is secure against double spend attacks and nothing at stake issue PoW solves elegantly. Other forms of PoS might be better, but it's debatable and hasn't been tested properly.\n\nI guess point is: probably more to read"
        ],
        "upvotes": [
            2,
            1
        ]
    },
    "FCT": {
        "full_name": "Factom",
        "mentioned_ids": [
            "dm76bpc",
            "dm790al",
            "dm7a7f1",
            "dm791eg",
            "dm7mzyl",
            "dm7q4k2",
            "dm7cigd",
            "dm7tibe",
            "dm70pa4",
            "dm7b740",
            "dm79ixo",
            "dm7c6in",
            "dm6und6"
        ],
        "mentioned_times": [
            1503883900.0,
            1503887299.0,
            1503888864.0,
            1503887340.0,
            1503905855.0,
            1503910084.0,
            1503891885.0,
            1503914840.0,
            1503876847.0,
            1503890168.0,
            1503887970.0,
            1503891453.0,
            1503866541.0
        ],
        "text": [
            "Factom is one of the few coins in my portfolio which  I think will fill a multi-billion dollar position in the long term. It is basically an immutable data layer on which applications can be built, factom Inc mostly focusses on getting their product done but once they start advertising and bringing in the big financial and mortgage firms it will be unstoppable. In my opinion their future plans are simply brilliant and they have always followed their white paper carefully. This protocol can take away corruption, fraud, and money spent on accounting and auditing, which I think has a mind blowing value.\n\nI believe in this project more than any other, including the ones that already proved themselves.",
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "Ark, it's extremely new but it has my favorite wallet and I'm excited how user friendly the team makes their products.  Also, Factom for how big it can get and how honest it can keep the mortgage companies. ",
            "I've been a FCT fan for a long time.\n\nArk has only been mentioned once here. It's the tech that will tie them all together.",
            "Iota, FCT, PTOY, and Civic ",
            "NEO and Factom for sure, however there are many that I'm excited to see their future potential.\n\nLTC , IOTA, OMG, and I really wanna see SiaCoin do well (yet not as exciting).\n\nJust my opinions",
            "For now I hold half of my coins in a BTC paperwallet, the rest of my long term holdings are divided between NEO, ETH and GBYTE. Some coins I may hold too, but for now I use them for trading until I get a clearer picture on them, like DNT, BAS, OMG, BNB, ICN, FCT and others.",
            "DNT, ARK, FCT\n\nBased on the strength of communities and the actual technologies they are developing. ",
            "Portfolio pie chart: http://i.imgur.com/1IMRMuu.png\n\nArea is determined by current position value, not buy-in size.  'Other' is DNT & FCT, mostly.",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "ETH\n\nFCT\n\nARK\n\nTAAS\n\nPART\n\nSNGLS  (think it's gonna take off in the next few weeks) ",
            "Everyone shill your coin go! Here I go: Factom, Ark, BTC and NEO. ",
            "I would say that you need to buy at least 5 coins such as Factom, Dash, Monero and Stratis in addition to ETH. All have good teams and clear functionalities"
        ],
        "upvotes": [
            103,
            38,
            27,
            15,
            7,
            5,
            6,
            1,
            2,
            2,
            1,
            1,
            0
        ]
    },
    "FLDC": {
        "full_name": "FoldingCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FLO": {
        "full_name": "Florin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FTC": {
        "full_name": "Feathercoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "FUN": {
        "full_name": "FunFair",
        "mentioned_ids": [
            "dm7vvun",
            "dm73uw9",
            "dm6hk44"
        ],
        "mentioned_times": [
            1503917570.0,
            1503880857.0,
            1503835396.0
        ],
        "text": [
            "fun fact: monero has i2p router in development called kovri https://github.com/monero-project/kovri\n\nkovri was chosen because it's more anonymous than tor\n\nhttps://monero.stackexchange.com/questions/16/why-was-i2p-chosen-over-tor-for-native-monero-integration\n\nThat table is missing a ton of criteria: forced anonymity?, shows amounts? (xmr uses ringct), trusted setup (lol)?, ico vs fair distribution?\n\nico = bad distribution = PoS security risk since coins directly affect security\n\nI see nothing about no fees on it which won't make sense since you have to protect against sybil attacks in some way, and there are some experimental ways in some coins, but I see nothing like that here. I'm sure since it's not used heavily the fees are just low or the blocks aren't full so there's no concern about prioritizing transaction until it's heavier used - the case with most altcoins.\n\nFees are a solution to a problem of how to avoid requiring infinite bandwidth to validate nodes which is a security risk - blocksize limit needs a way to prioritize tx - they are normally fees. xmr uses adjustable blocksize automatically changing to account for increases or decreases to keep it secure and on small size but still needs fees\n\nzerocash and pivx required trusted setup, so they are not an option for trustless crypto.\n\nxspec has zeroknowledge proofs so it also required trusted setup and thus not an option for trustless crypto https://bitcointalk.org/index.php?topic=1704473.0\n\nperpetual 5% yearly inflation is much higher than [xmr's plan](https://en.wikipedia.org/wiki/Monero_\\(cryptocurrency\\)) of < 0.87%. \n\noh god it has a rich list LOL https://chainz.cryptoid.info/xspec/#!rich\n\nfor comparison, this is xmr rich list: http://moneroblocks.info/richlist (it's literally impossible)\n\nFew more things like we're not entirely sure PoS3 is secure against double spend attacks and nothing at stake issue PoW solves elegantly. Other forms of PoS might be better, but it's debatable and hasn't been tested properly.\n\nI guess point is: probably more to read",
            "Cool, Trollcoin does the same thing but more fun, less income based.",
            "So I bought a Bitcoin back in 2013 on a whim for 300 bucks and pretty much forgot about it. Really wish I had been buying in for a small amount monthly since then..\n\nI already have my 401k and Roth maxed so I decided to use my fun money to buy into crypto. This chart represents a total buy in of 7K. From here on out I have $600 a month to invest.\n\nSo far I got really lucky with Monero and Lisk. Got my Monero for ~50 and Lisk for ~2. "
        ],
        "upvotes": [
            1,
            -2,
            2
        ]
    },
    "GAM": {
        "full_name": "Gambit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GAME": {
        "full_name": "GameCredits",
        "mentioned_ids": [
            "dm7f2go",
            "dm7w97x",
            "dm6mpjb",
            "dm7va42"
        ],
        "mentioned_times": [
            1503895213.0,
            1503917997.0,
            1503844583.0,
            1503916912.0
        ],
        "text": [
            "IXT. \n\nInsurex will allow Insurance companies to buy/sell insurance to each other. \n\nIt's aiming to provide a valuable service to a massive industry, built on top of the Eth network. \n\nAnd after the ICO they haven't hyped it too much. Makes me think they're playing the long game. \n\nInsurance is a very risk averse industry, so them not pumping and dumping IXT is a very good move. Hopefully we'll hear something from them in the coming months. ",
            "Instead of coin logos, maybe a graphic that represents blockchain/DAG, crypotography, mining/staking and game theory?",
            "The Game is about to Ja Rule you all.",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv."
        ],
        "upvotes": [
            3,
            1,
            2,
            3
        ]
    },
    "GBG": {
        "full_name": "GBG",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GBYTE": {
        "full_name": "Byteball",
        "mentioned_ids": [
            "dm7cigd"
        ],
        "mentioned_times": [
            1503891885.0
        ],
        "text": [
            "For now I hold half of my coins in a BTC paperwallet, the rest of my long term holdings are divided between NEO, ETH and GBYTE. Some coins I may hold too, but for now I use them for trading until I get a clearer picture on them, like DNT, BAS, OMG, BNB, ICN, FCT and others."
        ],
        "upvotes": [
            6
        ]
    },
    "GCR": {
        "full_name": "GlobalCurrencyReserve",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GEO": {
        "full_name": "GeoCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GLD": {
        "full_name": "GoldCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GNO": {
        "full_name": "Gnosis",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GNT": {
        "full_name": "Golem",
        "mentioned_ids": [
            "dm7dy43",
            "dm73j4f",
            "dm7drmr",
            "dm7ew93",
            "dm6zk1r",
            "dm7b740",
            "dm7mzib",
            "dm6r5c3",
            "dm7va42",
            "6wfmbl"
        ],
        "mentioned_times": [
            1503893764.0,
            1503880465.0,
            1503893534.0,
            1503894986.0,
            1503875244.0,
            1503890168.0,
            1503905838.0,
            1503856797.0,
            1503916912.0,
            1503905802.0
        ],
        "text": [
            "Anything where we decentralize shit using the internet of money:\n\n* Decentralized Uber\n\n* Decentralized AirBNB\n\n* p2p electric grid\n\n* p2p incentivized mesh network\n\n* Distributed storage thru something like Sia or Storj\n\n* Distributed processing thru Golem",
            "what I'm watching:\n\n* Wagerr: Betting platform using crypto. Easy to understand use-case and has real-world value today. Siacoin, Golem, and other projects have interesting use-cases but it's still up for grabs whether people will be interested in decentralized storage and computing, etc. People are interested in betting on sports today, so the use-case already exists. \n* Santiment: Another one I've been tracking for a while. They're attempting to be the Bloomberg Terminal of the crypto world. Definitely see the use-case as it's difficult to find information about different cryptocurrencies from a centralized location.  \n* IOTA: No fees, network gets faster the more people use it. No miners. That's a big fucking deal. Technology is fundamentally different from other coins, and it's not just another shitty ERC20 copy-paste. ",
            "IOTA, GNT, BAT - Not your regular Bitcoin copycats.",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here..",
            "I would buy SIA before the obelisks arrive. Personally I think is a good project, not necessarily a good investment right now. Sia is like Golem. Another good project, but not best investment. \nPrice will rise after asics come, I think. Mined coins usually rise in price overtime. ",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Supercomputer Powered by Blockchain Technology Golem (GNT) vs. Elastic (XEL) — Steemit"
        ],
        "upvotes": [
            21,
            22,
            7,
            1,
            6,
            2,
            1,
            7,
            3,
            2
        ]
    },
    "GOLOS": {
        "full_name": "Golos",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "GRC": {
        "full_name": "GridCoin",
        "mentioned_ids": [
            "dm7syov"
        ],
        "mentioned_times": [
            1503914057.0
        ],
        "text": [
            "I mine Gridcoin because I love the concept, probably will never be huge tho"
        ],
        "upvotes": [
            1
        ]
    },
    "GRS": {
        "full_name": "Groestlcoin",
        "mentioned_ids": [
            "dm79p2m"
        ],
        "mentioned_times": [
            1503888195.0
        ],
        "text": [
            "Groestlcoin and syscoin also at least. Maybe few others..."
        ],
        "upvotes": [
            1
        ]
    },
    "GUP": {
        "full_name": "Guppy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HKG": {
        "full_name": "HackerGold",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "HMQ": {
        "full_name": "Humaniq",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INCNT": {
        "full_name": "Incent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "INFX": {
        "full_name": "InfluxCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOC": {
        "full_name": "I/OCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ION": {
        "full_name": "Ion",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "IOP": {
        "full_name": "Internet Of People",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "KMD": {
        "full_name": "Komodo",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "KORE": {
        "full_name": "KoreCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LBC": {
        "full_name": "LBRY Credits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LGD": {
        "full_name": "Legends",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LMC": {
        "full_name": "Lomocoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "LSK": {
        "full_name": "Lisk",
        "mentioned_ids": [
            "dm790al",
            "dm7lojg",
            "dm7ew93",
            "6wb6am",
            "dm6vl1b",
            "dm6wde8",
            "dm7jfg3",
            "6wbbdz",
            "dm7hag2",
            "dm72812",
            "dm78v45",
            "dm6z354",
            "dm7va42",
            "dm6hk44"
        ],
        "mentioned_times": [
            1503887299.0,
            1503904019.0,
            1503894986.0,
            1503851591.0,
            1503868466.0,
            1503869951.0,
            1503900936.0,
            1503854468.0,
            1503898119.0,
            1503878809.0,
            1503887110.0,
            1503874530.0,
            1503916912.0,
            1503835396.0
        ],
        "text": [
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "Really looking forward to seeing Lisk develop. Honestly feel that this time round the project is going to go full term. One of the best funded projects in the space and with a fast growing roster of developers. \n\nWhen good to go it should be an all in one package for any one with basic computer knowledge to create a simple blockchain application. \n\nThey are working with Taikonauten to rebrand Lisk with a more corporate image. These guys have put out some really clean and fresh looking work for some big companies in the past so it should be good. \n\nAlso have an interest in RISE, a similar approach looking to create \"the WIX of the blockchain\" making it easy to drag and drop and create dApps. \n\nMuch smaller development team and no where near the level of funding that Lisk has, they have recently performed a chain swap from pure Lisk code to Shift-Ark hybrid.",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Lisk Price Reaches a new All-time High of $7.27",
            "Lisk is responsible for a good 40% swing this weekend for me.",
            "I should buy more LSK.... ",
            "What is lisk about in few sentences?",
            "[LISK] A strategy to MAXIMIZE your potential profits with the dPOS system",
            "I didn't read in detail about lisk's version of dpos and I'm a little shocked\n\nIt rewards voting for people based on their share?!\n\nIsn't that like bribery? Someone with could get a ton of voting power just by offering high payments alone.\n\nThis is specifically avoided in bitshares (creator of dpos) to even out the choices to where individual actions are most important requiring some research. And if you can't do the research to vote for witnesses/dao/, no time, you find a proxy you like who's job it is to vote and monitor witnesses behavior for you. Witnesses do sometimes burn some % of their reward to deflate supply (which is capped).\n\n",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "Omg, lisk, iota, eth, btc, Bch, sia, xrp, dnt and safex",
            "50% Lisk \n30% omg \n10% IOTA\n10% btc \n\n\n",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "So I bought a Bitcoin back in 2013 on a whim for 300 bucks and pretty much forgot about it. Really wish I had been buying in for a small amount monthly since then..\n\nI already have my 401k and Roth maxed so I decided to use my fun money to buy into crypto. This chart represents a total buy in of 7K. From here on out I have $600 a month to invest.\n\nSo far I got really lucky with Monero and Lisk. Got my Monero for ~50 and Lisk for ~2. "
        ],
        "upvotes": [
            38,
            3,
            1,
            28,
            9,
            5,
            1,
            24,
            0,
            4,
            2,
            1,
            3,
            2
        ]
    },
    "LTC": {
        "full_name": "Litecoin",
        "mentioned_ids": [
            "dm784ke",
            "dm7q4k2",
            "dm7e51b",
            "6wdjij",
            "dm7b4qd",
            "dm7mdfy",
            "6wcqwv",
            "6wbun7",
            "dm6ufs6",
            "dm6zqbg",
            "dm6x9yz",
            "dm77cri",
            "dm7b5jk",
            "dm70vcv",
            "6wbhqs",
            "dm6q7jj",
            "6way04",
            "dm7b6j7",
            "dm70rkv",
            "dm7rf58",
            "dm72fg9",
            "dm6xp9z",
            "dm6yq4v",
            "dm72812",
            "dm727zc",
            "dm6y1x5",
            "dm7b740",
            "dm72sq1",
            "dm7hoyx",
            "6wbsbg",
            "dm6vyxw",
            "dm7va42",
            "6wdxts",
            "dm7b1pl",
            "dm6jhtc",
            "dm6n3v6"
        ],
        "mentioned_times": [
            1503886165.0,
            1503910084.0,
            1503894010.0,
            1503884564.0,
            1503890078.0,
            1503904979.0,
            1503876426.0,
            1503864722.0,
            1503866084.0,
            1503875496.0,
            1503871608.0,
            1503885174.0,
            1503890110.0,
            1503877077.0,
            1503858082.0,
            1503853834.0,
            1503847176.0,
            1503890147.0,
            1503876935.0,
            1503911811.0,
            1503879077.0,
            1503872315.0,
            1503873959.0,
            1503878809.0,
            1503878807.0,
            1503872875.0,
            1503890168.0,
            1503879536.0,
            1503898652.0,
            1503863644.0,
            1503869214.0,
            1503916912.0,
            1503888424.0,
            1503889969.0,
            1503838952.0,
            1503845477.0
        ],
        "text": [
            "This is not investment advice, just the coins I like a lot.\n\nLTC, ETH, XMR, NEO and OMG ",
            "NEO and Factom for sure, however there are many that I'm excited to see their future potential.\n\nLTC , IOTA, OMG, and I really wanna see SiaCoin do well (yet not as exciting).\n\nJust my opinions",
            "Ltc. I am, banking on a lot of business from bitcoin via atomic swaps and LN. ",
            "Litecoin reached 2 milestones today: $60 and $3B marketcap!",
            "Is it to late to buy LTC right now??",
            "A problem I have with litecoin is the high volume of coins. Bitcoin 21m, xmr 18m, litecoin 55m and counting!",
            "Litecoin - \"There is one more thing\" LoafWallet Apple Pay and NFC support - Adoption moving fast",
            "LTC moving",
            "I'm looking at it drunk as hell right now. BCH flowing into LTC ",
            "LTC to 1000",
            "slightly off topic, but where can I buy altcoins with LTC?\n\ntired of having to lose money+time in using BTC. Thanks. ",
            "So I tried to do a bit of day trading earlier today while LTC was rising and that shit is not for me. Guessing if it will go up or down and staring at GDAX is not for me. I actually got careless and made a mistake and sold lower than i bought at one point and loss some money. Im buying and holding from now on",
            "Is it too late to buy litecoin right now??",
            "Ok, let's say you look at Bitshares (I'm picking this almost at random - it may be a great coin or a terrible one - I don't know much about it).  But the current price is only 0.13 cents.  You think, \"awesome, it's a bargain.  At only 0.13 cents, it's got a lot of room to grow.  Maybe it will go to $1.30 or even $10.  Maybe even a $100 - I mean Bitcoin is worth over $4000 so it's possible.\"\n\nBut then you look at the coins in circulation which is 2.6 billion.  2.6 billion times 0.13 cents brings you to the current market cap of $350 million.\n\nSo, let's see what happens to the market cap if it the coin value reaches your hoped for highs:\n\n* At $1.30, the market cap becomes $3.5 billion.  That's position #3 and worth more than Litecoin.  Is that possible? I don't know much about Bitshares but Litecoin is a pretty solid coin with high adoption.\n\n* At $10, the market cap becomes over $30 billion dollars.  That's about the value of Ethereum.  Is that likely? \n\n* At $100, the market cap becomes over $300 billion dollars.  That's more than three times the total worth of Bitcoin.\n\nAgain, I don't know much about Bitshares but it looks pretty unlikely to me that it would be worth more than Bitcoin.  Or Ethereum for that matter.\n",
            "What are known downsides of BAT? 1 LTC award for best answer",
            "My week in Crypto: waiting to be verified on a new exhange so I can get some more XMR and LTC! ",
            "Monero and Litecoin - market share",
            "I want to buy LTC and trade it for other coins as BTC fees are crazy. I wanted to use cards to buy in due to accessibility. Will I be better off just using Kraken and pay via SEPA?",
            "I usually use LTC or Dash. Fast and cheap, but depends on the withdrawal fee.\nI believe Kraken even allows the use of the Dash Instantsend if you choose. Although you'll have to wait for full confirmations anyway before you can trade them.",
            "Deposit fiat onto coinbase (no fee). Use gdax to buy LTC (no fee). Transfer LTC to exchange (only .001) tx fee.  ",
            "I can't buy Ripple on Coinbase, but I can buy LTC and I like LTC more.",
            "Ltc btc and eth. Thinking about buying some ark, omg, or vtc.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "ETH 3.78, LTC 4.34, DNT 9498.2",
            "90% BTC\n\n9.5% Omise-Go\n\n0.5% (Combination of Dogecoin, Vertcoin,DigiByte, Litecoin)",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "Bitcoin, litecoin, monero plus recently Bitcoin cash.\n\nAs I am still looking for useful crypto I added recently iota and decred as high risk one but with potential.\n\nI reckon I got to many but that is it at the moment. ",
            "These numbers are how much I put into the coins a couple of days ago. I think my portfolio has raised 20$ or something.\n\n100$ - Ardor\n100$ - Stratis\n100$ - OMG\n300$ - LTC",
            "Litecoin vs. Monero - which one's a better buy?",
            "If I were considering both, I'd diversify between the two. If it *had* to be one of them it would be Litecoin, as I see it's adoption increasing after atomic swaps are implemented. I also think Monero may face regulatory pressure due to its anonymity, but who knows really.",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Litecoin has gone up nearly 1500% in value since the end of march, and that isn't stopping soon. The best time to buy was a year ago, the second best time is now.",
            "I would hardly feel confident by gains induced by Korea pump. I still like litecoin as a longgggg hold but it will go back to $50 soon",
            "Add some LiteCoin",
            "This is pretty solid.  And safe.  I'd consider some NEO and LTC to be honest.  If you want to gamble, you can put some in XRP and DNT.  I think monero percentage is a bit high - that may be to the recent surge though, but overall very solid.  Honestly, you're doing great -- don't listen to anyone on here unless they have some good reasoning.  Keep it up!"
        ],
        "upvotes": [
            65,
            5,
            1,
            125,
            12,
            0,
            71,
            61,
            25,
            26,
            8,
            4,
            3,
            13,
            20,
            2,
            5,
            1,
            2,
            1,
            0,
            9,
            5,
            4,
            3,
            2,
            2,
            1,
            1,
            3,
            1,
            3,
            1,
            7,
            4,
            2
        ]
    },
    "LUN": {
        "full_name": "Lunyr",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MAID": {
        "full_name": "MaidSafe",
        "mentioned_ids": [
            "dm7iceu"
        ],
        "mentioned_times": [
            1503899522.0
        ],
        "text": [
            "IOTA, Sia & Storj (not gonna put all my eggs in one basket), MaidSafe"
        ],
        "upvotes": [
            6
        ]
    },
    "MCO": {
        "full_name": "Monaco",
        "mentioned_ids": [
            "dm7nrf6",
            "dm7r8uo",
            "dm7b740"
        ],
        "mentioned_times": [
            1503906926.0,
            1503911564.0,
            1503890168.0
        ],
        "text": [
            "TenX and Monaco",
            "Monaco. A well designed, functional btc/eth>fiat debit card would be very good for the publicity of cryptocurrency as a whole. I'm most excited for this one as I'll actually be using their technology asap (hopefully)",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)"
        ],
        "upvotes": [
            1,
            1,
            2
        ]
    },
    "MEME": {
        "full_name": "Memetic",
        "mentioned_ids": [
            "dm6ossd"
        ],
        "mentioned_times": [
            1503849740.0
        ],
        "text": [
            "Yeah great meme. Honestly while I had all money in BTC and Alts (because I'm not an idiot) it hurt me to know the inferior technology would win out thanks to the ubiquity and distribution platforms. I hope BTC eats a bullet after we see exchanges offer tokenized trading."
        ],
        "upvotes": [
            -1
        ]
    },
    "MLN": {
        "full_name": "Melon",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MONA": {
        "full_name": "MonaCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MTL": {
        "full_name": "Metal",
        "mentioned_ids": [
            "dm7fcbh",
            "dm73xiq"
        ],
        "mentioned_times": [
            1503895572.0,
            1503880943.0
        ],
        "text": [
            "IOTA, MTL, RADS",
            "200% eth\n\nEdit: and some MTL"
        ],
        "upvotes": [
            4,
            3
        ]
    },
    "MUE": {
        "full_name": "MonetaryUnit",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "MUSIC": {
        "full_name": "Musicoin",
        "mentioned_ids": [
            "dm7cphx"
        ],
        "mentioned_times": [
            1503892146.0
        ],
        "text": [
            "ARK and/or HCASH. It would crazily transform crypto and solve so many problems with blockchain bridges.\n\nEDIT: Also, ticketing systems like Aventus and Blocktix, as well as Musiconomi/Musicoin"
        ],
        "upvotes": [
            4
        ]
    },
    "MYST": {
        "full_name": "Mysterium",
        "mentioned_ids": [
            "dm7i2a0"
        ],
        "mentioned_times": [
            1503899146.0
        ],
        "text": [
            "It's not a hodl you hear a lot but I'm keen on Mysterium. Decentralized VPN. "
        ],
        "upvotes": [
            2
        ]
    },
    "NAV": {
        "full_name": "NAVCoin",
        "mentioned_ids": [
            "dm7f46p",
            "dm7kkb4"
        ],
        "mentioned_times": [
            1503895274.0,
            1503902477.0
        ],
        "text": [
            "NEO, promising technology and a strong community! \n\nBNB, because I believe Binance will be one of the bigger exchanges in crypto. A lot of use cases. One example you can buy in top notch Chinese ICO's.\n\nDNT, I strongly believe in the project. If the tech works and we get some popular districts the demand will be huge. \n\nNAV coin, I read a post about it, did my research now I'm going bullish. \n\n",
            "NAV"
        ],
        "upvotes": [
            5,
            3
        ]
    },
    "NBT": {
        "full_name": "Nubits",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NEO": {
        "full_name": "Neo",
        "mentioned_ids": [
            "dm784ke",
            "dm72w1r",
            "dm7f46p",
            "dm7q4k2",
            "dm7cigd",
            "dm7pvoh",
            "dm7ew93",
            "6wglcu",
            "dm6yq4v",
            "dm6zk1r",
            "dm72812",
            "dm7b740",
            "dm7c6in",
            "dm7mzib",
            "dm7p6ba",
            "dm7va42",
            "dm6ns3n",
            "dm6n3v6"
        ],
        "mentioned_times": [
            1503886165.0,
            1503879649.0,
            1503895274.0,
            1503910084.0,
            1503891885.0,
            1503909762.0,
            1503894986.0,
            1503916831.0,
            1503873959.0,
            1503875244.0,
            1503878809.0,
            1503890168.0,
            1503891453.0,
            1503905838.0,
            1503908824.0,
            1503916912.0,
            1503847090.0,
            1503845477.0
        ],
        "text": [
            "This is not investment advice, just the coins I like a lot.\n\nLTC, ETH, XMR, NEO and OMG ",
            "IOTA skyrocketing and Neo reaching ETH prices. \n\nSiacoin to get massiv PR bump and adoptation. But this is years out i am afraid. \n\n\nI am also excited for BAT in general. It would be awesome if they could breakthrough. \n\n",
            "NEO, promising technology and a strong community! \n\nBNB, because I believe Binance will be one of the bigger exchanges in crypto. A lot of use cases. One example you can buy in top notch Chinese ICO's.\n\nDNT, I strongly believe in the project. If the tech works and we get some popular districts the demand will be huge. \n\nNAV coin, I read a post about it, did my research now I'm going bullish. \n\n",
            "NEO and Factom for sure, however there are many that I'm excited to see their future potential.\n\nLTC , IOTA, OMG, and I really wanna see SiaCoin do well (yet not as exciting).\n\nJust my opinions",
            "For now I hold half of my coins in a BTC paperwallet, the rest of my long term holdings are divided between NEO, ETH and GBYTE. Some coins I may hold too, but for now I use them for trading until I get a clearer picture on them, like DNT, BAS, OMG, BNB, ICN, FCT and others.",
            "NEO and Everex. \n\nEveryone knows about NEO. \n\nEverex.io i'm pretty excited for because it's a problem i've personally had before and it can help people out. It's focusing on micro-loans to people in 3rd world countries. ",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Onchain Working on Proof of Concept Chain for 'CSD' - Chinese Government Securities Clearing Entity (Chinese Version of DTCC for the U.S.). Also Working with Everbright Securities - Investment Bank and Brokerage. Both Will Likely Have Ability to Connect to NEO through NEOx Protocol.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "Everyone shill your coin go! Here I go: Factom, Ark, BTC and NEO. ",
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here..",
            "I don't have it broken down into % but:\nNEO (vast majority)\nDNT\nWGR\nBTC\nETH",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Looks good. I'd reinvest BCH back into OMG, maybe some NEO.  The news that mining BTC is 250% more profitable than BCH may drop BCH past any support it has. Possibly irreversible. \n\nOMG and NEO are bound to boom they're both 100% solid. Maybe zrx as a moon.",
            "This is pretty solid.  And safe.  I'd consider some NEO and LTC to be honest.  If you want to gamble, you can put some in XRP and DNT.  I think monero percentage is a bit high - that may be to the recent surge though, but overall very solid.  Honestly, you're doing great -- don't listen to anyone on here unless they have some good reasoning.  Keep it up!"
        ],
        "upvotes": [
            65,
            59,
            5,
            5,
            6,
            2,
            1,
            7,
            5,
            6,
            4,
            2,
            1,
            1,
            1,
            3,
            6,
            2
        ]
    },
    "NEOS": {
        "full_name": "NeosCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NLG": {
        "full_name": "Gulden",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NMR": {
        "full_name": "Numeraire",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXC": {
        "full_name": "Nexium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXS": {
        "full_name": "Nexus",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "NXT": {
        "full_name": "NXT",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "OK": {
        "full_name": "OkCash",
        "mentioned_ids": [
            "dm6u5nm",
            "dm7chb4",
            "dm70vcv",
            "dm6qypn"
        ],
        "mentioned_times": [
            1503865424.0,
            1503891843.0,
            1503877077.0,
            1503856214.0
        ],
        "text": [
            "Easy to solve.\n\nTake a step backwards. Cash used to have to be physically handed from person to person. Copy this.\n\nCreate a crypto coin, entirely mobile phone based, that can't be transferred without three factors.\n\n1. GPS on phones within 20 meters of each other\n2. NFC connection, with phones back to back or beside each other.\n3. A dialogue that appears on the phone saying 'you are authorized for transfer, NFC & GPS OK. Process transfer?\n\nA person can sit at home, setup their transfers on the phone, notification goes through digitally that the transfer is setup, but it never actually goes through until after phones have sex.\n\nHmm, maybe I should do this?",
            "As Lithuanian I am skeptical myself and would advise not to invest in this ico. Here are my reasons :\n\n1. It's basically a currency with review system. It would be easy to implement on other coins if such idea would gain traction. Monetha itself doesn't offer new technology or at least don't disclose yet.\n2. smart contracts. They simply don't release them. It's ok to be secretive but it's not ok to blindly ask to give millions without proof of work. They may have it or they may not.\n\n3. Justas Pikelis Co-Founder/Business. The one with the slick and sexy haircut is \"enterpreneur\" and somewhat interesting person. At first, he was DJ, after that he became the entrepreneur and had a lawsuit with some company that they allegedly stole his idea and now feeling that he can gain easy money from ico he became Blockchain Entrepreneur. The rest team may be good but I simply don't believe in such fast transition from DJ to blockchain businessman. Here are some photos of him than he was DJ :\nhttp://www.delfi.lt/veidai/zmones/didzeju-justin-beat-labiausiai-zeidzia-kalbos-kad-jo-kunas-pripumpuotas-steroidu.d?id=63232736\nHe may look better than vitalik but I doubt he is better than him\n\nOverall monetha doesn't offer anything unique what couldn't be achieved with pre existing currencies and wide adoption of monetha is unlikely \n\n",
            "Ok, let's say you look at Bitshares (I'm picking this almost at random - it may be a great coin or a terrible one - I don't know much about it).  But the current price is only 0.13 cents.  You think, \"awesome, it's a bargain.  At only 0.13 cents, it's got a lot of room to grow.  Maybe it will go to $1.30 or even $10.  Maybe even a $100 - I mean Bitcoin is worth over $4000 so it's possible.\"\n\nBut then you look at the coins in circulation which is 2.6 billion.  2.6 billion times 0.13 cents brings you to the current market cap of $350 million.\n\nSo, let's see what happens to the market cap if it the coin value reaches your hoped for highs:\n\n* At $1.30, the market cap becomes $3.5 billion.  That's position #3 and worth more than Litecoin.  Is that possible? I don't know much about Bitshares but Litecoin is a pretty solid coin with high adoption.\n\n* At $10, the market cap becomes over $30 billion dollars.  That's about the value of Ethereum.  Is that likely? \n\n* At $100, the market cap becomes over $300 billion dollars.  That's more than three times the total worth of Bitcoin.\n\nAgain, I don't know much about Bitshares but it looks pretty unlikely to me that it would be worth more than Bitcoin.  Or Ethereum for that matter.\n",
            "Ok this will be a noob question but havent really looked much into the wallets, just because i hold only like 90-100$ worth of usd on exchange, but for future I want be secured. \n\nIm currently holding ark, xmr, adx, cvc, dnt and some other coins. which wallet could hold all these coins in one place? Or do i have to download seperate wallets for some coins? Also will I be losing some money by fees everytime i transfer? "
        ],
        "upvotes": [
            2,
            4,
            13,
            3
        ]
    },
    "OMG": {
        "full_name": "OmiseGO",
        "mentioned_ids": [
            "dm784ke",
            "dm790al",
            "dm7q4k2",
            "dm7cigd",
            "dm7enju",
            "dm7mz47",
            "dm7ew93",
            "dm7o67z",
            "dm6xp9z",
            "dm6yq4v",
            "dm6zk1r",
            "dm72812",
            "dm78v45",
            "dm6z354",
            "dm7hoyx",
            "dm7mkwn",
            "dm6ns3n"
        ],
        "mentioned_times": [
            1503886165.0,
            1503887299.0,
            1503910084.0,
            1503891885.0,
            1503894672.0,
            1503905822.0,
            1503894986.0,
            1503907484.0,
            1503872315.0,
            1503873959.0,
            1503875244.0,
            1503878809.0,
            1503887110.0,
            1503874530.0,
            1503898652.0,
            1503905273.0,
            1503847090.0
        ],
        "text": [
            "This is not investment advice, just the coins I like a lot.\n\nLTC, ETH, XMR, NEO and OMG ",
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "NEO and Factom for sure, however there are many that I'm excited to see their future potential.\n\nLTC , IOTA, OMG, and I really wanna see SiaCoin do well (yet not as exciting).\n\nJust my opinions",
            "For now I hold half of my coins in a BTC paperwallet, the rest of my long term holdings are divided between NEO, ETH and GBYTE. Some coins I may hold too, but for now I use them for trading until I get a clearer picture on them, like DNT, BAS, OMG, BNB, ICN, FCT and others.",
            "omg for sure",
            "OMG is exciting for many different reasons, one being it's facial recognition component that will help create better security and combat fraud. Another one is Agrello, it's still very new but the idea around AI and useable smart contracts for real-world applications is cool. Both are exciting in different ways but crazy interesting to watch their potential for future technology growth. ",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "so this dude on here, /u/martingore2017 , has a lot of people listening to him regarding ICO's since he made a good call on OMG\n\nhe advises to \"DIVE IN DEEP\" to Monetha in this comment...https://www.reddit.com/r/CryptoCurrency/comments/6v9yv9/why_i_have_decided_to_invest_in_quantum_resistant/dlyztuk/\n\nis it safe to say he either doesn't know what he's talking about, or he has a hidden agenda now that he knows people will take his advice? ",
            "Ltc btc and eth. Thinking about buying some ark, omg, or vtc.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "Omg, lisk, iota, eth, btc, Bch, sia, xrp, dnt and safex",
            "50% Lisk \n30% omg \n10% IOTA\n10% btc \n\n\n",
            "These numbers are how much I put into the coins a couple of days ago. I think my portfolio has raised 20$ or something.\n\n100$ - Ardor\n100$ - Stratis\n100$ - OMG\n300$ - LTC",
            "Pretty sure this is one of the things OMG is aiming to do.. ",
            "Looks good. I'd reinvest BCH back into OMG, maybe some NEO.  The news that mining BTC is 250% more profitable than BCH may drop BCH past any support it has. Possibly irreversible. \n\nOMG and NEO are bound to boom they're both 100% solid. Maybe zrx as a moon."
        ],
        "upvotes": [
            65,
            38,
            5,
            6,
            4,
            2,
            1,
            0,
            9,
            5,
            6,
            4,
            2,
            1,
            1,
            4,
            6
        ]
    },
    "OMNI": {
        "full_name": "OMNI",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PART": {
        "full_name": "Particl",
        "mentioned_ids": [
            "dm6n1nd",
            "dm6smkk",
            "dm7hev3",
            "dm7exoq",
            "dm7tmah",
            "dm79ixo",
            "dm7t7md"
        ],
        "mentioned_times": [
            1503845338.0,
            1503861373.0,
            1503898285.0,
            1503895039.0,
            1503915010.0,
            1503887970.0,
            1503914413.0
        ],
        "text": [
            "That is part of the deal here. If you think your money is actually 100% secure with a bank, then you are mistaken. \n\nIf you take the proper procedures and are vigilant with the information you share or enter on a computer, then you don't have anything to worry about. The software is secure. It's people that are reckless. \n\n",
            "The money in the bank isn't actually yours. It's really just a representation of what the bank owes you. You have turned over your property to the bank in return for a debt claim and if its a large amount it can be an unsecured debt claim. The worse part is when you leave it there and they lend against it and then the government collects tax on any interest you earn and steal its value via inflation. You are also allowing the governments to know how much asset you have. They can use this against you too.",
            "I don't understand it guys, what exactly did they implement? \n\nI was waiting for email verification on withdraws but this isn't the case I think. What additional part is added? Every time you login, will you receive a confirmation mail? ",
            "Companies are starting to use blockchains as part of their rewards system. This is great for us. Funny in this case. But still awesome. Increases familiarity with cryptos. ",
            "I don't understand why people are going to so much trouble to do this when Cointracking.info does all this automatically with almost Zero effort on the users part. ",
            "ETH\n\nFCT\n\nARK\n\nTAAS\n\nPART\n\nSNGLS  (think it's gonna take off in the next few weeks) ",
            "Reply to my own question - what about technology risks such as bugs in encryption algos or another fundamental part of blockchain technology? Note, I'm a noob so apologies if this is a dumb question. "
        ],
        "upvotes": [
            13,
            1,
            1,
            3,
            1,
            1,
            1
        ]
    },
    "PAY": {
        "full_name": "TenX Pay Token",
        "mentioned_ids": [
            "dm790al",
            "dm7ew93",
            "6wcqwv",
            "dm7bwbh",
            "dm6nw52",
            "dm6wqzk",
            "6waond",
            "dm6sse5",
            "dm6ynxp",
            "dm7euw1",
            "dm77zpk",
            "dm7bq4x",
            "dm7b6j7"
        ],
        "mentioned_times": [
            1503887299.0,
            1503894986.0,
            1503876426.0,
            1503891087.0,
            1503847372.0,
            1503870645.0,
            1503842688.0,
            1503861843.0,
            1503873861.0,
            1503894934.0,
            1503885988.0,
            1503890857.0,
            1503890147.0
        ],
        "text": [
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "Another VR project I heard about is Spectiv. \n\nThe projects I support and you should look into are: ZRX, ARK, NEO, OMG, LSK, NEO, CVC, PAY, DNT, GNT, SNC, PLR\n",
            "Litecoin - \"There is one more thing\" LoafWallet Apple Pay and NFC support - Adoption moving fast",
            "Android Pay support pls",
            "Is there a coin with 2SV? So far ive only seen:\n\n- you start the wallet and to pay you need a password you made up\n- same bit with a passphrase the wallet gave you (terrible solution to be honest). \n- you need to enter the private account number before you can enter the wallet. This address can be a phrase of 80 characters. \n\nBut is there a:\n- I pay with a desktop wallet, need to confirm with sms code\n- pay with phone, need to confirm with fingerprint\n",
            "It's not security, its ease of access. \n\nIve been working online for 18yrs.\n\nI cant buy cryptos in less than 4 days without paying 5-10% fees.  It's basically the same reason online poker got completely fucked in the US other than regulations. People couldnt deposit easily. It's a grey market like cryptos, the problem is random joe either doesnt know how to deposit or does not want to pay a huge markup.",
            "So who won the Mayweather fight giveaway? Are they going to pay up?",
            "Just personal speculation, but to me, bat as a coin is only investment worthy if the browser actually becomes a player in the common browsers for most users of the internet. I believe that Chrome will have a strong hold as the google product necessary to reach the internet for a while to come, as well as Safari for mac users and internet explorer for those who are not internet savvy.  \n\nI personally do not see BAT as a browser becoming mainstream, even if it does pay you for the adds, considering that for a while most people, as in 99% of the world, do not know how, or even care, to dabble in crypto currencies.  It's like a bank offering you X amount of $ to sign up for a checking account linked to direct deposit. Most people follow the \"if it ain't broke don't fix it\" rule, and I believe the internet is another one of those things.\n\nI believe that those who dabble in crypto are up to receive coins for certain ads, but I don't ever see BAT being a huge player in terms of their product captivating audiences, seeing as their \"payout\" for using their product is in a currency that most don't know how to use.\n\nThat being said, in terms of crypto and strictly those who know how to go about trading and using said coins, the market is definitely there and people do use their internet browser, so it's all speculation in terms of main stream adoption.",
            "BAT is a really good idea and i am invested in this. \n\nThere is however a huge competition, and thats google.\n\nGoogle is already working on an adblocker on their on which will kick out shitty ads and only display ads which they like (they said they have an agreement, this alliance for better ads and stuff, but i think they can just do what they want).\n\nIf google is too restrictive with their adblocker, brave can skyrocket. If they are not too restrictive, there won't be an incentive to switch to another browser or chrome addon (brave addon). (Noone really cares for earning pennys for watching ads, and the majoritiy does not care for a more fair distribution between publishers and big networks like google). \n\n\nLets say users really want to pay for content, there is another competitor aside from the simple paypal donation button: https://www.youtube.com/watch?v=Hr1eNMq9aDI\nWildspark by synereo will create a micropayment system which can be embedded where content was created.\nBut this project however won't hurt BAT",
            "So you report it as income. What happens if you sell it a year later? Do you pay taxes again? Is it free because you already paid tax?\n\n\nDoes not make sense. ",
            "The nodes just need enough money to pay for sufficient storage. In dash the MasterNodes earn plenty to do so. So yea Dash has this solved.",
            "Coinbase is great.  Very easy to use.  You pay a premium for that convenience.",
            "I want to buy LTC and trade it for other coins as BTC fees are crazy. I wanted to use cards to buy in due to accessibility. Will I be better off just using Kraken and pay via SEPA?"
        ],
        "upvotes": [
            38,
            1,
            71,
            2,
            2,
            2,
            49,
            4,
            2,
            1,
            1,
            9,
            1
        ]
    },
    "PDC": {
        "full_name": "Project Decorum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PINK": {
        "full_name": "PinkCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PIVX": {
        "full_name": "Pivx",
        "mentioned_ids": [
            "dm7vvun",
            "dm6yq4v",
            "6wbazi",
            "dm6qmqc",
            "6wg857"
        ],
        "mentioned_times": [
            1503917570.0,
            1503873959.0,
            1503854253.0,
            1503855140.0,
            1503912570.0
        ],
        "text": [
            "fun fact: monero has i2p router in development called kovri https://github.com/monero-project/kovri\n\nkovri was chosen because it's more anonymous than tor\n\nhttps://monero.stackexchange.com/questions/16/why-was-i2p-chosen-over-tor-for-native-monero-integration\n\nThat table is missing a ton of criteria: forced anonymity?, shows amounts? (xmr uses ringct), trusted setup (lol)?, ico vs fair distribution?\n\nico = bad distribution = PoS security risk since coins directly affect security\n\nI see nothing about no fees on it which won't make sense since you have to protect against sybil attacks in some way, and there are some experimental ways in some coins, but I see nothing like that here. I'm sure since it's not used heavily the fees are just low or the blocks aren't full so there's no concern about prioritizing transaction until it's heavier used - the case with most altcoins.\n\nFees are a solution to a problem of how to avoid requiring infinite bandwidth to validate nodes which is a security risk - blocksize limit needs a way to prioritize tx - they are normally fees. xmr uses adjustable blocksize automatically changing to account for increases or decreases to keep it secure and on small size but still needs fees\n\nzerocash and pivx required trusted setup, so they are not an option for trustless crypto.\n\nxspec has zeroknowledge proofs so it also required trusted setup and thus not an option for trustless crypto https://bitcointalk.org/index.php?topic=1704473.0\n\nperpetual 5% yearly inflation is much higher than [xmr's plan](https://en.wikipedia.org/wiki/Monero_\\(cryptocurrency\\)) of < 0.87%. \n\noh god it has a rich list LOL https://chainz.cryptoid.info/xspec/#!rich\n\nfor comparison, this is xmr rich list: http://moneroblocks.info/richlist (it's literally impossible)\n\nFew more things like we're not entirely sure PoS3 is secure against double spend attacks and nothing at stake issue PoW solves elegantly. Other forms of PoS might be better, but it's debatable and hasn't been tested properly.\n\nI guess point is: probably more to read",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "I invested in Siacoin and PIVX, are they both good longterm?",
            "Don't worry, you make a right choice for longterm. \n\nSia is probably the future of the cloud, the project and the team are awesome. \n\nPIVX is one of the best privacy crypto and is very fast. \n\nSo again, don't worry and hodl !  ",
            "DataDash: PIVX on the rise"
        ],
        "upvotes": [
            1,
            5,
            4,
            5,
            3
        ]
    },
    "PKB": {
        "full_name": "ParkByte",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "POT": {
        "full_name": "PotCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PPC": {
        "full_name": "Peercoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PTC": {
        "full_name": "PesetaCoin ",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "PTOY": {
        "full_name": "Patientory",
        "mentioned_ids": [
            "dm7mzyl"
        ],
        "mentioned_times": [
            1503905855.0
        ],
        "text": [
            "Iota, FCT, PTOY, and Civic "
        ],
        "upvotes": [
            7
        ]
    },
    "QRL": {
        "full_name": "Quantum Resistant Ledger",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "QTUM": {
        "full_name": "Qtum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "QWARK": {
        "full_name": "Qwark",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RADS": {
        "full_name": "Radium",
        "mentioned_ids": [
            "dm7fcbh"
        ],
        "mentioned_times": [
            1503895572.0
        ],
        "text": [
            "IOTA, MTL, RADS"
        ],
        "upvotes": [
            4
        ]
    },
    "RBY": {
        "full_name": "RubyCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RDD": {
        "full_name": "ReddCoin",
        "mentioned_ids": [
            "dm72812"
        ],
        "mentioned_times": [
            1503878809.0
        ],
        "text": [
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk"
        ],
        "upvotes": [
            4
        ]
    },
    "REP": {
        "full_name": "Augur",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "RISE": {
        "full_name": "Rise",
        "mentioned_ids": [
            "dm7lojg",
            "dm6yq4v",
            "dm6r5c3",
            "6wg857"
        ],
        "mentioned_times": [
            1503904019.0,
            1503873959.0,
            1503856797.0,
            1503912570.0
        ],
        "text": [
            "Really looking forward to seeing Lisk develop. Honestly feel that this time round the project is going to go full term. One of the best funded projects in the space and with a fast growing roster of developers. \n\nWhen good to go it should be an all in one package for any one with basic computer knowledge to create a simple blockchain application. \n\nThey are working with Taikonauten to rebrand Lisk with a more corporate image. These guys have put out some really clean and fresh looking work for some big companies in the past so it should be good. \n\nAlso have an interest in RISE, a similar approach looking to create \"the WIX of the blockchain\" making it easy to drag and drop and create dApps. \n\nMuch smaller development team and no where near the level of funding that Lisk has, they have recently performed a chain swap from pure Lisk code to Shift-Ark hybrid.",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "I would buy SIA before the obelisks arrive. Personally I think is a good project, not necessarily a good investment right now. Sia is like Golem. Another good project, but not best investment. \nPrice will rise after asics come, I think. Mined coins usually rise in price overtime. ",
            "DataDash: PIVX on the rise"
        ],
        "upvotes": [
            3,
            5,
            7,
            3
        ]
    },
    "RLC": {
        "full_name": "iEx.ec",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SAFEX": {
        "full_name": "SafeExchangeCoin",
        "mentioned_ids": [
            "dm78v45"
        ],
        "mentioned_times": [
            1503887110.0
        ],
        "text": [
            "Omg, lisk, iota, eth, btc, Bch, sia, xrp, dnt and safex"
        ],
        "upvotes": [
            2
        ]
    },
    "SBD": {
        "full_name": "SteemDollars",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SC": {
        "full_name": "Siacoin",
        "mentioned_ids": [
            "dm72w1r",
            "dm73j4f",
            "dm7q4k2",
            "dm7k4w0",
            "dm7dtj7",
            "dm7b740",
            "6wbazi"
        ],
        "mentioned_times": [
            1503879649.0,
            1503880465.0,
            1503910084.0,
            1503901883.0,
            1503893601.0,
            1503890168.0,
            1503854253.0
        ],
        "text": [
            "IOTA skyrocketing and Neo reaching ETH prices. \n\nSiacoin to get massiv PR bump and adoptation. But this is years out i am afraid. \n\n\nI am also excited for BAT in general. It would be awesome if they could breakthrough. \n\n",
            "what I'm watching:\n\n* Wagerr: Betting platform using crypto. Easy to understand use-case and has real-world value today. Siacoin, Golem, and other projects have interesting use-cases but it's still up for grabs whether people will be interested in decentralized storage and computing, etc. People are interested in betting on sports today, so the use-case already exists. \n* Santiment: Another one I've been tracking for a while. They're attempting to be the Bloomberg Terminal of the crypto world. Definitely see the use-case as it's difficult to find information about different cryptocurrencies from a centralized location.  \n* IOTA: No fees, network gets faster the more people use it. No miners. That's a big fucking deal. Technology is fundamentally different from other coins, and it's not just another shitty ERC20 copy-paste. ",
            "NEO and Factom for sure, however there are many that I'm excited to see their future potential.\n\nLTC , IOTA, OMG, and I really wanna see SiaCoin do well (yet not as exciting).\n\nJust my opinions",
            "Blockstack and Siacoin.",
            "Siacoin will come good!",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "I invested in Siacoin and PIVX, are they both good longterm?"
        ],
        "upvotes": [
            59,
            22,
            5,
            1,
            10,
            2,
            4
        ]
    },
    "SEQ": {
        "full_name": "Sequence",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SHIFT": {
        "full_name": "Shift",
        "mentioned_ids": [
            "dm7lojg"
        ],
        "mentioned_times": [
            1503904019.0
        ],
        "text": [
            "Really looking forward to seeing Lisk develop. Honestly feel that this time round the project is going to go full term. One of the best funded projects in the space and with a fast growing roster of developers. \n\nWhen good to go it should be an all in one package for any one with basic computer knowledge to create a simple blockchain application. \n\nThey are working with Taikonauten to rebrand Lisk with a more corporate image. These guys have put out some really clean and fresh looking work for some big companies in the past so it should be good. \n\nAlso have an interest in RISE, a similar approach looking to create \"the WIX of the blockchain\" making it easy to drag and drop and create dApps. \n\nMuch smaller development team and no where near the level of funding that Lisk has, they have recently performed a chain swap from pure Lisk code to Shift-Ark hybrid."
        ],
        "upvotes": [
            3
        ]
    },
    "SIB": {
        "full_name": "Siberian Chervonets",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLR": {
        "full_name": "SolarCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SLS": {
        "full_name": "SaluS",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNGLS": {
        "full_name": "SingularDTV",
        "mentioned_ids": [
            "dm7dk4h",
            "dm79ixo"
        ],
        "mentioned_times": [
            1503893259.0,
            1503887970.0
        ],
        "text": [
            "SingularDTV. I'm really annoyed with the media industry for all of its political/propaganda bullshit and would like to remove the powers-that-be. One of my favourite TV shows was cancelled because of the personal political beliefs of one of the creators and a certain news organization with a vendetta against him.\n\nThat and the crazy youtube censorship going on these days shows how much power they have over the lives of the content creators. Enough is enough, let's throw out the archaic media industry and bring the power to the content creators.",
            "ETH\n\nFCT\n\nARK\n\nTAAS\n\nPART\n\nSNGLS  (think it's gonna take off in the next few weeks) "
        ],
        "upvotes": [
            3,
            1
        ]
    },
    "SNRG": {
        "full_name": "Synergy",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SNT": {
        "full_name": "Status Network Token",
        "mentioned_ids": [
            "dm7mzib"
        ],
        "mentioned_times": [
            1503905838.0
        ],
        "text": [
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here.."
        ],
        "upvotes": [
            1
        ]
    },
    "SPHR": {
        "full_name": "Sphere",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SPR": {
        "full_name": "SpreadCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "START": {
        "full_name": "StartCoin",
        "mentioned_ids": [
            "dm76bpc",
            "dm7gkyu",
            "dm7h9uh",
            "dm6nw52",
            "dm72pgd",
            "dm6nsew"
        ],
        "mentioned_times": [
            1503883900.0,
            1503897189.0,
            1503898097.0,
            1503847372.0,
            1503879420.0,
            1503847112.0
        ],
        "text": [
            "Factom is one of the few coins in my portfolio which  I think will fill a multi-billion dollar position in the long term. It is basically an immutable data layer on which applications can be built, factom Inc mostly focusses on getting their product done but once they start advertising and bringing in the big financial and mortgage firms it will be unstoppable. In my opinion their future plans are simply brilliant and they have always followed their white paper carefully. This protocol can take away corruption, fraud, and money spent on accounting and auditing, which I think has a mind blowing value.\n\nI believe in this project more than any other, including the ones that already proved themselves.",
            "I'm taking the opportunity to make use of the ambiguity of the question, and want to mention technologies that aren't a conventional product, but are using the Blockchain and crypto technology - or are inspired by it - to take the internet to the next level, towards a more structured landscape of decentralized platforms, embodying the idea of distributed value and trust/legitimacy beyond a simple product. Basically a vision like that of Berners-Lee (inventor of the world wide web) and others who're brainstorming on the future of the internet, and how it can actually become positively intertwined and beneficial with/to society's development. \n \nSo I'm really excited about projects that resonate with that vision. I stumbled upon [Ananas](https://www.ananas.org.uk) and keep an eye open for similar projects. Looking at it I think they're still in the very early stages, but feel like they do have a very good vision and would love to see more stuff like it. Hopefully it's not too unclear what I mean, and someone can point me to similar things that have a real potential benefit to society on a larger scale.\n \nWhat they do specifically  is a totally new way at fulfilling a societal need that at the moment is centralized in for-profit organizations, in Ananas' case the creation, integration, and development of subjective knowledge within the confines of a dedicated platform. \n \nMaybe it's because I'm just so sick and tired of the constant misinformation in the world, and absolute lack of clarity on how to deal with this as a society. Don't get me wrong, some news organisations and projects are doing their best changing the way we get news and learn about the world, but in the end they're all limited in one way or another.\n \nI used to be a Dawkins-esque militant atheist, but then a christian friend changed my mind. I'm still agnostic, and very aware of the flaws of religion, but also how I dont think religion and spirituality is ever going to disappear from society. In fact, I think it's aways going to be human nature to desire something of a meta narrative. Might as well provide a good place for it to develop right? Safe from bias, distortion, and ensuring it'll develop in alignment with universal values. \n \nThe plan seems to  be to use a token coin as its native currency to fuel incentives and collaborative development, through social engineering and what I guess can be described as a hybrid (Artificial and human) intelligence to create a virtual dataset of collective knowledge. \n \nSometimes I see an ICO where I feel like either the use of token is unnecessary, or that it just takes one competitor to demolish the potential value of that token. I just really feel like there should be more stuff like this, where a token is tied to a platform that provides societal value and symbolizes  decentralized trust and value in different forms (legitimacy of knowledge/info, mutual understanding, and value of open knowledge in the case of Ananas), so please, if you know something similar or plan on doing a start-up, let me know. \n \nNot saying the other stuff out there isn't valuable, quite a lot of it is, just kinda hoping the crypto/blockchain movement is gonna mature to something greater.",
            "Pretty much only EOS but can't be sure about it until 11 months from now. testnet in september to start making dapps that work as fast as their centralized counterparts but in decentralized manner. Many other coins are good, but this is real new spin on graphene by generalizing it.\n\nhttp://imgur.com/a/7lx34",
            "Is there a coin with 2SV? So far ive only seen:\n\n- you start the wallet and to pay you need a password you made up\n- same bit with a passphrase the wallet gave you (terrible solution to be honest). \n- you need to enter the private account number before you can enter the wallet. This address can be a phrase of 80 characters. \n\nBut is there a:\n- I pay with a desktop wallet, need to confirm with sms code\n- pay with phone, need to confirm with fingerprint\n",
            "As the value of ETH/USD goes up of course you're going to get a poorer deal at the end of an ICO compared to the start. If Everex does reach it's hard cap, its market value will still only be about $23mil which is very low for a company that has a very useful working product.",
            "Can we start flairing vertcoin posts so the rest of us can filter them out"
        ],
        "upvotes": [
            103,
            10,
            1,
            2,
            2,
            10
        ]
    },
    "STEEM": {
        "full_name": "STEEM",
        "mentioned_ids": [
            "dm7sf4c",
            "dm7uplr"
        ],
        "mentioned_times": [
            1503913271.0,
            1503916331.0
        ],
        "text": [
            "HERO (new market pegged asset on BitShares) because it may very well be the answer to the question of \"How can we successfully sell cryptocurrency to Joe the plumber along with all of his friends, and all of their friends?\" It is literally the only cryptocurrency based financial instrument that grants people something flat out unavailable to them from the legacy financial system: a completely liquid savings account with 5% APR. And it's on a blockchain that can scale to MasterCard levels of tx/sec today - as in right now, not someday in the future when a scaling solution that may or may not work is developed. \n\nOther graphene chains - Peerplays, Muse, Steem, and Calibrae (a upcoming fork of STEEM that relieves whales who mined a shitload during the early hyperinflationary period of their advantage, placing those funds in the reward pool).\n\nMonero because fungibility. \n\nEOS because scalability.",
            "any love for Steem here?"
        ],
        "upvotes": [
            2,
            1
        ]
    },
    "STORJ": {
        "full_name": "Storj",
        "mentioned_ids": [
            "dm7dy43",
            "dm7iceu",
            "dm7mzib"
        ],
        "mentioned_times": [
            1503893764.0,
            1503899522.0,
            1503905838.0
        ],
        "text": [
            "Anything where we decentralize shit using the internet of money:\n\n* Decentralized Uber\n\n* Decentralized AirBNB\n\n* p2p electric grid\n\n* p2p incentivized mesh network\n\n* Distributed storage thru something like Sia or Storj\n\n* Distributed processing thru Golem",
            "IOTA, Sia & Storj (not gonna put all my eggs in one basket), MaidSafe",
            "BTC\nBCH\nETH\nNEO\nGNT\nBAT\nSNT\nSTORJ\nSIGT\n\nLove to hear feedback here.."
        ],
        "upvotes": [
            21,
            6,
            1
        ]
    },
    "STRAT": {
        "full_name": "Stratis",
        "mentioned_ids": [
            "dm7drql",
            "dm7hoyx",
            "dm6und6"
        ],
        "mentioned_times": [
            1503893538.0,
            1503898652.0,
            1503866541.0
        ],
        "text": [
            "BITCOIN + TUMBLEBIT. I'm excited with Tumblebit that Stratis is implementing on Breeze Wallet. The big lack of privacy of Bitcoin gonna be fixed by this tech.",
            "These numbers are how much I put into the coins a couple of days ago. I think my portfolio has raised 20$ or something.\n\n100$ - Ardor\n100$ - Stratis\n100$ - OMG\n300$ - LTC",
            "I would say that you need to buy at least 5 coins such as Factom, Dash, Monero and Stratis in addition to ETH. All have good teams and clear functionalities"
        ],
        "upvotes": [
            1,
            1,
            0
        ]
    },
    "SWIFT": {
        "full_name": "Bitswift",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SWT": {
        "full_name": "Swarm City Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYNX": {
        "full_name": "Syndicate",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "SYS": {
        "full_name": "SysCoin",
        "mentioned_ids": [
            "dm79p2m",
            "dm7nncg"
        ],
        "mentioned_times": [
            1503888195.0,
            1503906767.0
        ],
        "text": [
            "Groestlcoin and syscoin also at least. Maybe few others...",
            "Add Syscoin & Digibyte to the list for coins on SegWit and using cross chain atomic swaps. On my cell now but had the same thought earlier and I can link to a few articles."
        ],
        "upvotes": [
            1,
            1
        ]
    },
    "THC": {
        "full_name": "HempCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TIME": {
        "full_name": "Chronobank Time",
        "mentioned_ids": [
            "dm791eg",
            "dm7ka8k",
            "dm7lojg",
            "dm7a8sd",
            "dm6syzx",
            "dm6x9yz",
            "dm6yon0",
            "dm7hev3",
            "dm72v9o",
            "dm758kt",
            "dm7trki",
            "dm737al",
            "dm74f5y",
            "6wb6am",
            "dm7hag2",
            "dm7iytd",
            "dm7bwyt",
            "dm7u7ix",
            "dm707o3",
            "dm7btp5",
            "dm6pf68",
            "6wdxts",
            "6wbtnb",
            "dm7mwrx"
        ],
        "mentioned_times": [
            1503887340.0,
            1503902092.0,
            1503904019.0,
            1503888916.0,
            1503862365.0,
            1503871608.0,
            1503873892.0,
            1503898285.0,
            1503879622.0,
            1503882524.0,
            1503915217.0,
            1503880049.0,
            1503881539.0,
            1503851591.0,
            1503898119.0,
            1503900328.0,
            1503891110.0,
            1503915836.0,
            1503876170.0,
            1503890989.0,
            1503851498.0,
            1503888424.0,
            1503864270.0,
            1503905735.0
        ],
        "text": [
            "I've been a FCT fan for a long time.\n\nArk has only been mentioned once here. It's the tech that will tie them all together.",
            "Faster performance, smart contracts, and decentralized exchanged. As far as performance goes, I'd love to see close to real time applications running on blockchains. ",
            "Really looking forward to seeing Lisk develop. Honestly feel that this time round the project is going to go full term. One of the best funded projects in the space and with a fast growing roster of developers. \n\nWhen good to go it should be an all in one package for any one with basic computer knowledge to create a simple blockchain application. \n\nThey are working with Taikonauten to rebrand Lisk with a more corporate image. These guys have put out some really clean and fresh looking work for some big companies in the past so it should be good. \n\nAlso have an interest in RISE, a similar approach looking to create \"the WIX of the blockchain\" making it easy to drag and drop and create dApps. \n\nMuch smaller development team and no where near the level of funding that Lisk has, they have recently performed a chain swap from pure Lisk code to Shift-Ark hybrid.",
            "You don't enjoy having a seizure every time you come here?",
            "> How to solve this?\n\nIt is what it is. This is the wild west gold rush where you catch dysentry or your wagon breaks down and you're SIL. Welcome to the real world, where dangers are very real and tons of inventions and innovations are still being discovered. Born too late to explore the earth, born too soon to explore outerspace, born just in time to explore the wacky world of cryptocurrency.\n\nRealistically what will happen is old-money investors will have an entity like a bank managing and/or insuring their crypto for them. For the mainstream crypto will just be the mysterious inner workings of the app on their smartphone or their debit card.\n\nWe could probably do something with smart contracts to undo transactions from hackers. Perhaps something to tie a crypto address or transactions with multiple biometrics, multi factor security.",
            "slightly off topic, but where can I buy altcoins with LTC?\n\ntired of having to lose money+time in using BTC. Thanks. ",
            "This exchange is winning more and more of my trust every day, time to move all my crypto out of it :|",
            "I don't understand it guys, what exactly did they implement? \n\nI was waiting for email verification on withdraws but this isn't the case I think. What additional part is added? Every time you login, will you receive a confirmation mail? ",
            "Pretty cool idea in theory man. \n\nYou need better marketing though; better copy. More focus on benefit as opposed to features. \n\nAnd/or perhaps you're trying to solve a problem that not enough people view as very problematic at this point in time. \n\nWho's your target audience? Would those who would benefit from something like this be technologically able/inclined to use it? \n\nEtc. \n\nWay to be on distributing back the ETH. Stay classy. \n\nAnd oh--you didn't fail. You just learned you need to do things differently next time. You learned what NOT to do here.\n\nSo get back to the lab, refine your idea, read the book The Science of Getting Rich by Wallace Wattles and help the world out. ",
            "I would have tried for more professional pictures in your bio. And the FOOD tokens should be bought behind the scenes. If you could buy the food with fiat and have it buy and burn some FOOD tokens with every transaction then you would have had a better structure. Nobody can imagine themselves or farmers buying food with FOOD tokens. Should have been an option between fiat, Ethereum, Bitcoin or the food token (which gets you a slight discount). \n\nBetter luck next time!",
            "You guys definitely deserve some luck the next time around. You know, most ICO would have just made up an excuse to keep the money. Glad you guys are returning it \n\nICO is literally all about marketing. All that Google Adwords campaigns and banners on coinmarketcap and Reddit advertisements... that's where the money should go into. You spend 10k on advertising the ICO a week before it starts and you would have made the minimum ",
            "> We have spent over $20,000 and actually don't have any more money to help fund the project.\n\nHahaha. http://i.imgur.com/qbuNtEd.gif \n\nI've literally seen projects with no platform, almost no plan, no product raise more than $1 million almost instantaneously. Seriously, if you can't raise any money it's your damn fault. \n\n> I'm sorry so many people thought it was a SCAM when it clearly is not.... but that is reddit for you....\n\nI've never even heard of you or seen you mentioned at all. Kind of hard to think something's a scam when I don't even know of its existence. Maybe do better marketing next time. \n\nGet over yourself man. ",
            "Pfffft, Fontas was the best scam shiller of all time",
            "Lisk Price Reaches a new All-time High of $7.27",
            "I didn't read in detail about lisk's version of dpos and I'm a little shocked\n\nIt rewards voting for people based on their share?!\n\nIsn't that like bribery? Someone with could get a ton of voting power just by offering high payments alone.\n\nThis is specifically avoided in bitshares (creator of dpos) to even out the choices to where individual actions are most important requiring some research. And if you can't do the research to vote for witnesses/dao/, no time, you find a proxy you like who's job it is to vote and monitor witnesses behavior for you. Witnesses do sometimes burn some % of their reward to deflate supply (which is capped).\n\n",
            "Noone will risk compatibility issues with a new browser easily. Additionally many will patch around ad removal, like youtube does really well\n\nFurthermore it uses ethereum, known best as [chain of liars and thieves](https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb) and [centralization](https://www.reddit.com/r/ethereumfraud/comments/6bgvqv/faq_what_exactly_is_the_fraud_in_ethereum/) - which means it's not secure for any use case unless you're the one it's centralized around. It's one of the slower blockchains with most bloat with infinitely big attack surface prone to significant downtimes, rarely up for more than few months at a time without enormous issues. Can't really trust a developer who would ever rely on something that flawed with hundreds if not thousands of superior alternatives.\n\nICO's are a centrally controlled funding in a field built around decentralization and plenty of other funding options. Good luck firing the developers for being bad or malicious when they are the only ones with funding forcing the tokens to die in value or succeed through misinformation like the centralized platform it was built on did. They in the end will decide which contracts are real and which ones are outdated or \"illegal\" due to that. No one can say how long misinformation campaign success can last.\n\nAdvertisement is a dying industry that requires centralization to push it.\n\nGoogle plans some of similar [features](http://www.latimes.com/business/la-fi-tn-google-chrome-ad-block-20170602-story.html).",
            "I sold all mine and glad I did, but not sure what the hell I'm going to do when it's time to do taxes.   The one person you don't want to fuck with is the IRS.  I'm also wondering if I come forward and file am I then on the radar more for future shit because I filed?",
            "Reporting it as income would require disclosing your exact BTC holdings to the IRS.  I think thats the kind of thing that could result is some serious legal challenges.  \n\nFor example if Satoshi happens to be a US citizen would he be required to reveal himself and claim a million Bitcoin Cash as income on his tax return despite never having sold any of those coins?  \n\nIf I owned a single 25 BTC physical coin that I bought for $50 or so back in the day am I required to crack it open and sell off enough to cover the tax?  Same deal if I mined coins years ago that I have never sold.\n\nWhat if Bitcoin Cash dies before the end of the year does everyone who had bitcoins at the time of the split just owe a shit load of tax anyway.  You can't write off the loss if you can't sell it.  \n\nI sat with my tax guy for a few hours talking about this and a few other crypto issues and I don't think this is a likely outcome.  Not to give the IRS the benefit of thinking they will make the sane choice, but there are just so many issues with doing it that way.  Where if they just consider it something more less gifted to you for free with 0 basis it's pretty simple to deal with.\n\n",
            "Is each whoppercoin backed by a whopper burger? It's about time we had a cryptocurrency with some burger backing.   \n    \nI can see it 100 years from now the likes of burger king and McDonald's control the world's two major currencies /s.",
            "Coinbase (and Gemini) are great on-ramps for people unfamiliar with crypto. I highly recommend them to anyone just getting into it.\n\nI'd also take a lot of the reviews with heavy doses of salt. I see so many people bitching about Coinbase closing their accounts, etc and not understanding that the company will follow US KYC and AML laws to the letter. That means if you buy on Coinbase and transfer funds to known gambling sites or questionable exchanges, you're putting your account at risk. They've also grown exponentially over the last year and they, like all exchanges, have had a rough time keeping up with customer service issues. I for one have never had a single issue with my account and transfers in and out (some very large) have been fast and easy - no issues.\n\nI know I sound like a Coinbase apologist here but as someone who works in the fintech space, I have a soft spot for what a shitshow it must be at Coinbase on some days trying to deal with the huge flood of new users who don't know jack about cryptocurrency.\n\nAs others in the thread have said, other exchanges are much better once you've gone down the rabbit hole. GDAX (owned by Coinbase), bittrex, and Kraken are the other three I recommend depending on what my friends are interested in trading. Good luck with your investments!",
            "Ask the developers of your favourite coins to get in contact in order to get listed on [BarterDex](http://coremedia.info/blockchain-news/item/836-barterdex-atomic-swaps-made-easy). It's completely free: you never get delisted and in time your coin will enjoy a seamless integration with other [SuperNet](https://www.supernet.org/en) features.",
            "Litecoin has gone up nearly 1500% in value since the end of march, and that isn't stopping soon. The best time to buy was a year ago, the second best time is now.",
            "MonteCrypto.eu Poll, is it time to Buy BAT?",
            "atomic swaps have existed for a long time now.\n\nblocknet and supernet have made it their specialty by serving as inbetween chain and matching orders for liquidity.\n\nI think blocknet has got it working for like 10-15 of them.\n\nNote, they are typically quite slow as require on chain tx on each one, not like traditional exchanges or even fast dex like bts dex.\n\nyou can also do p2p atomic swapping depending on blockchain.\n\n\nIt's pretty simple conceptually but requires some features on chains to make it easier and to account for various designs of blockchains - e.g. \"when is it considered safe\".\n\nhttps://en.bitcoin.it/wiki/Atomic_cross-chain_trading\n\nhttps://bitcoinmagazine.com/articles/atomic-swaps-how-the-lightning-network-extends-to-altcoins-1484157052/\n\nhttps://themerkle.com/what-is-an-atomic-swap/\n\nhttps://www.coindesk.com/cross-blockchain-trades-lightning-gives-new-life-atomic-swaps/\n\nhttps://steemit.com/cryptocurrency/@digicrypt/atomic-swaps-future-of-crypto\n\nhttps://www.reddit.com/r/theblocknet/comments/676buj/ask_anything_about_blocknet_qa/"
        ],
        "upvotes": [
            15,
            3,
            3,
            3,
            2,
            8,
            11,
            1,
            13,
            3,
            1,
            -40,
            1,
            28,
            0,
            1,
            3,
            2,
            5,
            7,
            2,
            1,
            3,
            3
        ]
    },
    "TKN": {
        "full_name": "TokenCard",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TKS": {
        "full_name": "Tokes",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRIG": {
        "full_name": "TRIG Token",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRST": {
        "full_name": "Trustcoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "TRUST": {
        "full_name": "TrustPlus",
        "mentioned_ids": [
            "dm7gkyu",
            "dm6ymda",
            "dm6ywdb",
            "dm6yon0",
            "dm7iytd"
        ],
        "mentioned_times": [
            1503897189.0,
            1503873792.0,
            1503874231.0,
            1503873892.0,
            1503900328.0
        ],
        "text": [
            "I'm taking the opportunity to make use of the ambiguity of the question, and want to mention technologies that aren't a conventional product, but are using the Blockchain and crypto technology - or are inspired by it - to take the internet to the next level, towards a more structured landscape of decentralized platforms, embodying the idea of distributed value and trust/legitimacy beyond a simple product. Basically a vision like that of Berners-Lee (inventor of the world wide web) and others who're brainstorming on the future of the internet, and how it can actually become positively intertwined and beneficial with/to society's development. \n \nSo I'm really excited about projects that resonate with that vision. I stumbled upon [Ananas](https://www.ananas.org.uk) and keep an eye open for similar projects. Looking at it I think they're still in the very early stages, but feel like they do have a very good vision and would love to see more stuff like it. Hopefully it's not too unclear what I mean, and someone can point me to similar things that have a real potential benefit to society on a larger scale.\n \nWhat they do specifically  is a totally new way at fulfilling a societal need that at the moment is centralized in for-profit organizations, in Ananas' case the creation, integration, and development of subjective knowledge within the confines of a dedicated platform. \n \nMaybe it's because I'm just so sick and tired of the constant misinformation in the world, and absolute lack of clarity on how to deal with this as a society. Don't get me wrong, some news organisations and projects are doing their best changing the way we get news and learn about the world, but in the end they're all limited in one way or another.\n \nI used to be a Dawkins-esque militant atheist, but then a christian friend changed my mind. I'm still agnostic, and very aware of the flaws of religion, but also how I dont think religion and spirituality is ever going to disappear from society. In fact, I think it's aways going to be human nature to desire something of a meta narrative. Might as well provide a good place for it to develop right? Safe from bias, distortion, and ensuring it'll develop in alignment with universal values. \n \nThe plan seems to  be to use a token coin as its native currency to fuel incentives and collaborative development, through social engineering and what I guess can be described as a hybrid (Artificial and human) intelligence to create a virtual dataset of collective knowledge. \n \nSometimes I see an ICO where I feel like either the use of token is unnecessary, or that it just takes one competitor to demolish the potential value of that token. I just really feel like there should be more stuff like this, where a token is tied to a platform that provides societal value and symbolizes  decentralized trust and value in different forms (legitimacy of knowledge/info, mutual understanding, and value of open knowledge in the case of Ananas), so please, if you know something similar or plan on doing a start-up, let me know. \n \nNot saying the other stuff out there isn't valuable, quite a lot of it is, just kinda hoping the crypto/blockchain movement is gonna mature to something greater.",
            "I personally do not trust the banks, not because I think they are evil and stuff. To me they were just a necessity of our society and with developments we have found a better way. Crypto is the future but that doesn't mean everyone will make millions in it, so I get your fear.\n\nThe simple answer is to diversify into as many things as possible, if safety is your major concern.\n\nIn my country, as per my knowledge, the government only insures you for 1,00,000/- Rs for each bank account. So if you had 10 million in it, it wouldn't matter, you will only get 1,00,000/- if the bank belly ups.\n\nSo put some of your money in different banks, some in SIP's, some in mutual funds, some in assets and some in crypto. You can diversify even more within these, like have money in multiple SIP's, mutual funds, various assets and even different exchanges and wallets and coins.",
            "I agree it's a problem. Crypto puts the burden of security on the user. If you just want to store your funds, you can get near perfect security by using a paper wallet with backups and never entering your private key into an Internet connected device. \n\nI'm not sure 2fa is possible without extending your trust to some entity off the blockchain.",
            "This exchange is winning more and more of my trust every day, time to move all my crypto out of it :|",
            "Noone will risk compatibility issues with a new browser easily. Additionally many will patch around ad removal, like youtube does really well\n\nFurthermore it uses ethereum, known best as [chain of liars and thieves](https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb) and [centralization](https://www.reddit.com/r/ethereumfraud/comments/6bgvqv/faq_what_exactly_is_the_fraud_in_ethereum/) - which means it's not secure for any use case unless you're the one it's centralized around. It's one of the slower blockchains with most bloat with infinitely big attack surface prone to significant downtimes, rarely up for more than few months at a time without enormous issues. Can't really trust a developer who would ever rely on something that flawed with hundreds if not thousands of superior alternatives.\n\nICO's are a centrally controlled funding in a field built around decentralization and plenty of other funding options. Good luck firing the developers for being bad or malicious when they are the only ones with funding forcing the tokens to die in value or succeed through misinformation like the centralized platform it was built on did. They in the end will decide which contracts are real and which ones are outdated or \"illegal\" due to that. No one can say how long misinformation campaign success can last.\n\nAdvertisement is a dying industry that requires centralization to push it.\n\nGoogle plans some of similar [features](http://www.latimes.com/business/la-fi-tn-google-chrome-ad-block-20170602-story.html)."
        ],
        "upvotes": [
            10,
            1,
            1,
            11,
            1
        ]
    },
    "TX": {
        "full_name": "TransferCoin",
        "mentioned_ids": [
            "dm7sf4c",
            "dm7vvun",
            "dm7rf58",
            "dm7mwrx"
        ],
        "mentioned_times": [
            1503913271.0,
            1503917570.0,
            1503911811.0,
            1503905735.0
        ],
        "text": [
            "HERO (new market pegged asset on BitShares) because it may very well be the answer to the question of \"How can we successfully sell cryptocurrency to Joe the plumber along with all of his friends, and all of their friends?\" It is literally the only cryptocurrency based financial instrument that grants people something flat out unavailable to them from the legacy financial system: a completely liquid savings account with 5% APR. And it's on a blockchain that can scale to MasterCard levels of tx/sec today - as in right now, not someday in the future when a scaling solution that may or may not work is developed. \n\nOther graphene chains - Peerplays, Muse, Steem, and Calibrae (a upcoming fork of STEEM that relieves whales who mined a shitload during the early hyperinflationary period of their advantage, placing those funds in the reward pool).\n\nMonero because fungibility. \n\nEOS because scalability.",
            "fun fact: monero has i2p router in development called kovri https://github.com/monero-project/kovri\n\nkovri was chosen because it's more anonymous than tor\n\nhttps://monero.stackexchange.com/questions/16/why-was-i2p-chosen-over-tor-for-native-monero-integration\n\nThat table is missing a ton of criteria: forced anonymity?, shows amounts? (xmr uses ringct), trusted setup (lol)?, ico vs fair distribution?\n\nico = bad distribution = PoS security risk since coins directly affect security\n\nI see nothing about no fees on it which won't make sense since you have to protect against sybil attacks in some way, and there are some experimental ways in some coins, but I see nothing like that here. I'm sure since it's not used heavily the fees are just low or the blocks aren't full so there's no concern about prioritizing transaction until it's heavier used - the case with most altcoins.\n\nFees are a solution to a problem of how to avoid requiring infinite bandwidth to validate nodes which is a security risk - blocksize limit needs a way to prioritize tx - they are normally fees. xmr uses adjustable blocksize automatically changing to account for increases or decreases to keep it secure and on small size but still needs fees\n\nzerocash and pivx required trusted setup, so they are not an option for trustless crypto.\n\nxspec has zeroknowledge proofs so it also required trusted setup and thus not an option for trustless crypto https://bitcointalk.org/index.php?topic=1704473.0\n\nperpetual 5% yearly inflation is much higher than [xmr's plan](https://en.wikipedia.org/wiki/Monero_\\(cryptocurrency\\)) of < 0.87%. \n\noh god it has a rich list LOL https://chainz.cryptoid.info/xspec/#!rich\n\nfor comparison, this is xmr rich list: http://moneroblocks.info/richlist (it's literally impossible)\n\nFew more things like we're not entirely sure PoS3 is secure against double spend attacks and nothing at stake issue PoW solves elegantly. Other forms of PoS might be better, but it's debatable and hasn't been tested properly.\n\nI guess point is: probably more to read",
            "Deposit fiat onto coinbase (no fee). Use gdax to buy LTC (no fee). Transfer LTC to exchange (only .001) tx fee.  ",
            "atomic swaps have existed for a long time now.\n\nblocknet and supernet have made it their specialty by serving as inbetween chain and matching orders for liquidity.\n\nI think blocknet has got it working for like 10-15 of them.\n\nNote, they are typically quite slow as require on chain tx on each one, not like traditional exchanges or even fast dex like bts dex.\n\nyou can also do p2p atomic swapping depending on blockchain.\n\n\nIt's pretty simple conceptually but requires some features on chains to make it easier and to account for various designs of blockchains - e.g. \"when is it considered safe\".\n\nhttps://en.bitcoin.it/wiki/Atomic_cross-chain_trading\n\nhttps://bitcoinmagazine.com/articles/atomic-swaps-how-the-lightning-network-extends-to-altcoins-1484157052/\n\nhttps://themerkle.com/what-is-an-atomic-swap/\n\nhttps://www.coindesk.com/cross-blockchain-trades-lightning-gives-new-life-atomic-swaps/\n\nhttps://steemit.com/cryptocurrency/@digicrypt/atomic-swaps-future-of-crypto\n\nhttps://www.reddit.com/r/theblocknet/comments/676buj/ask_anything_about_blocknet_qa/"
        ],
        "upvotes": [
            2,
            1,
            1,
            3
        ]
    },
    "UBQ": {
        "full_name": "Ubiq",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UNB": {
        "full_name": "UnbreakableCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "UNO": {
        "full_name": "Unobtanium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VIA": {
        "full_name": "ViaCoin ",
        "mentioned_ids": [
            "dm7e51b",
            "dm6smkk",
            "dm7so55",
            "dm7b6j7",
            "dm7w6cb"
        ],
        "mentioned_times": [
            1503894010.0,
            1503861373.0,
            1503913633.0,
            1503890147.0,
            1503917906.0
        ],
        "text": [
            "Ltc. I am, banking on a lot of business from bitcoin via atomic swaps and LN. ",
            "The money in the bank isn't actually yours. It's really just a representation of what the bank owes you. You have turned over your property to the bank in return for a debt claim and if its a large amount it can be an unsecured debt claim. The worse part is when you leave it there and they lend against it and then the government collects tax on any interest you earn and steal its value via inflation. You are also allowing the governments to know how much asset you have. They can use this against you too.",
            "[Viacoin is a known scam](https://www.reddit.com/r/btc/comments/42depj/whats_the_story_with_the_viacoin_scam_anyone_one/)",
            "I want to buy LTC and trade it for other coins as BTC fees are crazy. I wanted to use cards to buy in due to accessibility. Will I be better off just using Kraken and pay via SEPA?",
            "ethereum popularizing censorship and centralization - its core principles - so nothing will change, just have expensive overhead for no reason\n\nit's culture of marketing of bad ideas and bad tech has already succeeded in popularizing premines via ico's"
        ],
        "upvotes": [
            1,
            1,
            2,
            1,
            1
        ]
    },
    "VOX": {
        "full_name": "Voxels",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VRC": {
        "full_name": "VeriCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VRM": {
        "full_name": "Verium",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "VTC": {
        "full_name": "Vertcoin",
        "mentioned_ids": [
            "dm6xp9z",
            "dm72812",
            "dm6y1x5",
            "6war3h",
            "dm6nsew",
            "dm6mrif",
            "dm6o0ld"
        ],
        "mentioned_times": [
            1503872315.0,
            1503878809.0,
            1503872875.0,
            1503843780.0,
            1503847112.0,
            1503844706.0,
            1503847683.0
        ],
        "text": [
            "Ltc btc and eth. Thinking about buying some ark, omg, or vtc.",
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk",
            "90% BTC\n\n9.5% Omise-Go\n\n0.5% (Combination of Dogecoin, Vertcoin,DigiByte, Litecoin)",
            "Can we add a \"Vertcoin fan\" flair?",
            "Can we start flairing vertcoin posts so the rest of us can filter them out",
            "Vertcoin - *Join the Resistance*",
            "Can vertcoin just go to the Asia exchanges please "
        ],
        "upvotes": [
            9,
            4,
            2,
            6,
            10,
            3,
            3
        ]
    },
    "VTR": {
        "full_name": "vTorrent",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "WAVES": {
        "full_name": "Waves",
        "mentioned_ids": [
            "dm79c6z",
            "dm7komj",
            "dm7lb0m",
            "dm7va42"
        ],
        "mentioned_times": [
            1503887727.0,
            1503902640.0,
            1503903514.0,
            1503916912.0
        ],
        "text": [
            "Kinda weird nobody mentioned waves yet",
            "WAVES: A decentralized exchange  \nLEV: Decentralized AND derivatives trading  \nARAGON: Decentralized governance  \nIOTA: This may make blockchain issues moot",
            "I'm not really a fan of waves bc too similar to existing projects and slower and centralized matching, but thought this is good media publicity. But there's also random forks of waves happening and e.g. [cryptopia blocking any future waves tokens](https://www.cryptoninjas.net/2017/08/21/cryptopia-no-longer-accepting-new-waves-token-listings-due-network-split/)? I couldn't find good source to read about it other than [official statement](https://twitter.com/twiggysmile/status/900400594426449923) ",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv."
        ],
        "upvotes": [
            5,
            3,
            1,
            3
        ]
    },
    "WINGS": {
        "full_name": "Wings DAO",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XAUR": {
        "full_name": "Xaurum",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XBB": {
        "full_name": "Boolberry",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XCP": {
        "full_name": "Counterparty",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XDN": {
        "full_name": "DigitalNote",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XEL": {
        "full_name": "Elastic",
        "mentioned_ids": [
            "dm7dj35",
            "dm7va42",
            "6wfmbl"
        ],
        "mentioned_times": [
            1503893222.0,
            1503916912.0,
            1503905802.0
        ],
        "text": [
            "elastic is a true supercomputer..",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "Supercomputer Powered by Blockchain Technology Golem (GNT) vs. Elastic (XEL) — Steemit"
        ],
        "upvotes": [
            3,
            3,
            2
        ]
    },
    "XEM": {
        "full_name": "NewEconomyMovement",
        "mentioned_ids": [
            "6wdpv3"
        ],
        "mentioned_times": [
            1503886222.0
        ],
        "text": [
            "NEM (XEM). Some questions"
        ],
        "upvotes": [
            4
        ]
    },
    "XLM": {
        "full_name": "Lumen",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XMG": {
        "full_name": "Magi",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XMR": {
        "full_name": "Monero",
        "mentioned_ids": [
            "dm784ke",
            "dm790al",
            "dm7gzu7",
            "dm7sf4c",
            "dm7mijb",
            "dm7eciy",
            "dm7mdfy",
            "dm6updk",
            "dm6qypn",
            "dm6q7jj",
            "dm7vvun",
            "dm75dr8",
            "6way04",
            "dm6otwt",
            "dm6yq4v",
            "dm6zk1r",
            "dm7b740",
            "dm6z5ii",
            "dm72sq1",
            "6wbsbg",
            "dm6umsb",
            "dm6u4st",
            "dm6vyxw",
            "dm6und6",
            "dm7ugz2",
            "dm7xggk",
            "dm7va42",
            "dm6hk44",
            "dm6n3v6"
        ],
        "mentioned_times": [
            1503886165.0,
            1503887299.0,
            1503897731.0,
            1503913271.0,
            1503905178.0,
            1503894277.0,
            1503904979.0,
            1503866662.0,
            1503856214.0,
            1503853834.0,
            1503917570.0,
            1503882706.0,
            1503847176.0,
            1503849828.0,
            1503873959.0,
            1503875244.0,
            1503890168.0,
            1503874632.0,
            1503879536.0,
            1503863644.0,
            1503866506.0,
            1503865371.0,
            1503869214.0,
            1503866541.0,
            1503916102.0,
            1503919465.0,
            1503916912.0,
            1503835396.0,
            1503845477.0
        ],
        "text": [
            "This is not investment advice, just the coins I like a lot.\n\nLTC, ETH, XMR, NEO and OMG ",
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "Monero XMR\n\nIt's the only fungible cryptocurrency in existence as far as I'm aware",
            "HERO (new market pegged asset on BitShares) because it may very well be the answer to the question of \"How can we successfully sell cryptocurrency to Joe the plumber along with all of his friends, and all of their friends?\" It is literally the only cryptocurrency based financial instrument that grants people something flat out unavailable to them from the legacy financial system: a completely liquid savings account with 5% APR. And it's on a blockchain that can scale to MasterCard levels of tx/sec today - as in right now, not someday in the future when a scaling solution that may or may not work is developed. \n\nOther graphene chains - Peerplays, Muse, Steem, and Calibrae (a upcoming fork of STEEM that relieves whales who mined a shitload during the early hyperinflationary period of their advantage, placing those funds in the reward pool).\n\nMonero because fungibility. \n\nEOS because scalability.",
            "Ethereum, but not so much for its own sake (it is my favorite platform FYI), but for what it enables.\n\nOn it, bancor. \n\nOutside of ethereum, I'm watching dash and monero closely.",
            "I know i'm just shilling my coin but Cloakcoin has amazing potential. Privacy is and will be a huge concern and while monero has great privacy it is not user friendly at all and doesn't look like it will be anytime soon. Cloak is very user friendly, has great privacy and is a POS coin so doesn't burn electricity like all the POW coins. They will be going fully open source soon and could be a contender in the top then of crypto very soon. ",
            "A problem I have with litecoin is the high volume of coins. Bitcoin 21m, xmr 18m, litecoin 55m and counting!",
            "Koreans man, the koreans getting behind it, might folow the same story as monero just did. ",
            "Ok this will be a noob question but havent really looked much into the wallets, just because i hold only like 90-100$ worth of usd on exchange, but for future I want be secured. \n\nIm currently holding ark, xmr, adx, cvc, dnt and some other coins. which wallet could hold all these coins in one place? Or do i have to download seperate wallets for some coins? Also will I be losing some money by fees everytime i transfer? ",
            "My week in Crypto: waiting to be verified on a new exhange so I can get some more XMR and LTC! ",
            "fun fact: monero has i2p router in development called kovri https://github.com/monero-project/kovri\n\nkovri was chosen because it's more anonymous than tor\n\nhttps://monero.stackexchange.com/questions/16/why-was-i2p-chosen-over-tor-for-native-monero-integration\n\nThat table is missing a ton of criteria: forced anonymity?, shows amounts? (xmr uses ringct), trusted setup (lol)?, ico vs fair distribution?\n\nico = bad distribution = PoS security risk since coins directly affect security\n\nI see nothing about no fees on it which won't make sense since you have to protect against sybil attacks in some way, and there are some experimental ways in some coins, but I see nothing like that here. I'm sure since it's not used heavily the fees are just low or the blocks aren't full so there's no concern about prioritizing transaction until it's heavier used - the case with most altcoins.\n\nFees are a solution to a problem of how to avoid requiring infinite bandwidth to validate nodes which is a security risk - blocksize limit needs a way to prioritize tx - they are normally fees. xmr uses adjustable blocksize automatically changing to account for increases or decreases to keep it secure and on small size but still needs fees\n\nzerocash and pivx required trusted setup, so they are not an option for trustless crypto.\n\nxspec has zeroknowledge proofs so it also required trusted setup and thus not an option for trustless crypto https://bitcointalk.org/index.php?topic=1704473.0\n\nperpetual 5% yearly inflation is much higher than [xmr's plan](https://en.wikipedia.org/wiki/Monero_\\(cryptocurrency\\)) of < 0.87%. \n\noh god it has a rich list LOL https://chainz.cryptoid.info/xspec/#!rich\n\nfor comparison, this is xmr rich list: http://moneroblocks.info/richlist (it's literally impossible)\n\nFew more things like we're not entirely sure PoS3 is secure against double spend attacks and nothing at stake issue PoW solves elegantly. Other forms of PoS might be better, but it's debatable and hasn't been tested properly.\n\nI guess point is: probably more to read",
            "Monero has a variable blocksize which adjusts to the transactions.",
            "Monero and Litecoin - market share",
            "Would Monero call this \"THE DARKENING\"? Lol\n\nI'm sure they already have some clever term for it in the Monero community ",
            "BTC\t5.37%\nNEO\t20.49%\nLTC\t23.13%\nDCR\t12.40%\nXMR\t6.67%\nOMG\t4.12%\nPIVX\t1.43%\nRISE\t0.05%\nARK\t4.83%\nBCH\t3.15%\nDASH\t12.06%\nCASH\t6.31%",
            "Eth, omg, neo, xmr, ark, golem, btc",
            "33% BTC (& BCH because of split), 23% Eth, 19% Neo, 11% ltc, 10% XMR, 2% FCT, 2% MCO  and $25-$50 each of 20 assorted supershit coins (ARK, SC, BNT, Golem, CFI, Doge,etc)",
            "Ark Xmr Eth",
            "Bitcoin, litecoin, monero plus recently Bitcoin cash.\n\nAs I am still looking for useful crypto I added recently iota and decred as high risk one but with potential.\n\nI reckon I got to many but that is it at the moment. ",
            "Litecoin vs. Monero - which one's a better buy?",
            "Long term I would go with Monero, I bet the price drops down to 100 again though. ",
            "I'd suggest to put a small percentage into coins which are not adopted now, but have huge potential in the future. This way you can grow your main stack. For the sake of not shilling I'm not mentioning which. But the “conservative“ is way too boring for me. Look at coins which seem to have found their bottom now. I think when the xmr hype is over, you will see big profit taking.",
            "If I were considering both, I'd diversify between the two. If it *had* to be one of them it would be Litecoin, as I see it's adoption increasing after atomic swaps are implemented. I also think Monero may face regulatory pressure due to its anonymity, but who knows really.",
            "I would say that you need to buy at least 5 coins such as Factom, Dash, Monero and Stratis in addition to ETH. All have good teams and clear functionalities",
            "Monero's coming up",
            "Fuck I was just about to buy XMR before it pumped past $60. ",
            "A blockchain is blocks that are linked together. Think of each block as a piece of paper with records of transactions. This block is sealed using cryptography by creating a one way hash. If the data were altered in that block, it would not match the hash so it would be invalid. Each block has a reference to the previous block which is the previous blocks hash. Thus creating the chain. It is basically a super secure  (cannot be altered) ledger. The difference between coins are algorithms, and features they implement  (like privacy).\n\nI'm crypto, there are a few types of coins. Currency (bitcoin, litecoin, monero,dash). platform (ethereum, neo, tezos, eos,ark,ardor, waves, lisk). Application (gambling, distributed compute, even a VR second life type game where you buy land and build whatever you want on your plot).\n\nNow there is another technology important in this space called smart contracts. That is basically an automated way to transfer funds when something happens. An example of this is renting out your cpu. I'm a statistician but I don't have large processing power. I can use a dApp  (decentralized application) to submit my numbers to crunch, and other people's processing power does the work for me. I paid 1 coin to do this so that 1 coin is split between the miners. There are distributed compute products out there already (Golem, elastic), I'm not sure if that's exactly how they work. Just an example.\n\nRead whitepapers. For real. It's a lot of work and you'll probably have trouble understanding the technology or value in it, but that's how you pick the long term winners with big gains. On the other hand, this market is very unreasonable, especially when you consider virtually all the money coming in is speculation and not use of any products. My point is, people will throw money at hype, so keep your ear to the ground and try to ride the hype wave if you can.\n\nWatch the order books. You can see how much buy/sell pressure there is. Large sell walls mean the price is either steady or going to fall soon. That's because when a sell happens, it is sold to the highest bidder,  say $10. Then the sell price is at the next highest bidder, $9. So if someone has a sell order of $50k, the buyers may not break through that. Also, other sellers will need to post a lower asking price to dump their coins. Be wary of these walls though, whales will use them to manipulate the price, and they can be very good at doing so. If you see constantly moving walls, that's provably a whale.\n\nFinally, take this with a grain of salt. These are all things I've noticed/learned and I certainly haven't made millions in crypto. Have made a few grand though. Ymmv.",
            "So I bought a Bitcoin back in 2013 on a whim for 300 bucks and pretty much forgot about it. Really wish I had been buying in for a small amount monthly since then..\n\nI already have my 401k and Roth maxed so I decided to use my fun money to buy into crypto. This chart represents a total buy in of 7K. From here on out I have $600 a month to invest.\n\nSo far I got really lucky with Monero and Lisk. Got my Monero for ~50 and Lisk for ~2. ",
            "This is pretty solid.  And safe.  I'd consider some NEO and LTC to be honest.  If you want to gamble, you can put some in XRP and DNT.  I think monero percentage is a bit high - that may be to the recent surge though, but overall very solid.  Honestly, you're doing great -- don't listen to anyone on here unless they have some good reasoning.  Keep it up!"
        ],
        "upvotes": [
            65,
            38,
            12,
            2,
            1,
            -1,
            0,
            1,
            3,
            2,
            1,
            3,
            5,
            4,
            5,
            6,
            2,
            1,
            1,
            3,
            6,
            1,
            1,
            0,
            2,
            1,
            3,
            2,
            2
        ]
    },
    "XMY": {
        "full_name": "Myriad",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XRP": {
        "full_name": "Ripple",
        "mentioned_ids": [
            "dm790al",
            "dm76hbj",
            "dm7gn6z",
            "dm7lwsh",
            "dm7r31z",
            "6wbzgf",
            "dm70ntm",
            "dm72fg9",
            "dm78v45",
            "dm6n3v6"
        ],
        "mentioned_times": [
            1503887299.0,
            1503884098.0,
            1503897266.0,
            1503904335.0,
            1503911339.0,
            1503866880.0,
            1503876792.0,
            1503879077.0,
            1503887110.0,
            1503845477.0
        ],
        "text": [
            " I like:  ETH, OMG, PAY, FCT, LSK, XMR, BTC, XRP, IOTA, ",
            "ARK, XRP",
            "XRP for obvious reasons. I would love to live in an alternate universe where we could truly take down fiat and all, but I don't think that will happen, at least for a while. In the interim Ripple is giving us the chance to capitalize on the government's and banking system's sticky fingers. They are helping implement this new technology working within the framework of the current system, not threatening to tear it down. This will gather support from financial institutions, governments, and in a more macro sense, the general public. Plus all this crypto shit has enormous tax evasion potential for big business, which opens up lucrative possibilities for us low level speculators. ",
            "I'm going all in with ripple. Just wait until the recent bubble pop and go all in. I believe in its technology. ",
            "Fast and cheap bank transfers.\n\nI've done business with people overseas, and even started a business with an international cofounder.  It always seemed weird with how long it took to send him money.  I eventually just started keeping a whole bunch of money in Paypal, just so it could shorten at least one end of the transfer process (he would only have to wait for the money to transfer to his bank on his end).  \n\nI know that to most people it's a really boring problem, especially with a whole bunch of other cool techs coming out, but when I first heard about Ripple and XRP, it was a real \"Thank god,\" type moment.",
            "Blockchain Technology Adoption And Ripple",
            "If Ripple is the best medium to transfer that's fine. People don't like investing in Ripple. Nothing wrong if you are only using it as a medium of transfer.\n\nKraken is the worst exchange I've used to date though (slow to load, unintuitive, poor displays, terrible menus). I think it's geared towards CLI than GUI but that's neither here nor there.",
            "I can't buy Ripple on Coinbase, but I can buy LTC and I like LTC more.",
            "Omg, lisk, iota, eth, btc, Bch, sia, xrp, dnt and safex",
            "This is pretty solid.  And safe.  I'd consider some NEO and LTC to be honest.  If you want to gamble, you can put some in XRP and DNT.  I think monero percentage is a bit high - that may be to the recent surge though, but overall very solid.  Honestly, you're doing great -- don't listen to anyone on here unless they have some good reasoning.  Keep it up!"
        ],
        "upvotes": [
            38,
            4,
            3,
            1,
            1,
            6,
            2,
            0,
            2,
            2
        ]
    },
    "XST": {
        "full_name": "StealthCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVC": {
        "full_name": "Vcash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XVG": {
        "full_name": "Verge",
        "mentioned_ids": [
            "6we7f4"
        ],
        "mentioned_times": [
            1503891015.0
        ],
        "text": [
            "Verge (XVG) up 40% against BTC and down 14% to USD ?"
        ],
        "upvotes": [
            3
        ]
    },
    "XWC": {
        "full_name": "WhiteCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "XZC": {
        "full_name": "ZCoin",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ZCL": {
        "full_name": "Zclassic",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "ZEC": {
        "full_name": "Zcash",
        "mentioned_ids": [
            "dm72812"
        ],
        "mentioned_times": [
            1503878809.0
        ],
        "text": [
            "From big share to smaller share..\nRate it pls\n\nBtc\n\nNeo, vtc, dgb\n\nDash, eth\n\nOmg, ltc, zec\n\nIota, ark\n\nRDD, lisk"
        ],
        "upvotes": [
            4
        ]
    },
    "ZEN": {
        "full_name": "Zencash",
        "mentioned_ids": [],
        "mentioned_times": [],
        "text": [],
        "upvotes": []
    },
    "submissions": [
        "6wcxoo",
        "6wcnhy",
        "6waolz",
        "6wdjij",
        "6wcqj9",
        "6wcqwv",
        "6watyl",
        "6wbun7",
        "6wenel",
        "6wc1r4",
        "6wdg4d",
        "6waond",
        "6wdjwc",
        "6wcx3d",
        "6wb7fk",
        "6wc7mh",
        "6wb6am",
        "6wbbdz",
        "6waj6q",
        "6wclr4",
        "6wbhqs",
        "6wegdf",
        "6wf3ff",
        "6wc7nc",
        "6wd00m",
        "6waqf0",
        "6we1id",
        "6wctwf",
        "6wb52n",
        "6wavgk",
        "6wf9fr",
        "6weajl",
        "6wbkau",
        "6waxfd",
        "6wexd7",
        "6wcdye",
        "6wcbg1",
        "6wbzu5",
        "6wbm8o",
        "6wf91b",
        "6wc54s",
        "6wbb3e",
        "6wglcu",
        "6wbzgf",
        "6wbwx8",
        "6wfjxm",
        "6wdn3o",
        "6wb487",
        "6way04",
        "6walv5",
        "6wfhtn",
        "6we3pn",
        "6wdyqj",
        "6wd4m7",
        "6wcyok",
        "6wckqo",
        "6wccok",
        "6wc65v",
        "6wbazi",
        "6wgdzm",
        "6wg857",
        "6wfisl",
        "6wet6p",
        "6wcmqx",
        "6wcc8m",
        "6wbyxn",
        "6wbsbg",
        "6wb55u",
        "6war3h",
        "6wgidv",
        "6wghy9",
        "6wgam9",
        "6wg8ml",
        "6wfxuk",
        "6wfp34",
        "6wfouj",
        "6wf0sr",
        "6we7f4",
        "6wdxts",
        "6wdvhm",
        "6wdu4o",
        "6wdpv3",
        "6wcwdz",
        "6wcqhd",
        "6wcij3",
        "6wcglu",
        "6wcc2d",
        "6wc007",
        "6wbxgh",
        "6wbtnb",
        "6wbsxe",
        "6wa816",
        "6wfqsx",
        "6wford",
        "6wfmbl",
        "6wfioh",
        "6wfgtj",
        "6wfgfl",
        "6wfefn",
        "6wf5fl"
    ]
}